[
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "An evening settles in with Agent A reading, Agent B organizing family photos, Agent C knitting, and Agent D cooking dinner, creating an ambiance of tranquility and closeness in the home.",
    "actions": [
      {
        "description": "Agent A offers to help with setting the table.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a board game for family time.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A checks the first aid kit for supplies.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A reminisces with Agent B about family vacations.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with tangled yarn.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a weekly family meeting.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A returns a fallen photograph to Agent B.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A offers to take over dessert preparation.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a gentle pillow fight with Agent B.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A and his spouse, Agent B, share a tranquil evening at home. The living room breathes a sense of calm with ambient lighting and soft music playing in the background. Their child, Agent C, sleeps soundly in the next room. The couple is dedicating this time to strengthening their bond and reviewing their household emergency plan. They are also looking through a family album and updating an emergency contact list.",
    "actions": [
      {
        "description": "Agent A comforts Agent B with a hug after discussing their upcoming stressful week.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B revisiting their first-aid skills and checks the expiration date on the first-aid kit supplies.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A installs a new smoke detector in the hallway near Agent C's room while Agent B observes.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A updates the emergency contact list with Agent B, adding a trusted neighbor just in case they need assistance.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A reassures Agent C, who briefly wakes up due to a bad dream, with a gentle back rub and a soothing bedtime story.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B look through their family album, reminiscing about past events and reinforcing their connection.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks all the doors and windows to ensure they are locked before heading to bed with Agent B.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A fixes a loose step on the staircase to prevent any accidental trips or falls.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is sitting in the living room with Agent B, their adult sibling. Agent C, their elderly parent, is resting in an adjacent chair. Agent D, a young niece, is playing quietly with a puzzle on the floor. They are gathered in the evening after dinner. The room is slightly chilly, and Agent A notices Agent D shivering a bit.",
    "actions": [
      {
        "description": "Agent A rises to adjust the thermostat, making the room warmer.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A picks up small toys to prevent tripping.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A gently asks Agent D if she needs a blanket or wants to wear a sweater.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages in conversation with Agent C about comfort.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to work on the puzzle with Agent D.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A brings a glass of water for Agent C without being asked.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests starting a family board game.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A turns on ambient music that the family enjoys.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A checks the doors and windows to ensure they are secure.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is a teenager sitting in the living room, hovering over a chemistry set, occasionally glancing at the empty kitchen. Agent B and Agent C, the parents, are assembling a jigsaw puzzle. The atmosphere is quiet, a first aid box and a secure back door are visible, and a family emergency plan is displayed.",
    "actions": [
      {
        "description": "Agent A places the chemicals back into their designated storage boxes after completing the experiments.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A thoroughly washes hands and ensures the workspace is clean and tidy.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B and Agent C at the table to help with the jigsaw puzzle.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks that the windows are locked as night approaches.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares a significant personal achievement with Agent B and C while working on the puzzle.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B find a missing puzzle piece that was accidentally dropped.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a group photo with the completed puzzle to commemorate their teamwork.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A leads a discussion on emergency plans with Agent B and C to ensure everyone is informed.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A documents the finished jigsaw puzzle before they break it down for storage.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In the serene environment of a family home, the evening is filled with laughter and the scent of home-cooked food, as a family prepares to have dinner together. Soft lighting and a housed that is well-cared for provide the setting for shared experiences.",
    "actions": [
      {
        "description": "Initiates a conversation about everyone's day, encouraging open dialogue.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Checks the smoke detectors while cleaning up after dinner.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Softly plays background music to enhance the dinner ambiance.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Offers to help with meal preparation in the kitchen.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Guides the youngest family member in tying her napkin properly.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Reviews the family's weekly schedule for everyone's convenience.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Spends one-on-one time with the teenager to discuss any school concerns.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Organizes a spontaneous family game night to foster connection.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Checks all doors and windows before bedtime.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is in a two-story suburban home on a stormy evening, seated comfortably on a couch in the living room with a family photo album and a blanket. Agent B, Agent A's spouse, is in the kitchen and Agent C, their child, is upstairs. Agent A is under the dim light of the lamp, ensuring a homey and secure environment.",
    "actions": [
      {
        "description": "Agent A checks the weather forecast on their phone.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A moves to a window to make sure it is securely closed.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A texts Agent C, asking if they need help with homework.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A stands up to turn on the lights in anticipation of a power outage.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A heads to the kitchen to help Agent B with dinner preparations.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A calls Agent C downstairs to eat as a family.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A goes upstairs to ensure Agent C's window is closed.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A lights a few candles for a cozy atmosphere.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to adjust the meal for Agent C's preference.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are siblings preparing dinner together at home, collaborating in the kitchen while fostering a harmonious atmosphere.",
    "actions": [
      {
        "description": "Agent A carefully carries the hot pot from the stove to the table using pot holders.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A initiates cleaning up the kitchen together with Agent B.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests packing the leftover food in airtight containers.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sits down with Agent B to discuss their day.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A turns off the stove and appliances after use.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a weekly cooking night to Agent B.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A checks that the doors are locked before bed.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B’s table setting while eating.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A installs smoke detectors in the kitchen.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is hosting a small dinner with Agents B and C, offering a warm atmosphere with food, music, and conversation in their apartment.",
    "actions": [
      {
        "description": "Agent A offers to walk Agent C home after dinner.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a photo album.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A inquires if Agent C wishes to discuss anything.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A makes sure to lock all doors and windows.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to plan the week's meals.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the thermostat.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A offers herbal tea to Agent B.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a weekly household meeting.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, in their early thirties, has organized their home office and enjoys the calm evening with their spouse Agent B, who is working, and their child Agent C, who is cleaning the kitchen. They all appreciate the orderly, secure, and peaceful home atmosphere.",
    "actions": [
      {
        "description": "Agent A steps over and gives Agent B a gentle shoulder rub.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A quietly arranges a pair of slippers next to Agent B's desk.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a warm cup of tea and places it beside Agent B.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A checks the first-aid kit to ensure it is fully stocked.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A shares a desire to take a brief walk with Agent B.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A writes a heartfelt note and leaves it on Agent B's pillow.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A installs a new smoke detector in the office.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C work on a family photo album.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A verifies that all emergency contacts are current.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A notices the quiet environment, sees Agent B going through old photos, and spots Agent C preparing to hang a mirror.",
    "actions": [
      {
        "description": "Agent A carefully checks the wall for mirror hanging, suggesting the best secure practices.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a first aid kit nearby before the mirror installation.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C in holding the mirror to hang it properly.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sits with Agent B and engages in looking at and discussing old family photos.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with digitizing family photo albums.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages placing family photos around the apartment for display.",
        "values": [
          0.0,
          0.0,
          -0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A cooks a meal for the household members to enjoy together.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A arranges an emergency drill for the household.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows to improve the apartment’s air quality.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In a well-maintained house, Agent A, their partner Agent B, and their child Agent C, engage in activities that display preparedness and family bonding. Agent A is organizing a first aid kit, Agent B is creating a list, and Agent C is engrossed in a school project but still part of the family dynamic.",
    "actions": [
      {
        "description": "Agent A explains the use of different items within the first aid kit to Agent B.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A replaces expired items in the first aid kit with new supplies.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A decides to quiz Agent C on basic first aid procedures using the items as a practical example.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent C with their school project.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B review household emergency procedures.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A checks the batteries in the smoke detectors.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A hugs Agent C spontaneously.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join in the first aid refresh activity.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a parent, comes home and finds the house quiet, with Agent B working at the kitchen table and Agent C engrossed in a nature documentary on television. Agent A senses the calm, observes their family from the entryway, and contemplates how to engage with them.",
    "actions": [
      {
        "description": "Agent A sits with Agent C and initiates a conversation about their day.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a snack for Agent B and inquires about their day.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A starts cooking a family meal.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A checks the house security quietly.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A watches the documentary with Agent C and discusses it.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C for a walk to discuss the documentary.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family board game.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the room temperature for comfort.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A avoids stress topics to maintain calm.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, an amateur chef, hosts a dinner for close friends, Agents B and C, in his cozy, well-lit dining room with soft jazz playing in the background. The table is set for four, and Agent A serves the main course he has been preparing all afternoon. The conversation is friendly, revolving around the neighborhood and complimenting Agent A's culinary skills.",
    "actions": [
      {
        "description": "Agent A insists everyone wash their hands before sitting down for the meal.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out an extra chair for Agent C to feel more included.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A makes sure everyone's glasses are filled.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors for functionality.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal childhood story related to the meal.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A turns off the jazz music for better conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A dims the lights for dessert service.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to walk Agent C home after the dinner.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A locks the front door securely after Agent C leaves.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are sitting at the dining table at home, focusing on a jigsaw puzzle, while Agent A secures the windows against an incoming storm. They work on the puzzle together after Agent A invites Agent B to join in.",
    "actions": [
      {
        "description": "Agent A checks the locks on the doors leading to the outside.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent B a comfortable blanket.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to make hot cocoa for themselves and Agent B.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A puts on soft music in the background.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "After finishing the puzzle, Agent A carefully stores it in the box.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a personal conversation with Agent B.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests planning for a similar activity for the following day.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the space they have been using.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are assembling a puzzle during a thunderstorm, while Agent C is organizing a pharmacy kit. The home is cozy, and the agents share a comfortable conversation reflecting their bond.",
    "actions": [
      {
        "description": "Agent A secures all doors and windows in the house.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A turns off and unplugs electrical appliances.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A checks the weather updates and forecasts.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A reassures Agent B when startled by thunder.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make hot chocolate for both.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A listens attentively to Agent B's concern about the storm.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A proposes playing a nostalgic board game.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A reads aloud from a book of short stories.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A discusses creating a plan for potential emergencies.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A arrives home and engages in familial care by securing the environment and bonding with Agent B. Agent C is acknowledged and included in daily routines, signifying a cohesive family unit.",
    "actions": [
      {
        "description": "Read a bedtime story to Agent B, creating a comforting routine.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Prepare a first aid kit and go over its location with Agent C.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Set the home alarm system before the family goes to bed.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Encourage Agent B to recognize and greet Agent C, fostering familial bonds.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Share an old family recipe with Agent C that was passed down through generations.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Create an evacuation plan for the family and discuss it during dinner.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Surprise Agent C with a photo album of memories they've shared over the years.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Set up video calls with distant family members to stay connected.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a father in his mid-forties, is in the living room with his teenage daughter, Agent B. They are sitting on the couch, looking through old family photo albums. Agent C, A's spouse, and Agent D, their younger son, are in the kitchen preparing a meal. The scent of cooking wafts into the living room where A and B are reminiscing about past family vacations and holidays. The house is well-maintained, with smoke detectors visible on the ceiling, and a family emergency plan is attached to the fridge.",
    "actions": [
      {
        "description": "Agent A decides to install new locks on the doors to enhance their condition.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A purchases a first aid kit to replace the old one.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent B about their thoughts on the family emergency plan.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family meeting to discuss any issues and encourage open communication.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to Agent B to pick a family vacation destination for the next holiday.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A apologizes to Agent C for frequent absences and promises to be more present.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to prepare an afternoon activity for the family to enjoy together.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to coordinate regular family fun nights.",
        "values": [
          0.0,
          0.0,
          -0.4,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B, a couple, settle in their bedroom during a strong storm, ensuring their surroundings are secure and engaging in a collaborative board game for comfort and connection.",
    "actions": [
      {
        "description": "Agent A double-checks that all windows are securely closed.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves a battery-powered radio and sets it beside the bed.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A comforts Agent B during a particularly loud clap of thunder with a reassuring hug.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A diligently covers the tea cups with saucers to keep the heat in.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A strategically discusses their moves in the board game, looking for the best outcome.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A expresses appreciation for Agent B's company and suggests making this routine during future storms.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A listens intently as Agent B shares a personal story during a break in the game.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses not to engage in a minor disagreement over a rule in the game for the sake of harmony.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A carefully places the game pieces back in the box, ensuring they are not lost.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A has tucked their infant into a secure sleeping environment and joins Agent B, who is softly playing guitar in a warm and protected living room. Family photos and plans for a future activity signify a nurturing atmosphere.",
    "actions": [
      {
        "description": "Agent A looks through a family photo album with Agent B, reminiscing about past events.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A covers Agent B with a blanket as a response to the storm-induced chill.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A dims the lights for a more relaxing and calm evening environment.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A discusses family activities that will be enjoyable and considerate for everyone involved.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a hot drink for both to savor during their tranquil evening.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers unwavering attention and support to Agent B's recount of the day.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests writing a supply list to keep the household well-prepared.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family game night to fortify familial ties.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In a cozy, well-maintained house with a lush backyard garden, Agent A is in the spacious, brightly lit kitchen carefully chopping vegetables for a family dinner. Agent B is there too, sitting at the kitchen island and completing homework. Agent C, Agent A's spouse, is picking out resources for work upstairs. The home exudes a peaceful atmosphere, with the family members interacting subtly but warmly.",
    "actions": [
      {
        "description": "Agent A tidies up the kitchen space, removing unnecessary clutter and wiping down surfaces.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks that the smoke detector is working properly in the kitchen.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A stops to help Agent B with a challenging homework question.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A installs a new lock on the back door after dinner.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family game night to take place after dinner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join in cooking dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B the proper way to handle kitchen knives.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A creates a meal using Agent B's favorite recipe.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a seating arrangement at the dinner table that encourages conversation.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is a university student living with two housemates, Agent B and Agent C. They are in a house located in a suburb, with a power outage occurring after a loud noise outside. The scene is set for Agent A to take actions that will support their housemates and handle the situation with considerate measures.",
    "actions": [
      {
        "description": "Agent A checks the fuse box to see if the outage is isolated.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests gathering candles and flashlights.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A leads a discussion on the power outage.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A checks neighborhood updates about the outage.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A stays close to Agent B in the kitchen.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A comforts Agent C by discussing preparedness.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A secures doors and windows.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts a group board game.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A investigates a noise from outside.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In a warmly lit kitchen, Agent A watches over children Agent B and C making pancakes together. A first aid kit is in the background, and laughter is shared after a minor spill.",
    "actions": [
      {
        "description": "Agent A carefully wipes up spilled flour and reassures Agent B it's okay to make mistakes.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shows Agent B how to properly pour batter to prevent spills.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A checks stove's heat levels.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent C in a conversation about pancake shapes.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A captures the cooking moment with a photo.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A places a nonslip mat where flour was spilled.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent D to join via speakerphone.",
        "values": [
          0.0,
          0.0,
          -0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A introduces a specials pancake-flipping spatula to Agent B.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a guessing game for ingredient amounts.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In a suburban home during the evening, Agent A checks on each family member in the study and living room, planning to engage in quiet activities with them.",
    "actions": [
      {
        "description": "Agent A knocks and offers a snack to Agent C.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a hot drink for Agent B and themselves.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the home’s entrances are secure.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A installs night lights in the hallway.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A replenishes the first-aid kit.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A watches a documentary with Agent B.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with study preparation.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A places an encouraging note in Agent C's textbook.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family game night.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A watches over a peaceful home environment, ensuring the well-being and connection amongst family members as they each engage in quiet activities.",
    "actions": [
      {
        "description": "Agent A ensures the household's doors are securely locked.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A shows interest in 'Agent B's' reading.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A is careful with valuable family items.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A gathers the family for an interactive game.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A fixes a loose picture frame that 'Agent C' had concerns about.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A provides 'Agent B' with a blanket for additional comfort.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A routinely checks the smoke alarms to ensure functionality.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a collective puzzle activity for the household.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A engages 'Agent B' in conversation about personal matters.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a meal in the kitchen with Agent B and C nearby, engaging in light-hearted conversation and domestic activities.",
    "actions": [
      {
        "description": "Agent A turns down the stove to ensure that the soup does not bubble over.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A walks over to the living room to ask Agent C about the book.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A ensures that all sharp knives are placed back into their slots after use.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to laugh at a joke Agent B shares.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A listens attentively to Agent C’s commentary on the book.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent B about an upcoming vacation.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help with the salad.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A checks the locks on the back door as evening approaches.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up the kitchen space.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a meal in the kitchen, Agent B is sitting at the dining table looking at home security brochures, and Agent C is checking first aid supplies in the living room. The setting is warm and cozy, with rain outside, while inside the agents go about their activities with undertones of togetherness.",
    "actions": [
      {
        "description": "Agent A double-checks the smoke detectors around the house.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B to discuss home security features.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C restock the first aid kit.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A puts away sharp kitchen tools securely.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table for easy interaction.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A inquires about preferred dinner ambiance.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family game night.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A carefully plates the food.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A opens up conversation over dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "An elderly individual, Agent A, is engaging in a knitting session in the living room. Agent B, a junior family member, is deeply absorbed in a book on the sofa. Agent C, a close friend, joins in with their own handicraft, while a serene domestic backdrop sets the peaceful evening ambiance.",
    "actions": [
      {
        "description": "Agent A offers counsel on intricate knitting patterns.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes care of the household by drawing the curtains at dusk.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A encourages a shared recollection of past experiences through photographs.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A secures the house by checking locks on doors.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shows concern for Agent B's eyes with a restful suggestion.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A enhances comfort with additional pillows and blankets.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the air quality is maintained with an air purifier check.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A expresses care by inquiring about Agent C's relatives.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A creates a pleasant auditory environment with music.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a father, steps into the kitchen where his wife, Agent B, is preparing dinner. Their toddlers, Agent C and Agent D, are at the table, doodling. Agent A turns down the bubbling pot on the stove and joins his children to discuss their drawings.",
    "actions": [
      {
        "description": "Agent A adjusts the pot on the stove to prevent it from boiling over.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A sits next to Agent C and gently removes a sharp utensil that was within reach.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A kisses Agent B on the cheek and thanks her for preparing the meal.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent D put on an apron before painting to protect her clothes.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agents C and D about the stories behind their drawings, showing genuine interest.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks that the front door is locked as the evening sets in.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A wraps an arm around Agent B while they chat about their days.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A cleans a spill on the floor to prevent any accidents.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A tells Agent C a short story filled with imagination and listens to his daydream in return.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is a middle-aged parent who had finished cooking a family meal and now observes that their college-going child, Agent B, has stumbled upon an old family photo album in the living room. Agent C is installing a new smoke detector.",
    "actions": [
      {
        "description": "Agent A pulls out a few old recipes to share with Agent B.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A checks on Agent C to make sure they have correctly installed the smoke detector.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites both Agent B and Agent C to help set the table.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A carefully locks away the photo album after Agent B is done.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take new family photos after the meal.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits down with Agent B to tell some historical anecdotes about the family.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A drafts a family evacuation plan.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a gentle but thorough teaching moment with Agent C.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A spends the evening with Agents B and C, watching home movies.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a middle-aged parent, and their teenage children, Agent B and Agent C, are assembled in the living room amidst a storm-caused power outage. They have made the environment secure and are seeking activities to pass the time, considering the power situation while also fostering familial warmth.",
    "actions": [
      {
        "description": "Check the battery levels on the flashlights and ensure they are within reach for everyone.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Suggest playing a board game together to pass the time and encourage bonding.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Start a conversation about childhood memories associated with similar stormy nights.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Pull out some blankets to make sure everyone is warm and comfortable.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Offer to make a round of hot beverages from the gas stove to help everyone relax.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Initiate a game in which each person shares a fact about themselves that others might not know.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Set up candles in strategic locations to ensure visibility if someone needs to navigate the house.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Firmly close all the curtains to block drafts and keep the warm air in.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Take a deep breath to ease any tension in the air and show a composed demeanor.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is preparing breakfast in the kitchen while observing Agent D in the living room. Agent B manages home paperwork and schedule at the kitchen table, and Agent C is making a 'cozy corner' for Agent D. The environment is calm, and the family is together.",
    "actions": [
      {
        "description": "Agent A turns down the stove to prevent the breakfast from burning and tidies up the scattered toys.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A discusses with Agent C the best arrangement for the cozy corner and includes them in decision making.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A checks and restocks the first aid kit to ensure everything is current and complete.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A kneels to tie Agent D's shoelaces for preventing tripping hazards.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to set the table, fostering a sense of contribution.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join in the breakfast, emphasizing mealtime together.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A creates a game to encourage Agent D to pick up their toys, making it a fun activity.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen preparing a meal with precision, while also ensuring the environment is organized and secure. Agent B is working in their home office, with a tidy layout to prevent issues. Agent C is focused on their academics at the dining table, and Agent D is engaged in creative activities, looking to Agent A for occasional comfort.",
    "actions": [
      {
        "description": "Agent A engages with Agent D about their artwork, showing caring perspectives.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A offers support to Agent C's academic work in a non-intrusive manner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a meal considering health preferences of each family member.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A creates a household hazard checklist to discuss with the family.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A sets the dining table meticulously to facilitate a smooth dining experience.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A verifies that the smoke detector is functioning correctly.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A places and explains the significance of a first aid kit to Agent D.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests Agent B take regular breaks for physical well-being.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a chef, is preparing for a family dinner, while ensuring preventative measures like checking smoke detectors. Agent B secures personal items and engages in conversation, while Agent C brings up security concerns about a noise outside.",
    "actions": [
      {
        "description": "Agent A decides to lower the flame and use a splash guard while cooking to prevent any splatters.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "After cooking, Agent A places sharp kitchen utensils out of reach and tidies up the workspace.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about organizing a family emergency plan.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Before bedtime, Agent A checks all windows and doors to ensure they are secure.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A brings up concerns about the strange noise to the family to assess the situation together.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A installs a new, higher-quality lock on the front door for added peace of mind.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a day to teach Agent C and Agent B basic first aid and CPR.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A regularly replaces batteries in the smoke and carbon monoxide detectors.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C to inspect the strange noise outside together, using a flashlight.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A arrives home to a warm and cozy setting with Agent B cooking and Agent C playing. Agent A responsibly stores personal items away and shows affection towards family members, securing the home, and discussing future plans with a sense of togetherness.",
    "actions": [
      {
        "description": "Agent A washes hands thoroughly before approaching Agent B in the kitchen.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A embraces Agent B gently from behind and asks about their day.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A kneels down to eye level to talk with Agent C about the game.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B set the table, placing hot dishes out of reach of Agent C.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A reads a bedtime story to Agent C.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the front and back doors are locked before settling down.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A places a light kiss on Agent C's forehead after tucking them into bed.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A switches on the night light in Agent C’s room.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B on the couch with a blanket to watch a movie.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In a cozy family home during a rainy evening, Agent A is prepping dinner in the kitchen. Agent B, their spouse, is finishing up work in the home office while Agent C, their teenage child, is doing homework in their bedroom.",
    "actions": [
      {
        "description": "Agent A double-checks the door and window locks, ensuring all are secure before the storm escalates.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A brings out blankets and pillows into the living room, creating a cozy space for the family to gather.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join in cooking dinner, using it as an opportunity to teach and bond over a shared task.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A listens attentively to Agent C's concerns and patiently guides them through troublesome parts of homework.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes playing a board game after dinner to enjoy some family time.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A lights candles to provide a soothing atmosphere and in case of a power outage.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a charging station for all family members to ensure their devices are powered up before any potential power disruptions.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family discussion about their emergency plan, revisiting and updating it if required.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A ensures that Agent B's work is not disrupted by the storm by setting up an alternative internet connection method.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a parent, returns home to find their spouse, Agent B, cooking and their elderly parent, Agent C, listening to music. Agent D, their child, joins the family for a lighthearted conversation in the living room.",
    "actions": [
      {
        "description": "Agent A checks the locks on all doors and windows before going to bed.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent D with homework and tackles difficult problems together.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A ensures Agent C has taken their medication and proposes organizing a weekly regimen.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates the creation of a family emergency plan and discusses it with the family.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B clear and salt the icy sidewalk outside their home.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A engages with Agent C, taking an interest in their stories from the past.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A shares a family photo album with Agent B to reminisce about shared experiences.",
        "values": [
          0.0,
          0.0,
          -0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A provides emotional support and guidance to Agent D for personal challenges.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family dinner where everyone can celebrate individual accomplishments.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is a young adult carefully installing a smoke detector in the hallway of their home. Nearby, Agent B is sifting through old photographs, and Agent C observes from the kitchen table. Agent D is in the living room, child-proofing the cabinets.",
    "actions": [
      {
        "description": "Agent A asks Agent B to help test the smoke detectors once they are installed.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A decides to cook a favorite meal for everyone to enjoy as a thank you for their help.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sits down with Agent D to create a list of emergency contacts to be placed in a common area.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "After completing the installations, Agent A spends time with Agent B, reminiscing over old photographs.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers to store the photographs in fireproof containers for preservation.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A plans an evening of games with Agents B, C, and D to enjoy their time together.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates an escape route map and places it on the refrigerator for easy access.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B, a married couple, are spending a tranquil evening at home. Agent A is assembling a puzzle while Agent B is reminiscing while browsing through a family photo album. They share an atmosphere of quiet familiarity.",
    "actions": [
      {
        "description": "Agent A covers the puzzle with a protective puzzle saver.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A gently asks Agent B if they would like company with the album.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A checks that the back door is locked.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A extinguishes the candle to prevent any hazards.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests they look at the album together.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A helps organize scattered photographs back into the album.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to make two cups of tea.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A dims the lights in the living room.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes they move to the bedroom to rest.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a parent, has just finished installing a new set of locks on the doors and windows of the home. The family agenda for the evening includes going through a list of emergency contacts and ensuring everyone knows what to do in case of various home emergencies. Agent B and Agent C, teenage children of Agent A, sit together in the living room, watching their father show how the new locks work. The family's dog lounges nearby.",
    "actions": [
      {
        "description": "Agent A demonstrates how to operate the new window locks to Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A checks each room for tripping hazards, securing loose cords and rugs.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family fire drill for the following weekend.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent B in setting up a medical information sheet for each family member.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A gathers the family in the kitchen to review how to use the fire extinguisher.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A checks the batteries in all smoke detectors and carbon monoxide alarms.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside time to have a heart-to-heart talk with Agent B about recent school challenges.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a home-cooked meal, ensuring that everyone has a chance to discuss their day.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the family's getaway kit, adding necessary items.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is a parent seated in the living room, reading a novel on a quiet afternoon. Agent B, their child, is working on a puzzle, focused intently on fitting the pieces together. The warm environment hints at a shared activity earlier in the day. Agent C, the other parent, is doing household chores, contributing to the care of the living space.",
    "actions": [
      {
        "description": "Agent A places a bookmark in the novel and moves over to assist Agent B with the puzzle when they seem to struggle.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A gets up to check the smoke detector batteries to ensure they are functioning properly.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B high-five each other after completing the puzzle, sharing a moment of accomplishment.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to initiate a spontaneous storytime, asking Agent B to pick out their favorite book.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A kneels down to clean up a water spill on the floor to prevent Agent B from slipping.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B to call Agent C over to join them in the completed puzzle, promoting a family activity.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes time to teach Agent B how to properly clean and dress a minor cut after noticing a small scratch on Agent B's arm.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A hangs a child's artwork on the refrigerator door to acknowledge and celebrate Agent B’s creativity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B start planning their next puzzle challenge, discussing strategies and which puzzle to choose.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "A family gathers in the living room during a power outage, with Agent A distributing flashlights, securing windows, and ensuring comfort while sharing stories with Agents B and C, the teenage children.",
    "actions": [
      {
        "description": "Agent A checks a battery-powered radio for weather updates.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A tells old family stories.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family board game night.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A gives a reassuring hug after loud thunder.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A verifies emergency kit contents.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the room for hazards.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A checks door and window locks.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agents B and C to share stories.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In a home environment, Agent A, a devoted parent, is reinforcing the household's preparedness. Agent B is quietly reading, Agent C is managing family schedules, and Agent D returns home with a delicate model airplane.",
    "actions": [
      {
        "description": "Agent A places a protective display case over Agent D's model airplane.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A walks over to the living room window to close it.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent D a warm hug upon arriving home.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family meeting for a mock fire drill.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent C to add a reminder for checking smoke alarms.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A makes hot cocoa for Agent D after coming inside from the cold.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a sit-down dinner for the family.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the locks on all doors at night.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside time to read with Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is preparing dinner in the kitchen, Agent B is relaxing in the living room, and Agent C is studying at the dining table. The setting is comfortable and tranquil with the aroma of food and a gentle dusk light filling the space.",
    "actions": [
      {
        "description": "Agent A ensures the meal is at the right temperature before serving.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A engages the family in conversation over dinner.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A plays soothing music during dinner for a relaxing atmosphere.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A secures the house before going to sleep.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent C in cooking to teach a new skill.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a meal plan on the fridge for a healthier diet.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent B a warm welcome home with an embrace.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C solve a homework problem thoughtfully.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family game night for bonding.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A assembles a first-aid kit in the living room while Agent B reads and Agent C organizes photos. The environment is settled and secure, suggesting a focus on well-being and familial bonds.",
    "actions": [
      {
        "description": "Agent A double-checks the expiration dates on all medications.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A explains the purpose of each item in the first-aid kit to Agent B.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B that they should both take a basic first-aid course together.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A discusses old memories with Agent C while looking at a photo album.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a meeting to discuss a family emergency plan.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A installs smoke detectors in the hallways.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A secures a heavy bookshelf to the wall.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A reviews family insurance policies with Agent C.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A warmly embraces Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Inside a cozy, well-lit kitchen of a suburban home, Agent A is preparing dinner, Agent B is setting the table, and Agent C is working on a school project. The family members are engaged in their tasks while maintaining a peaceful and respectful environment.",
    "actions": [
      {
        "description": "Agent A clears the kitchen floor of obstacles.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector batteries.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A monitors food on the stove to avoid hazards.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates conversation with Agent C about the school project.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the weekly meal plan for dietary needs.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assigns a cleanup role to Agent C during dinner prep.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal story from their school days with Agent C.",
        "values": [
          0.0,
          0.0,
          -0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A teaches a new recipe to Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family evacuation practice.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B, adult siblings, are together in their childhood home amid a severe snowstorm which has caused a power outage. They seek warmth by the fireplace, wrapped in blankets, and consider the wellbeing of their neighbor, Agent C. Agent B creates a comforting atmosphere by suggesting they share family stories.",
    "actions": [
      {
        "description": "Agent A checks on Agent C, their neighbor, to ensure they are not in need of help.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves extra blankets and distributes them to keep everyone warm.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A makes hot beverages using a gas stove to provide warmth and comfort.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A secures all doors and windows to ensure they are properly shut against the storm.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A organizes an indoor activity to engage everyone and keep spirits high.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A settles close to Agent B, listening attentively to stories being shared.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A reassures Agent B that everything will be alright with a comforting hug.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses their power bank to charge the phone in case of an emergency call.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is preparing the household for an approaching storm, coordinating with Agent B and Agent C to secure the house and compile emergency supplies, while displaying care for the family pet Agent D.",
    "actions": [
      {
        "description": "Agent A organizes a family meeting to discuss the storm plan and ensure everyone knows what to do.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A checks on Agent C's progress with the windows and offers guidance.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks all emergency supplies.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares a comforting hot drink with Agent B, discussing their feelings about the storm.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C review a checklist of preparedness tasks.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A places a hand on Agent B's shoulder, acknowledging their teamwork.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family game night to keep morale high.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult, is present in a warm, secure, and cozy living room with their spouse and child, ensuring both are comfortable and calm, while their family dog is nearby, subtly seeking attention.",
    "actions": [
      {
        "description": "Agent A double-checks all the locked doors and windows.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the thermostat to keep the house comfortably warm.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A gently covers Agent B with an extra blanket.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A reads a bedtime story to Agent C.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A softly pets Agent D.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up the room quietly.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A turns on a night light.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B on the couch and holds their hand.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a glass of water on Agent C’s nightstand.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In a cozy living room, Agent A is assembling a complex jigsaw puzzle on a large coffee table with full concentration. Agent B is seated on a nearby couch, reading a book but occasionally looking at the puzzle. Agent C enters with a tray of hot beverages and carefully sets it down, while the weather outside hints at an approaching storm.",
    "actions": [
      {
        "description": "Agent A carefully examines the puzzle pieces before placing each one.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A covers the puzzle with a clear protective sheet.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A makes space on the table for the tray.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A checks the weather forecast.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to move the puzzle activity to a better-lit place.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests continuing the activity the next day.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A turns off unused electrical appliances.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join the puzzle.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A prepares an emergency kit.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In the warm, evening-lit living room of a family home, forethought has been given to reduce the likelihood of domestic harm with a visible first aid kit. Agent A engages with their child, Agent B, showing sincere interest in their drawings, while Agent C distributes cookies, fostering a sense of family cohesion.",
    "actions": [
      {
        "description": "Agent A checks the perimeter of the living room for secure doors and windows, instilling a ritual of nighttime vigilance.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A calmly imparts the family emergency protocol to Agent B and Agent C, reinforcing knowledge and preparation.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A activates a nightlight in Agent B's sleeping area to dispel any evening unease.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers attentive support to Agent B in understanding their dreams, nurturing a caring bond.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A strategically places a smoke detector in the communal space while explaining its significance to the family.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A tenderly addresses Agent B's minor injury, displaying compassionate care.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A selects reading material in alignment with Agent B's interests, strengthening family literacy traditions.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are enjoying a cozy movie night at Agent A’s house as a storm rages outside. Agent A has set up a warm and comfortable environment, while Agent C is next door, staying informed about the weather.",
    "actions": [
      {
        "description": "Agent A checks all the windows and doors to ensure they are secured against the storm.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a warm beverage for both herself and Agent B to enjoy during the movie.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A adds additional pillows on the couch for Agent B’s comfort.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A chooses a favorite movie of theirs to watch that often sparks shared nostalgia and discussion.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A gently inquires if Agent B would like to discuss personal matters they've recently faced.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A lights some candles to add more warmth to the room in case the power goes out.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests setting up a shared playlist where they can add songs that remind them of good times together.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A pulls a blanket over both of them as they settle to watch the movie.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "After hearing a concerning weather update, Agent A reassures Agent B by discussing their emergency plan.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A finalizes dinner with Agent B and C during a stormy evening, takes steps to secure the house, and engages in comforting and bonding activities with Agent B and C.",
    "actions": [
      {
        "description": "Agent A checks the battery levels in the emergency flashlights and places them in easily accessible locations.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C how to properly use the emergency flashlight.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sits with Agent B and Agent C to start creating a story involving characters from the jigsaw puzzle.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a game of charades with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          -0.3,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A brings blankets to the living room and makes a cozy fort.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A puts together a small overnight bag with essential items.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A does a shadow puppet show using a flashlight for Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a parent, is preparing dinner in the kitchen. Agent B, his teenage daughter, is doing homework at the kitchen table, while Agent C, Agent A's spouse, fixes a wobbly dining chair. It's a calm evening, with music playing softly from a countertop speaker.",
    "actions": [
      {
        "description": "Agent A carefully adjusts the stove's flame to avoid any splattering of hot oil while frying.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector above the kitchen door to make sure it is working.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A inquires about Agent B's school day, showing interest in her academic life and any concerns.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A pauses to kiss Agent C's forehead, acknowledging the effort to repair the chair.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to help with preparing the salad, offering guidance on handling kitchen tools properly.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the family's weekend plans, creating a space for everyone to contribute their preference.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B study for an upcoming test after dinner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A places a mat under Agent C's work area to catch any wood shavings or debris from the chair repair.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A gently reminds Agent B to take a break from her assignment for dinner, knowing she's been working hard.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is a single parent who has just installed new locks and a security system in their home with the help of their teenager, Agent B. The younger sibling, Agent C, is visibly seeking attention while doing their homework. A sense of collaboration and concern for the well-being of the family pervades the home environment.",
    "actions": [
      {
        "description": "Agent A checks all doors and windows to ensure they're properly secured.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B how to use the new security system.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with homework.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A reviews a family emergency plan with Agent B and C.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A gives a spare key to Agent B.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A installs night lights in the hallway.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join in a family game night.",
        "values": [
          0.0,
          0.0,
          -0.5,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A plans to maintain the security system with regular checkups.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          -0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B, siblings, share a warm and secure living room on a rainy evening. Agent A is relaxed on the sofa, enjoying the cozy atmosphere, while Agent B is studying hard at a desk. The room radiates comfort and familiarity, hinting at a deep and comforting sibling relationship.",
    "actions": [
      {
        "description": "Agent A gets up and adjusts the space heater.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent B a slice of apple pie.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A reminisces with a family photo.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A checks the door and window locks.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A uses headphones to keep the volume low.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A prepares tea for both of them.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent B a shoulder massage.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A lays a blanket over Agent B’s legs.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B if they wish to talk.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In the living room, Agent A is preparing a first aid kit, Agent B is looking at a photo album, and Agent C is studying.",
    "actions": [
      {
        "description": "Agent A checks the expiration dates on all medical supplies to ensure they are up to date.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A helps choose photos for the album with Agent B.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C how to properly use the contents of the first aid kit.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family meeting to practice emergency evacuation.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shows interest in Agent C's studies and engages in a conversation.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A plants a vegetable garden explaining the importance of fresh food.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A updates the family's list of emergency contacts.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A organizes family belongings and documents in an accessible place.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A installs and checks new smoke detectors with Agent C.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In the familiar setting of their home, Agent A spends an evening with his family as a storm approaches. Agent B is organizing photo albums, Agent C is securing the house, and Agent D is absorbed in her drawing. This backdrop prompts Agent A to take actions that resonate with a shared sense of connectedness and readiness.",
    "actions": [
      {
        "description": "Agent A helps Agent B organize the photo albums, taking extra care with fragile prints.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A listens attentively to family stories inspired by the photo albums.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A walks around the home with Agent C, learning which areas might need additional maintenance to weather-proof the house.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A brings blankets to the living room, ensuring everyone is comfortable as the temperature drops with the approaching storm.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A lights candles and gathers flashlights, preparing for the possibility of a power outage.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family board game to create an engaging group activity.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent D about her drawings, showing genuine interest and spending some time drawing together.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A reminds everyone to charge their electronics just in case the power goes out, showing foresight.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Teenage Agent A, with his younger sister, Agent B, and grandmother, Agent C, are spending the evening in their attic as a storm approaches. The atmosphere is tense but homey as they each engage in quiet activities.",
    "actions": [
      {
        "description": "Agent A gets up and checks all the windows in the attic to ensure they're securely closed.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Noticing Agent B's discomfort, Agent A sits down next to her and engages her in conversation about her book to distract her from the storm.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to play a board game with Agents B and C to create a soothing atmosphere.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A goes downstairs to grab extra blankets for everyone in the attic, making the space feel snug.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A checks the emergency kit in the attic to make sure it's fully stocked and within reach.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Observing Agent C handling photo albums, Agent A politely suggests storing the albums in sealable plastic bags for protection, and helps her with the task.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a storytelling session where each family member recounts a favorite memory.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "To ensure the home's security during the storm, Agent A decides to walk around the house and secure any loose items in the backyard.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B set up a small indoor tent using blankets and pillows, creating a cozy reading nook.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A ensures all doors and windows are locked as the storm builds outside. Meanwhile, Agents B and C are engrossed in a board game. The scenario conveys a sense of well-being and connection by the caregiver's actions.",
    "actions": [
      {
        "description": "Agent A checks the locked doors and windows once more as the storm intensifies.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a small flashlight in readiness for a power outage.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A joins the board game to create a warm atmosphere.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A prepares and serves hot cocoa for everyone.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A talks through what to do if the power goes out, offering calm instruction.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A builds a pillow fort with Agents B and C for play and security.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A has blankets ready for the children in case it gets colder.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A makes a quick supportive call to a neighbor about the storm.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A leads a storytelling session to nurture creativity.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, the head of the household, is in the living room with their spouse Agent B, providing attention to their teen Agent C who has received upsetting news. Agent A locks the doors for the night and makes sure their family is comfortable and attended to.",
    "actions": [
      {
        "description": "Agent A fetches a first aid kit to tend to Agent C's minor injury.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts a heartfelt conversation with Agent C about their feelings.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to call Agent C's friend's parents.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a warm beverage for everyone.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family board game.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A places their arm around Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A decides to install a new lock.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A texts a reminder to their neighbor about the neighborhood watch meeting.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a weekly family meeting on the calendar.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is in the living room of their family home during a thunderstorm, preparing a first-aid kit for Agent B's twisted ankle while Agent C looks on. The agents then settle down with warm drinks and a movie, focusing on comforting each other during the storm.",
    "actions": [
      {
        "description": "Agent A carefully wraps Agent B's ankle with a bandage from the first-aid kit.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make a hot beverage for Agent B and Agent C to enjoy while they watch the movie.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A checks the weather app on their phone to ensure that the storm does not pose any further risk.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to join in assembling a jigsaw puzzle to divert attention from the thunderstorm.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sends a message to the neighbors to make sure they are alright and offers assistance if needed.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks that all doors are locked and that the security system is activated.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A searches online for a calming playlist to play in the background for Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a movie all of them have been wanting to see, showing they remember their friends' interests.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sits close to Agents B and C on the couch, joining in the blanket-sharing.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In a cozy family room, Agent A, a teenage girl, is assembling a photo album filled with family memories. Agent B, her father, is adjusting a newly installed smoke detector, and Agent C, her mother, is organizing a first-aid kit.",
    "actions": [
      {
        "description": "Agent A carefully selects a cherished family photograph and gently places it into the album.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A leaves her task to assist Agent B in securing the smoke detector's battery.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the first-aid kit contents with Agent C and discusses necessary items.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A offers help to Agent B with any other tasks around the house.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites her parents to reminisce over photos together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves a loose photo near the fireplace and places it back into the album.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests revising the old emergency plan with her mother.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A checks the room for any personal belongings in hazardous locations.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A replaces Agent B's unsteady chair with a more stable ladder.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A enters the home to find the family engaged in their evening activities: Agent B cooking dinner, Agent C studying, and Agent D reminiscing with a photo album in the living room. The home is filled with the inviting smell of food and the soft sounds of music.",
    "actions": [
      {
        "description": "Agent A starts reviewing Agent C's homework to provide assistance.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A approaches Agent D, asks about the photo album, and begins a conversation about old memories.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A carefully turns off the stove when Agent B steps out of the kitchen to answer a phone call.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the basement to check if the recently installed smoke detectors are functioning correctly.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C at the dining table, offering to help study for an upcoming test.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A checks all the doors and windows in the home to make sure they are secure before bedtime.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent D stand up and assists them in walking to the dinner table.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game night after dinner to foster a sense of togetherness.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs nightlights along the hallway leading to the restroom for easier navigation during nighttime.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Evening in a cozy suburban home. Agent A returns from work and performs a habitual check of the living room. Agent B is preparing dinner with care, Agent C sets up a board game, and Agent D is watching a documentary.",
    "actions": [
      {
        "description": "Agent A adjusts the temperature on the thermostat for a comfortable evening atmosphere.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C set up the board game and checks for complete pieces and potential hazards.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages in conversation with Agent D about their documentary, expressing genuine interest.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A checks that doors and windows are securely locked before retiring for the night.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family meeting for vacation planning, valuing everyone's suggestions.",
        "values": [
          0.0,
          0.0,
          -0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A lights candles for ambiance, double-checking their stability.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a warm drink for Agent D, careful of the temperature.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family movie night and invites choices from all.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a freelance writer, works from their study room during a storm while Agent B organizes a family photo album in the living room, and Agent C is engrossed in a book report in their bedroom. The power goes out, compelling Agent A to ensure everyone's comfort and security.",
    "actions": [
      {
        "description": "Agent A leaves their study to check on Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves emergency candles and a lighter.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests gathering in the living room.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A reassures Agent C and helps with their book report.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A consolidates perishable food items into a cooler.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game to maintain calm.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A uses their phone to check for utility updates.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A offers their sweater to Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to sleep in the living room together.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A joins Agent B and C in a cozy living room, under dim, warm lighting. Agent A just finished arranging the family's emergency kit and now engages with Agent B and C, seeking a harmonious family bond.",
    "actions": [
      {
        "description": "Agent A touches Agent B's arm gently and asks about the book they are reading.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sits on the floor next to Agent C to look at their drawings, giving words of encouragement.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A checks the locks on the doors and windows for added assurance before sitting down with the family.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A decides to engage in a family board game.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A pulls a blanket over themselves and Agent B to create a shared comfortable space.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A brings out old photo albums to reminisce about past family events.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a warm and nutritious dinner for everyone to enjoy together.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A instigates a group hug with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A dims the lights and puts on soft music as the rain continues.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen cooking dinner, while Agent B is setting up a new smoke detector. Agent C is reading in the living room within view of the kitchen. The environment is homely with gentle background sounds.",
    "actions": [
      {
        "description": "Agent A tastes the food, ensuring it's not too hot before serving it to Agent C.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A checks the first aid kit to ensure it's fully stocked after dinner.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A kneels to discuss the book with Agent C at eye level.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A checks the batteries in the new smoke detector.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen to prevent tripping hazards.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A creates a comfortable area for the family to enjoy dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A saves leftovers in labeled containers.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A texts a family member to invite for a chat.",
        "values": [
          0.0,
          0.0,
          -0.4,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A starts a playful food fight with Agent C.",
        "values": [
          0.0,
          0.0,
          -0.5,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Amid a stormy night, Agent A has tucked in Agent B and remains at their bedside with a soft nightlight, while Agent C secures the house against the weather.",
    "actions": [
      {
        "description": "Agent A ensures the storm poses no danger by checking a weather app.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A tucks Agent B in with care and attention.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sings a lullaby to Agent B, calming them.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A reads a bedtime story with a calming voice.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A comforts Agent B during a loud thunder.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A provides Agent B with a nighttime drink.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A masks storm sounds with a noise machine.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent B a goodnight kiss.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A checks for hazards with a flashlight.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In a suburban home on a breezy evening, Agent A is cooking dinner while Agent B secures a bookshelf and Agent C studies on the couch. The family dog, Agent D, rests by the fireplace.",
    "actions": [
      {
        "description": "Agent A checks the smoke detector in the hallway to make sure it is functional.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A goes to Agent B, holds the ladder steady, and hands them the necessary tools.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sits down next to Agent C, offers help with studying, and listens as they explain what they're learning.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A draws up a family emergency plan and discusses it over dinner.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A installs locks on the medicine cabinet.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sweeps the area around Agent B's ladder to prevent slipping on any small items.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a favorite dish for Agent C to provide comfort during their study session.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent D a gentle pat, ensuring they feel included and comfortable.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A reassures Agent C about the upcoming exam, offering words of comfort and encouragement.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a recent graduate, has moved into an apartment with her siblings Agent B and Agent C. They are spending the evening decorating. Agent A hangs pictures securely in the living room, Agent B sets up a study nook, and Agent C organizes his toys.",
    "actions": [
      {
        "description": "Agent A double-checks that the smoke detectors in all rooms are working properly.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A assembles an emergency kit and shows Agent B and Agent C where it's stored.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A drafts a list of emergency contacts with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A installs a lock on the cabinet with cleaning supplies.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A gives a warm hug to Agent B who is stressed.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares a childhood story with Agent C, creating a bonding moment.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C with arranging toys, spending quality time together.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a celebration for the completion of their decoration efforts.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a parent, sits in the living room with their child, Agent B, who is working on a school project. A weather alert radio hums in the background, while the family cat, Agent C, rests on the window sill.",
    "actions": [
      {
        "description": "Agent A assists Agent B with the craft project, offering help and asking about the design.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the weather alert radio is functioning properly with fresh batteries.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A shares freshly baked bread with Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A conducts an emergency drill with Agent B.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A promptly cleans up a spill to prevent accidents.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B for a board game break.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A installs a corner protector on the coffee table.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A creates a cozy reading nook and reads with Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A finishes remote work and interacts with their family at home during a brewing thunderstorm. They ensure windows are shut, join Agent B in dinner prep, lay out an emergency kit, invite Agent C for a family meal, and engage in family bonding activities.",
    "actions": [
      {
        "description": "Agent A assists Agent B with dinner preparations.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A checks the battery backup for their home.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A calls Agent C to have dinner together.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A lights candles, creating a cozy atmosphere.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the emergency plan with the family.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to share their school day.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A plays a board game with the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the house's security system.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A tucks in Agent C with a bedtime story.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is in the living room, a well-organized space filled with comfortable furniture and family photos on the walls. It's late evening, and there's a soft steady rain tapping against the windows. Agent A is joined by Agent B, their spouse, who's sitting on the couch with a warm blanket, reading a book. Nearby, Agent C, their teenage child, is working on a complex jigsaw puzzle on the coffee table, occasionally glancing at the family dog, Agent D, resting by the fireplace.",
    "actions": [
      {
        "description": "Agent A checks the doors and windows to ensure they are properly locked before heading to bed.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sits next to Agent B, quietly reading over their shoulder and softly asking questions about the book.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C find missing puzzle pieces and enjoys the challenge together.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A gently pets Agent D, ensuring the dog feels calm during the storm.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a hot beverage for Agent B and themselves to enjoy while they spend time in the living room.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to share an important personal story with Agent C, strengthening their bond.",
        "values": [
          0.0,
          0.0,
          -0.3,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A dims the lights to create a soothing atmosphere in the living room as the night deepens.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the family photo albums on the shelf, taking a moment to reminisce over the memories with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game night, suggesting they all collaborate on the jigsaw puzzle.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is preparing dinner in the kitchen, Agent B studies on the kitchen island, and Agent C secures the house as a storm approaches. The home is filled with warm lights and cozy aromas.",
    "actions": [
      {
        "description": "Agent A instructs Agent B on how to prepare a family recipe with care.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A ensures Agent C has a flashlight and batteries for the storm.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside a portion of dinner for an elderly neighbor.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game night after dinner.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A encourages everyone to share stories at dinner.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A praises Agent B for their hard work in school.",
        "values": [
          0.0,
          0.0,
          -0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A allocates a quiet space for Agent B to study.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A checks all the doors to ensure they are secure.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is a teenager busy preparing a meal in the kitchen, carefully following a recipe. Agent B, a younger sibling, appears distraught, taking a seat at the kitchen island, prompting Agent A to engage with them.",
    "actions": [
      {
        "description": "Agent A turns off any appliances currently not in use.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A stores the kitchen knife in a secure drawer.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent B about their concerns.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A offers a freshly baked cookie to Agent B.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A listens attentively with eye contact to Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests moving to the couch for a comfortable talk.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A gives a comforting arm to Agent B while walking.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B plan a solution to their problem.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A commits to spending the evening with Agent B.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In a modest, well-maintained family home, Agent A is in the kitchen preparing dinner and observing Agent B play, with Agent C sitting at the kitchen table doing homework. The atmosphere is warm and cooperative.",
    "actions": [
      {
        "description": "Agent A installs smoke detectors in various rooms and explains their importance.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A reviews a family emergency plan anticipating a storm forecast.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a comforting blanket for Agent B on a cool evening.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "During dinner, Agent A fosters open dialogue by encouraging Agent C to discuss their day.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game night after dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A reads a bedtime story to Agent B for a peaceful night's sleep.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a nightlight in the hallway for Agent B’s nighttime comfort.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a young parent working from home, reviews a document, while their spouse, Agent B, prepares a meal and their child, Agent C, draws at the dining table. There’s a locked front door, a buzzing kitchen, and a stack of laundry on the couch, illustrating a peaceful evening routine.",
    "actions": [
      {
        "description": "Agent A checks the smoke alarm.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A discusses an emergency drill.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A moves the laundry stack.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A admires Agent C's drawing.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A builds a cushion fort with Agent C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A installs child-proof locks.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts a family conversation tradition.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates a display space for Agent C's artwork.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "The setting is an evening in a suburban home, where Agent A is seated next to Agent B with a puzzle to complete, and Agent C is preparing emergency kits. The room’s ambiance is inviting, signaling warmth and care.",
    "actions": [
      {
        "description": "Agent A invites Agent B to join in completing the puzzle.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A stands up to close the window.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C by reviewing the emergency checklist.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B about their favorite memory from the reunion.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make hot cocoa for both themselves and Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A brings a throw blanket for Agent B.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes making a family emergency plan together.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent B in conversation about their magazine.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests Agent B call their grandparents.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A, a middle-aged man, is in his suburban home on a quiet evening. Agent B, Agent A's spouse, is reading a novel on the sofa. Agent C, their child, is assembling a jigsaw puzzle. A storm is approaching and the home is cocooned from the elements, with family memories adorning the space.",
    "actions": [
      {
        "description": "Agent A checks all windows to prevent rain intrusion.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A places candles around the living area.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares old family memories from an album.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A informs the family of the weather updates.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A covers Agent B with a shawl.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with the puzzle.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the emergency kit is ready.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a board game with the family.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A prepares hot beverages for the family.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A arrives at her parents' home for a family dinner. Agent B is securing the backdoor lock, while Agent C looks through an old family photo album. Agent A checks the smoke detectors at Agent B's request and spends quality time engaging with her parents.",
    "actions": [
      {
        "description": "Agent A checks the batteries in the smoke detectors throughout the house.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A offers to install a new lock on the backdoor to replace the faulty one.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A sits with Agent C, looking through the photo album together.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests creating an evacuation plan, considering the recent kitchen incident.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B work together to test the stability of the handrails on the staircase.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A decides to digitize the family photo album to preserve the memories.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about everyone's well-being, expressing concern and interest.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites her parents to join for a group hug.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the living room furniture to minimize clutter and ensure clearer pathways.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          -0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is carefully sorting out medicines into a locked cabinet and placing them high above reach. Agent B is drawing up plans for a new family room while Agent C does homework at the dining table.",
    "actions": [
      {
        "description": "Agent A prepares a warm, home-cooked meal for the family to enjoy together.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a gentle conversation with Agent C about their day.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A installs better lighting along walkways outside.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family game night.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the smoke detectors in the house.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sits down with Agent B to discuss family room plans.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A creates an emergency contact list.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family meeting to discuss plans.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C how to cook a simple dish.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is assembling a bookshelf for organizing family items in the living room. Agent B considers bedroom rearrangements while Agent C prepares important family documentation. The atmosphere is one of collective focus and care.",
    "actions": [
      {
        "description": "Agent A carefully selects meaningful items for the new bookshelf.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent B with room planning.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the household emergency plan with Agent C.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A secures light fixtures in the living room.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A dedicates shelf space for Agent B's trophies.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A chooses family photos for the bookshelf.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family meeting for emergency preparedness.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A applies corner guards on furniture.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is preparing dinner in the kitchen with care to avoid hazards. Agent B is setting the table nearby, and Agents C and D are playing a board game in the living room. The atmosphere is pleasant and everyone is engaged in their tasks with a sense of togetherness and attention to detail.",
    "actions": [
      {
        "description": "Agent A keeps a first-aid kit in the kitchen.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares memories with Agent B.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agents C and D in their board game.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A reminds Agents C and D to keep their play area tidy.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A turns off the oven and stovetop after use.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B set the table, keeping sharp objects away from children.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agents C and D in dessert preparation.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A tends to Agent C's scratch and teaches careful play.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is organizing a first aid kit in the well-maintained living space they share with Agent B, who begins reminiscing over a family photo album with them, suggesting care for their current wellbeing and cherished memories.",
    "actions": [
      {
        "description": "Agent A offers to review and update Agent B's personal emergency contact list.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to go through a fire drill procedure tailored to their apartment.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A decides to replace the batteries in all the smoke detectors around the apartment.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A recounts family stories behind each photo in the album with Agent B.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests creating a space in the living room for family photographs.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A plans to learn a basic life support course with Agent B.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent B about any concerns they may have.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B create an emergency kit for their car.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to share aspirations for the future.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen preparing a family meal, accommodating the dietary needs of the family, while Agent B is at the kitchen table on a laptop. Agent C enters to discuss a personal school issue.",
    "actions": [
      {
        "description": "Agent A ensures all the handles of pots and pans are turned inward.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A turns off the stove when leaving the kitchen temporarily.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to set the table.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A talks to Agent C about the school issue.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help with cooking.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent C full attention during the conversation.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a knife out of Agent C's reach.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal story with Agent C.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A reminds Agent B to join the family moment.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "intimacy"
    ],
    "scenario": "In a suburban home on a stormy evening, Agent A is seated with Agent B. They acknowledge the storm's presence but continue to exude a calm demeanor, ensuring the environment remains tranquil. The room is warmly lit and has elements that contribute to a cozy atmosphere. Agent C is engaged in a book with headphones on, indicating a preference for personal space yet remaining in the shared family environment. All are implicitly aware of their connecting threads as they navigate the evening's minor disruptions with a sense of closeness and concern for each other's comfort.",
    "actions": [
      {
        "description": "Agent A retrieves a flashlight from a kitchen drawer, in case the power fails.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A gently taps Agent C’s knee, prompting them to remove their headphones and engage in light conversation.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A looks at the family photo album on the coffee table and suggests going through it together.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A checks the battery backup unit for the home's internet to make sure it’s functioning.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make hot cocoa for everyone, heading into the kitchen.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A pulls the blinds down to prevent any flying debris from the storm from shattering the window and causing harm.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A reassures Agent B with a supportive embrace.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with a difficult word in their book.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A texts a neighbor to check if they are alright in the storm and offer assistance if needed.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  }
]