[
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A discovers a package for Agent C mistakenly delivered to a neighbor. The apartment is cozy with the smell of food as Agent B cooks, while Agent C reads in their room.",
    "actions": [
      {
        "description": "Agent A informs Agent C about the package.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A waits to mention the package during the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A checks the package contents for reassurance.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A withholds information about the broken seal.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          -0.4
        ]
      },
      {
        "description": "Agent A shares the meal with positive conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests buying a security camera.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a shared chores and meals schedule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A organizes an evening of board games.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A repairs the package seal before giving it to Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "The setting is a suburban home on a Saturday afternoon. Agent A, a teenager and avid soccer player, is working on a school project in the living room. Agent B, Agent A's younger sibling, is struggling with a jigsaw puzzle in the same room. Agent C, their parent, is cooking in the kitchen, with enticing smells and sounds of familial life filling the home.",
    "actions": [
      {
        "description": "Agent A offers help with a challenging puzzle piece.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a snack break with the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A creates a shared work and play schedule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A prioritizes Agent B's puzzle over their project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes mutual help on respective tasks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A shares their workspace with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A continues work but is open to assisting Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A rushes their project to spend time with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          -0.4
        ]
      },
      {
        "description": "Agent A teaches a concept from their project to the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In their home's spacious living room, Agent A is setting the stage for an engaging family game night. Agent B is comfortably seated, discussing the value of togetherness, while Agent C enthusiastically examines the selection of games. Agent A's focus is on ensuring an enjoyable evening for all.",
    "actions": [
      {
        "description": "Agent A allows Agent C to choose the first game, fostering a sense of inclusion and respect.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A initiates a rotation for game selection, providing equal opportunity for all to participate.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A inquires about Agent B's preferences, aiming to cater to everyone's enjoyment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A reads game rules clearly to ensure understanding and avoid conflict.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A prepares considerate snack choices for the group.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests breaks to accommodate everyone's energy levels.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A suggests to Agent B and Agent C to play a beloved board game together after they finish their respective tasks, demonstrating an emphasis on group cohesion and equitable engagement.",
    "actions": [
      {
        "description": "Agent A proposes a schedule for task completion and game time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A helps Agent B with chores to expedite their schoolwork.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A invites Agent C to choose the next activity, ensuring inclusion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A rearranges the living room for a comfortable game night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A creates a reward structure for participating in the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A cooks a meal to enjoy during the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A integrates a moment for sharing personal stories during the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A makes sure everyone has equal strategic opportunities in the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a high school student, prepares a special family dinner, considering the need for quiet for Agent B's study and the contributions of Agents C and D. The setting is warm, inclusive, and mindful of shared living spaces.",
    "actions": [
      {
        "description": "Agent A invites Agent B to join the dinner preparations and offers assistance with schoolwork later.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A asks Agent C for advice on a recipe.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A assigns simpler tasks to Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A selects a recipe that is Agent C's favorite.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A prepares tools and ingredients beforehand.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A reduces their own portion to ensure everyone gets enough.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A explains the origin of the recipes to Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A creates a playlist of everyone's favorite music.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A sets aside a portion of the meal for the elderly neighbor.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a recent college graduate, shares an apartment with two roommates, embarking on the task of collectively decorating their living space.",
    "actions": [
      {
        "description": "Agent A suggests holding a group discussion to decide together where to place each piece of art.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers to hang Agent B's favorite piece in a prominent place, recognizing its sentimental value to them.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A proposes creating a rotating schedule so each roommate can have a turn to feature their art in the most visible spot.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A initiates a plan to merge their pieces of art aesthetically to represent all three roommates’ tastes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to place Agent C’s photos in a space that felt empty and needed a personal touch.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A takes notes of each roommate’s art preferences for future reference and decoration plans.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A volunteers to take down the piece selection for a local charity event hosted at their apartment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A makes the effort to include artwork from local artists, to support the community.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A encourages Agent C to share stories behind their photos, to increase understanding and inclusion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is in the living room sorting through a box of old family photographs with Agents B and C present in the shared living space.",
    "actions": [
      {
        "description": "Agent A decides to share a humorous childhood photograph with Agent B, encouraging shared laughter.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A finds a rare family photo and suggests it be framed and displayed for all to see.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A orders missing puzzle pieces online to help Agent C with the puzzle they are working on.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A invites Agent B to assist in organizing and preserving family photographs.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a family game night to focus on creating new memories together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A compliments and thanks Agent C for their effort in making the home feel warm and inviting.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A involves Agent B in deciding which photos to include in the family album.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers duplicate photos to Agent B to start their own collection.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A helps Agent C with the puzzle without taking over the process.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In the kitchen, Agent A prepares a meal, Agent B works at the table, and Agent C sets the dining table. Agent A ensures there's enough food for everyone and is considerate of Agent B's hard work.",
    "actions": [
      {
        "description": "Agent A decides to cook an additional side dish to ensure everyone can have a filling dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to help Agent B with her work after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A puts on some background music for a relaxed dinner atmosphere.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent B to join in setting the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A encourages Agent C to pick the movie for movie night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests playing a board game after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A volunteers to do the dishes to give Agent B rest.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A asks Agent B about dietary preferences for the next meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A organizes a small gathering to unwind.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a high school coach, arrives home late in the evening. Agent B, A's spouse, is watching TV and has prepared dinner that remains unserved. Agent C, their teenage child, is busy with a school project. It's Agent A's day off tomorrow, a time for family activities or chores.",
    "actions": [
      {
        "description": "Agent A apologizes for being late and shows appreciation for the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A offers to warm up the dinner for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A shows interest in Agent C's school project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a family game night for the next day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A volunteers to clean the kitchen post-dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A plans a family day at the park.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A introduces a rule to keep work talk away from dinner time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A convinces Agent C to join the family meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A offers to assist Agent B with a task the following day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a cozy family home, 'Agent A' sits at the dinner table with 'Agent B', his cousin, and 'Agent C', their mutual friend. 'Agent A' has finished cooking dinner, the table laid with three equal portions of pasta. A scoreboard documents their cooking competitions, tonight's dinner enjoyed without competition. 'Agent B' discusses her school election campaign, while 'Agent C' readies a card game for after the meal.",
    "actions": [
      {
        "description": "'Agent A' offers 'Agent B' the pasta recipe and cooking tips.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "'Agent A' proposes a rotation of cooking duties for next time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "'Agent A' listens and provides feedback on 'Agent B's campaign ideas.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "'Agent A' lets 'Agent C' pick the game for after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "'Agent A' insists on dividing the leftover pasta equally.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "'Agent A' offers to help make campaign posters for 'Agent B'.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "'Agent A' cleans up and encourages shared responsibility for next time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is seated at the dining table concentrating on their report. Agent B, their roommate, has just finished baking cupcakes and announces that they are a gesture of appreciation. Agent C, another roommate, pauses their online lecture to join in the dining area. The smell of freshly baked cupcakes fills the home.",
    "actions": [
      {
        "description": "Agent A decides to take a short break to join Agent B and Agent C, enjoying a cupcake together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers to help clean up after enjoying the cupcakes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests setting aside a cupcake for their neighbor.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A resumes their report, feeling refreshed after the break and the sweet treat.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A proposes to organize a baking day on the weekend.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A sends a message to a friend sharing the cupcake recipe.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A creates a rota for weekly treats.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A considers Agent C's lecture schedule and quietly leaves the dining area.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A encourages Agent C to join in and take a longer break.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is preparing dinner in the kitchen with Agent C assisting by setting up the dinner table while Agent B reads a book. The environment is inviting, with attention to dietary preferences for the upcoming meal.",
    "actions": [
      {
        "description": "Agent A initiates a game for diners to share favorite meal memories.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A seeks everyone's preference on where to sit at the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A compliments Agent C's effort in arranging napkins.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A tastes the dishes to ensure they are delicious.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to taste and provide feedback on the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A chooses the less desirable seat for himself.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A sets aside a meal portion for Agent D who will arrive late.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A volunteers to handle cleanup post-dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A recommends a new game none of them has played.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "The kitchen is abuzz with activity; Agent A is planning a surprise dinner for their parent’s anniversary. The table is set superbly, with wide grins from Agent B and Agent C, who are A's siblings and eagerly assisting with preparations. The atmosphere is warm with shared glances of excitement among them. A sense of collective effort permeates the room, as everyone contributes what they can to the elaborate feast. Agent C, who has dietary restrictions, was consulted in the creation of the menu, ensuring that all involved could partake in the meal. Amidst the vibrant colors of the vegetables and the sizzle of the pans, Agent A reflects on the shared responsibilities and contributions, ensuring no one feels overburdened.",
    "actions": [
      {
        "description": "Agent A slices extra pieces of cake and wraps them as a gift for their neighbor who lives alone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A decides to let Agent B decide which music to play during dinner, knowing B has a great taste in music that usually appeals to everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A extracts a game from a cupboard after dinner for everyone to play and bond over, selecting one that all family members find entertaining.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A makes sure to clean up the dishes after dinner, understanding that B and C helped significantly with meal preparation and shouldn't have to do everything.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A anonymously leaves a thank you note for Agent C, who crafted the handmade decorations, acknowledging their creative efforts.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A deliberately initiates a conversation about a topic of shared interest, steering it towards something they know Agent C is passionate about.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "When one portion of the meal doesn't turn out as expected, Agent A comforts B, reassuring them that the effort and intent matter more than perfection.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A invites all family members to share stories about past anniversaries, creating a space for shared memory and laughter.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Ensuring that everyone has had enough to eat, Agent A packs the leftovers for them to have for lunch the next day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Through thoughtful planning and inclusive activities, Agent A demonstrates considerations for the needs and contributions of Agents B and C in a shared meal preparation, ensuring a positive and respectful environment.",
    "actions": [
      {
        "description": "Agent A carefully explains the cooking steps to everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A makes a separate vegetarian version for Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decorates the dining area for an uplifting atmosphere.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A encourages Agent C's cultural stories at dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A starts a game of sharing treasured family recipes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A does the dishes to show appreciation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A seeks feedback on the dinner from everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A packs leftovers for Agent B's lunch.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A involves everyone in planning the next meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is a teenager who has just finished a large school project and is looking forward to a relaxing weekend at home. Agent B, his cousin visiting for the weekend, is disappointed due to the canceled trip to an amusement park because of bad weather. Agent C, their friend, suggests playing indoor party games to cheer everyone up.",
    "actions": [
      {
        "description": "Agent A offers to play Agent B's favorite board game first to lift his spirits.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a rotation system for choosing games, ensuring everyone's preferences are considered.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A decides to put on some upbeat music to create a cheerful atmosphere.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A compliments Agent C's idea and thanks him for bringing positivity to the situation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A apologizes to Agent B for the change in plans and proposes an alternative day out.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A invites Agent B to cook their favorite snacks together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A brings out extra blankets and pillows for comfort during their game day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A mediates a disagreement during a game to reach a consensus.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A encourages each player to teach others a new game, fostering inclusivity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "On a sunny Saturday afternoon, Agent A is gently strumming a guitar while Agent B works on a jigsaw puzzle. The house environment combines elements of relaxation and shared activities, including a drooping potted plant and a calendar with a marked family event.",
    "actions": [
      {
        "description": "Agent A compliments Agent B on the puzzle progress.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers to help Agent B with the puzzle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A waters the drooping plant.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A reviews the family event plan for equitable task sharing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A initiates a room clean-up for shared enjoyment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A gives a hint to Agent B for the puzzle without solving it.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agent B for a break outside.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A shares a funny anecdote with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A asks if Agent B needs sorted pieces for the puzzle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A and Agent B, siblings, are preparing a small anniversary party for their parents at home, with help from their cousin, Agent C. Agent A supervises decorations and ambiance, Agent C sets up music, and Agent B finishes cooking the dinner.",
    "actions": [
      {
        "description": "Agent A creates a handmade gift using family photos and personal mementos.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A ensures each family member can give a toast to their parents.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A rearranges seating for accessibility for their grandparent.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A composes a heartfelt speech about family strength and unity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A welcomes and thanks each guest for attending.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A cleans up after the party to alleviate others' tiredness.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to drive home guests without transportation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A donates leftover food to a local shelter.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A resolves a disagreement between Agent B and Agent C amicably.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a high school senior passionate about community events, works on baking cookies in the kitchen with Agents B and C contributing to an upcoming bake sale in their own ways.",
    "actions": [
      {
        "description": "Agent A decides to evenly divide the cookies so that each member of the school club can sell the same amount during the bake sale.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests using Agent C's jam as a special filling for some of the cookies to create a unique offering.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A sets aside a small box of cookies to give to Agent C as a thank you for the homemade jam.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agent C to join them at the bake sale and suggests they could work the booth together for a while.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A takes some time to teach Agent C how to decorate cookies with icing in intricate patterns.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to help Agent B with the decorative patterns after they finish baking, to share the workload.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes creating a sign that credits those who contributed to the bake sale, ensuring recognition for all involved.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A accidentally burns a batch of cookies and decides to be honest about the mistake rather than trying to cover it up.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A chooses to use eco-friendly packaging for the cookies to minimize environmental impact.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A returns home to find Agent B has cooked a large pot of stew and left a note inviting anyone to help themselves. Agent C is wrapping up his work. Agent A, considering how Agent B often cooks and shares without expecting anything in return, ponders her next steps.",
    "actions": [
      {
        "description": "Agent A serves some stew and sits with Agent C at the dining table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A leaves a thank you note for Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A cleans up after dining.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to help Agent C with his project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A compliments Agent B on the stew and proposes a meal planning group.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a shared grocery fund.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A volunteers to cook the next meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes a weekly shared dinner arrangement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A sets up an online cooking schedule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a cozy suburban home, Agent A, a parent, observes her children Agent B, Agent C, and Agent D setting the table for dinner and playfully arguing over the last piece of pie, with Agent C feeling left out.",
    "actions": [
      {
        "description": "Agent A decides to divide the last piece of pie equally among the children.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A encourages Agent C to join the discussion and express his feelings on the dessert sharing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes creating a dessert schedule to prevent future conflicts.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A suggests replacing the dessert with a healthier option that everyone enjoys as a long-term solution.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to play a game where the winner gets to choose what dessert they will have tomorrow.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A starts a conversation about how each child went out of their way to help others that day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a family vote on what to do with the last piece of pie.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A provides an extra chore or task for each child, with the completion fast-tracking them for the first pick of tomorrow’s dessert.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A uses this moment to teach the children about portion control and moderation in eating.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.1,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a high school student, is in the living room working on a group project with a laptop. Agent B, their younger sibling, is practicing handwriting at the dining table. Agent C is preparing a meal in the kitchen. The home is filled with a sense of productivity and sunlight.",
    "actions": [
      {
        "description": "Agent A organizes a joint study session with classmates online to ensure everyone contributes equally to the project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A takes a break from studying to help Agent B with their handwriting practice.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to share their old study notes with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A plants a small indoor garden for the family to enjoy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests a family game night to spend quality time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A tutors Agent B in math to help them with a test.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a household living room, Agent A and Agent B set up a two-player board game, and Agent C, a visitor, expresses a desire to join. A homemade pie sits in the kitchen, signaling a communal sharing atmosphere.",
    "actions": [
      {
        "description": "Agent A offers to modify the rules to include Agent C in the board game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A invites all to share the pie, ensuring each person gets an equal portion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A proposes a team-based variant of the board game, involving Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests flipping a coin to decide on teams, making the selection process random.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A chooses to sit out the next game so Agent B and Agent C can play.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A brings up playing a different game suitable for three players.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A encourages a friendly atmosphere through positive conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A, after the game, suggests they watch a movie that interests all three.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a teenager with a love for cooking, is preparing a family meal with Agent B's assistance, while Agent C sets the table, ensuring inclusive participation, and Agent D joins the gathering.",
    "actions": [
      {
        "description": "Agent A tastes the soup and decides to adjust the seasoning, considering everyone’s preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A offers to teach Agent C a new recipe they recently learned.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A makes a small playful competition with Agent B on who can chop vegetables faster, ensuring it’s all in good sport.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A invites Agent D to share a story from their day to include them in the lively atmosphere.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A allocates portions of the dessert they’ve made to make sure everyone gets an equal share.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A encourages Agent D to try a little bit of each dish so they can all discuss their favorite parts of the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A decides to clean up after dinner as a gesture of appreciation for everyone's help.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A asks for feedback on the meal, showing an openness to learn from the experience.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A congratulates Agent C for setting a beautiful table, recognizing their contribution.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a bright, cozy kitchen on a late Saturday morning, 'Agent A' is preparing a surprise brunch for their teenage children. The eldest child, 'Agent B', is reading a book in the living room, and the youngest, 'Agent C', is completing a puzzle on the dining table, both unaware of the upcoming surprise.",
    "actions": [
      {
        "description": "Finishes the brunch quietly to maintain the element of surprise.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Delegates the task of setting the table to both children.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.8
        ]
      },
      {
        "description": "Asks to choose their favorite songs during brunch.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.1
        ]
      },
      {
        "description": "Suggests a family game that all can enjoy and participate in.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Involves in cleaning up after brunch as a team.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.1,
          0.0,
          0.7
        ]
      },
      {
        "description": "Opens up a conversation about the week.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Proposes a planning session for activities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Compliments on contributions and ideas.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "At a dinner hosted by Agent A in a cozy suburban home for neighborhood families, Agent A has prepared various dishes and encourages sharing and appreciation among the guests, including Agent B and Agent C, through mindful arrangements and interactive activities.",
    "actions": [
      {
        "description": "Agent A serves everyone equally at the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers Agent B to share the cultural background of their dish.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A sets up a tasting game for the children.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A proactively refills Agent C’s glass.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A invites guests to share their favorite moments.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A distributes leftovers to take home.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A cleans up post-dinner alone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A organizes a vote for post-dinner games.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A talks with Agent C when they are alone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a cozy kitchen, Agent A is serving breakfast while Agent B reads the newspaper, and Agent C and Agent D debate over pancake toppings. The family is gathered around the table that's fully set with a variety of toppings for everyone to enjoy.",
    "actions": [
      {
        "description": "Agent A invites feedback on the breakfast and ensures everyone has their preferred toppings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A arranges a pancake decoration contest for family engagement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A encourages the children to take turns choosing toppings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A leads a family discussion on the next weekend activity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A volunteers for dish duty post-breakfast.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests playing a favorite board game after breakfast.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes teaching each other their pancake designs.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A listens attentively to Agent B's opinions on a news article.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A mediates a tie-breaker for the pancake topping debate.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is organizing a small gathering at their home to celebrate the end of the semester and has decorated the living space. Agent B joins in after studying for an exam, and Agent C contributes a homemade cake. The environment is set up for enjoyment with board games and a playlist of music.",
    "actions": [
      {
        "description": "Agent A invites Agent B to help choose the next game to play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to finish setting up the room so Agent C can take a break.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A decorates a less embellished corner of the room.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A prepares a fresh batch of lemonade for non-drinkers.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A compliments Agent C on the cake and centers it on the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A encourages guests to capture moments with disposable cameras.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A asks for music suggestions to match everyone's taste.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A distributes leftover party favors to the guests.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A facilitates an icebreaker activity to include Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is cleaning up after a family game night. Agent B is going through photo albums, while Agent C is looking at movies to watch. They've all contributed to an enjoyable and inclusive evening.",
    "actions": [
      {
        "description": "Agent A suggests a democratic vote on which movie to watch.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers to help Agent C choose a movie.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A expresses interest in looking at photo albums with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A keeps the board games out anticipating more fun.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A cleans up quickly to spend more time together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A distributes snacks evenly among the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A organizes the games properly for everyone's future use.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a break for everyone's comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is preparing dinner and has initiated a tradition of family discussion during mealtime. The environment is inviting and includes a family reading plan.",
    "actions": [
      {
        "description": "Agent A encourages Agent B to discuss their school week, providing attention and recognition.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A commends Agent C for their efforts on a homework assignment, promoting a feeling of achievement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A asks both children for new book recommendations, respecting each child's interests.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A carefully allocates equal portions of the meal to each child, showing consideration and equality.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A shares personal weekly highlights, engaging the family in a mutual exchange.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A encourages an honest conversation about any peer-related issues, providing support and understanding.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests drawing family outing ideas from a hat, ensuring a random and unbiased choice.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A listens attentively to each child's recount of their week, demonstrating empathy and acceptance.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A allows both children to partake in dinner prep, cultivating teamwork and involvement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A has just finished setting up a board game in the living room for family game night. Agent B is preparing snacks, and Agent C and D are bickering over game pieces.",
    "actions": [
      {
        "description": "Agent A suggests drawing lots to decide on game pieces.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A takes the least preferred game piece.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A offers to review the game rules with everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A praises everyone's good moves during the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A makes a deliberate suboptimal move to give Agent C a chance.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.1,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A introduces a rule for second chances on clear mistakes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A applies game rules consistently, including to themselves.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A compliments Agent D’s strategy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A plays their favorite music to improve the ambiance.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A has finished a school project and is relaxing at home. Agent B is engaged in a video game, while Agent C, their cousin, is visiting and feels a bit out of place. Agent D, the parent, has made a special dinner to celebrate.",
    "actions": [
      {
        "description": "Agent A invites Agent C to play a board game after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to share his game turn with Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A sets the dining table, ensuring everyone has a place.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a family movie night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A helps clean up dishes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A asks for game preferences from Agent B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A configures the console for multiplayer gaming.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A shares his dessert with Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A discusses celebration plans that everyone enjoys.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is in the kitchen meticulously cutting fruits for a family movie night while Agent B offers help and Agent C works. The environment is ripe for decision-making regarding movie selection and snack distribution.",
    "actions": [
      {
        "description": "Agent A divides the fruit salad into equal portions for family members.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A ensures everyone contributes to the movie selection.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A rearranges seating for everyone’s comfort and view.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A distributes extra blankets and pillows for added comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers help to Agent C to enable her participation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A prepares drinks as per everyone's preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A passes on choosing the first movie to Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A suggests drawing lots for an unbiased movie choice.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A initiates a post-movie discussion for shared opinions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a high school senior, is in the living room of their family home with Agents B and C, who are A's younger siblings. They've just prepared dinner for the three of them, and an extra portion that was meant for their cousin, Agent D, remains as D canceled last minute. They share a joyful atmosphere filled with conversation and laughter.",
    "actions": [
      {
        "description": "Agent A suggests inviting over a lonely neighbor to join them for dinner, sharing the extra portion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A initiates a game where everyone shares a positive experience they had that day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A equally divides the extra portion of the meal among all siblings, including themselves.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes to save the extra portion for Agent D to enjoy the next day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A engages everyone in planning a rotating schedule for cooking duties, promoting contribution from all siblings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A lets Agent B and C choose their favorite movie to watch after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A leads a conversation about school life to understand and learn more about Agent B and C's school experiences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A initiates a cleanup competition to see who can tidy up the fastest after the meal, with a small prize for the winner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A encourages each sibling to express one thing they're thankful for about each other.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a high school literature teacher, is grading essays at the dining table in his home. His spouse, Agent B, works on a community garden layout, and their child, Agent C, reads a novel on the living room couch. The scene exudes a sense of quiet focus and familial warmth.",
    "actions": [
      {
        "description": "Agent A decides to share a particularly impressive student essay with Agent B, praising the student's creativity and insight.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A gets up from the table to stretch, walking over to Agent C and asks about the novel they're reading.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A tends to the family dog by giving it a treat and fresh water.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a small break where everyone can share what they've been working on.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "As dinner time approaches, Agent A volunteers to cook dinner to allow Agent B to finish her work.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes that they all take a short walk outside before game night starts, to clear their minds and engage with the neighborhood.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A organizes the board games by age and complexity, taking into account everyone's preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A brings the family’s favorite snacks to the table in preparation for game night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent C to choose the first game of the night, recognizing that they are often shy about expressing their preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "At home in the living area, Agent A is deciding on board games to play. Agent B has just walked in, Agent C is quietly reading, and Agent D has finished hosting a study group. The evening is set for a friendly gathering with games, tea, and cookies.",
    "actions": [
      {
        "description": "Agent A offers to let Agent B choose the first game to play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests that everyone take turns choosing subsequent games.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join the games, ensuring they feel included.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes a brief overview of the rules before starting to ensure everyone understands and agrees.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A makes a conscious effort to engage Agents B, C, and D in light-hearted conversation to maintain a cheerful atmosphere.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A observes everyone's demeanor and suggests taking a break if anyone seems frustrated or disengaged.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A shares the cookies evenly among everyone, making sure Agent D, who arrived last, gets an equal share.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A compliments Agent B on their gameplay, regardless of whether they are winning or losing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A and his roommates, Agent B and Agent C, engage in organizing their shared living space, focusing on creating a respectful and efficiently managed environment.",
    "actions": [
      {
        "description": "Agent A proposes a roommate meeting to discuss and allocate storage spaces equally.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A buys additional storage bins.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A organizes their own possessions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A labels personal storage areas.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A helps Agent B with art supplies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests a shared cleaning schedule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A moves furniture to create more space.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A introduces a food marking system.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A organizes a communal dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A prepares to bake cookies in the household kitchen with Agents B and C present. The warm kitchen is filled with baking aromas and the anticipation of sharing the cookies.",
    "actions": [
      {
        "description": "Agent A decides to involve Agent B in the cookie-making process to share the experience.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests that they use a timer to ensure everyone gets exactly the same baking time for their cookies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A volunteers to make another batch of cookies to make sure there are enough for all family members.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A consults with Agent C on how to divide the cookies equitably among everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes a family cookie decoration contest.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A chooses to save some cookies for a neighbor.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to clean up the kitchen after the baking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers to document the cookie-making process with photos.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A plans a rotation schedule for future baking sessions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is a teenager who has taken up baking. Today, he has made a large batch of cookies as Agent B, his mother, works from home, and Agent C, a friend, has come over to study. The warm scent of cookies fills the house.",
    "actions": [
      {
        "description": "Agent A plates an equal number of cookies to share with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A creates a small care package of cookies for his neighbor.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A invites Agent C to take a break and offers cookies as a snack.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A saves cookies aside for his sibling who is coming home late.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A sits with Agent B and enjoys cookies while discussing her work.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A resists eating all the cookies, waiting until everyone has shared.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A initiates a game for everyone to play after enjoying cookies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A cleans up the kitchen after baking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a weekly baking day with rotation on baking choices.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is preparing a weekend celebration for her child's recent top score in a national competition. While Agent B is baking a cake and Agents C and D work on their homework, Agent A realizes she forgot to buy a special gift her child wanted. The house is filled with warmth and festive decorations.",
    "actions": [
      {
        "description": "Agent A decides to craft a personal gift at home, using materials available.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A sits down with Agents C and D to discuss everyone contributing to a shared family gift instead of buying individual presents.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A involves Agents C and D in the cake decorating process to include them in the celebration preparations.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A chooses to allocate an equal amount of time for both children, celebrating Agent D's small achievements on the same day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A and Agent B agree to cook the child's favorite dish together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A proposes a family game night to enjoy together after the celebration.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A reaches out to her child’s friends' parents to organize a surprise video call during the party.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A creates a homemade certificate of recognition for her child’s accomplishment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A postpones the celebration to the following week to ensure all necessary arrangements, including the desired gift, can be made without haste.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is at home with roommates Agent B and Agent C. They are deciding which board game to play on their game night. Agent A holds a strategy game, while Agent B and Agent C each have different games.",
    "actions": [
      {
        "description": "Agent A offers to explain the strategy game's rules, ensuring it's enjoyable for all.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests voting on the game choice to give everyone an equal say.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes drawing lots to decide the game for random selection.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.1,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A chooses to play Agent B's trivia game, planning to play the strategy game next time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A decides to try Agent C's drawing game, encouraging trying new things.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A compromises to play a round of each game, starting with the shortest.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers to rotate game selection each game night, starting tonight.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A creates a new game from elements of all three suggestions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A leads a discussion on each game's merits to find agreement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, known for his community work, is preparing a family dinner with his partner and their two children. As they gather to prepare the meal, the environment is set for a collaborative and enjoyable evening.",
    "actions": [
      {
        "description": "Agent A suggests they take turns in each task of the lasagna preparation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A lets Agent C pick the background music for cooking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to wash the dishes after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agent D to teach guitar basics after they eat.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A compliments each person’s contribution to dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a family game night with everyone picking a game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A ensures meal respects each person's dietary preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A listens to how each family member's day was during mealtime.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A and their spouse Agent B are relaxing on the couch, their child Agent C is drawing on the rug. They had all had a pleasant evening with dinner and a family movie. Agent C shares a heartwarming drawing with the family.",
    "actions": [
      {
        "description": "Agent A proposes a weekly tradition of board game night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent C to choose the next movie.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A discusses alternating cooking duties with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A organizes family photos, including Agent C's artwork.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A teaches Agent C how to cook.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A plans a family weekend outing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A commits to providing equal emotional support to Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers homework help to Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A arranges a family get-together with relatives.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a parent of two children, sits in the living room on a lazy Sunday afternoon. Agent B, A's older child, sprawls on the carpet absorbed in a handmade art project spread across the coffee table. Agent C, the younger sibling, watches with a mix of interest and frustration, eager to participate but unsure how to assert themselves into the activity. Agent A observes the dynamic play out, noting the subtle shift in mood, as Agent B guards the art supplies possessively, while Agent C's desire to join grows. Agent A ponders over maintaining a pleasurable weekend atmosphere while ensuring both children are content and feel included.",
    "actions": [
      {
        "description": "Agent A decides to provide additional art supplies to Agent C so they can start their own project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A sits with Agent C to brainstorm an original art project they can work on together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A gently reminds Agent B about the importance of sharing and suggests working on a collaborative piece with their sibling.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A sets up a \"gallery space\" on the wall where both children’s artwork can be displayed side-by-side.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A organizes a family art day, encouraging each family member to create their own masterpiece.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent B to teach Agent C some art techniques, fostering a bond through teaching and learning.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A enforces a new rule where any project over a certain size needs to be inclusive for anyone who wishes to contribute.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes that they all clean up at the end of the day together, ensuring an equal contribution from both children.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is preparing dinner, with Agent B working at the kitchen island and Agent C entering to refill a water bottle. The environment suggests a culture of sharing and organized home management.",
    "actions": [
      {
        "description": "Agent A teaches Agent B how to make a special dish, involving them in cooking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A allocates equal meal portions for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a schedule for family cooking nights.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A leaves the last dessert piece for Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A cleans up after dinner on a non-scheduled day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A sets aside a meal portion for a late-arriving family member.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A introduces a fun cooking challenge.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers to complete Agent B's chores.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A invites Agent C to join meal planning.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a high school teacher, notices the living room is disorganized and discusses with roommates Agent B, a nurse, and Agent C, a law student, their contribution to a neighborhood potluck, considering Agent B's tiredness and Agent C's busy study schedule.",
    "actions": [
      {
        "description": "Agent A offers to clean up the living room to make the space more comfortable for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a conversation with her roommates about what dish to bring to the potluck, wanting to ensure everyone has a say.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes to prepare the potluck dish herself, considering Agent B's fatigue.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests that Agent C can contribute by helping with either the cooking or the shopping, based on what best fits her schedule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A takes the initiative to draft a rotating cleaning schedule for the house to equally distribute chores.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A decides to sit down with Agent C and offer help with her legal studies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A recommends moving the study session to the dining area to provide a better study environment for Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A brings a glass of lemonade to Agent C, acknowledging her hard work.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A gently reminds Agent B to get some rest before discussing the potluck details.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A and Agent B are at home enjoying a leisurely afternoon, playing the guitar and working on a jigsaw puzzle, respectively. Agent C, a friend, joins them with a pack of cards for a game.",
    "actions": [
      {
        "description": "Agent A invites Agent C to join in completing the puzzle and suggests voting on the best place to hang it afterward.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to make refreshing beverages for everyone to enjoy while they play cards.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A proposes to play a card game that all are familiar with to ensure an inclusive environment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to teach Agent B a new song on the guitar, something they both have shown interest in learning previously.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A chooses a game that is quick to learn, to accommodate Agent C who doesn’t play cards often.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A brings out extra chairs so that everyone can sit comfortably around the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests that they all take turns to pick the music, so everyone’s taste is represented during their time together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to record the game session on video to create lasting memories for the group.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a suburban home, Agent A, a teenager, is selecting a board game to play with their cousin. They notice their younger sibling, Agent C, eager to join with a set of homemade trivia cards. Agent D is preparing snacks for the family gathering.",
    "actions": [
      {
        "description": "Agent A invites Agent C to join the game and expresses genuine interest in the trivia cards.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A ensures everyone's favorite game is played.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A collaborates with Agent B during gameplay.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A checks if everyone is enjoying the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A helps Agent C improve their play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers their seat to Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A maintains a light atmosphere during competitive play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In the living room, Agent A, a parent, finishes reading and turns attention to the family. Agent B, the spouse, sorts documents. Agent C, the teenager, shares sketches with Agent B. Agent D, the younger sibling, bakes cookies with Agent A's assistance.",
    "actions": [
      {
        "description": "Agent A invites the family for a cookie tasting to celebrate Agent D's effort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests a family kitchen cleanup after cookie tasting.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A offers to frame Agent C's artwork for the living room.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A decides to help Agent D with homework, providing equal attention.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A initiates a family board game night, each picking a game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A ensures everyone gets a turn to choose background music.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A collaborates with Agent B to sort bills for family finance discussion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A encourages sharing weekly highlights during dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A brings out a puzzle for the family to complete together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a cozy suburban home, with a home-cooked meal aroma, Agent A is crafting a fruit centerpiece at the dining table, Agent B is organizing place settings equally, and Agent C is writing names for seat assignments, all sharing laughter and stories.",
    "actions": [
      {
        "description": "Agent A offers to switch their elaborately folded napkin with Agent C's simpler version.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A lets Agent B choose the evening's background music.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agent C to add the final touches to the fruit centerpiece.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A teaches Agent C how to craft an elaborate napkin fold.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a board game with equal winning chances after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A compliments Agent B on the care in setting up the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A ensures dishes are cleaned up equally distributing the chore.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A discusses the importance of everyone contributing to household tasks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.7
        ]
      },
      {
        "description": "If disagreement on game choice arises, Agent A suggests drawing lots.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A arrives home to find Agent B has prepared dinner and Agent C is setting the table. The apartment is filled with the welcoming aroma of food, and a new board game is waiting for them. They engage in their evening ritual, exhibiting signs of a comfortable and considerate living situation.",
    "actions": [
      {
        "description": "Agent A decides to do the dishes after dinner, showing appreciation for the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to cover Agent C’s next turn in setting the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a toast which uplifts the group’s mood.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A talks about resolving a house matter that requires everyone’s input.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agents B or C to take the last piece of bread.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A gives Agent B a sincere compliment on the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A plans a rotation schedule for communal purchases.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to contribute ideas for cooking together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a parent, is preparing dinner in the kitchen. The warm scent of a home-cooked meal fills the home. Agent B and Agent C, A's children, are present. Agent C is at the dining table studying, while Agent B is upset about losing a game. Agent A wants to raise spirits and resolve earlier conflicts, ensuring an enjoyable evening.",
    "actions": [
      {
        "description": "Agent A offers to teach Agent B how to cook a favorite dish.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests that after dinner, the family play a board game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to have a discussion about sportsmanship.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A ensures both children help with setting the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.1,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A assigns Agent B the task of choosing the evening's dessert.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A compliments Agent C on their focus and study habits.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A apologizes for not noticing Agent B’s feelings earlier.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A facilitates a conversation to express feelings about the dispute.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A encourges Agent B to teach Agent C a game technique.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is a teenager who has just returned home from a soccer game feeling a sense of personal accomplishment. The family is preparing for a pleasant evening with dinner and a board game night. Agent A anticipates a joyful evening and notices their younger sibling Agent B struggling with a puzzle, while their parents, Agent C and D, are cooking and organizing the night's activities.",
    "actions": [
      {
        "description": "Agent A decides to help Agent C in the kitchen by setting the table and ensuring equal portions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A compliments Agent C on the dinner aroma, showing eagerness for the family meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A offers hints to Agent B on the puzzle, sharing the experience.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A volunteers for dishwashing duty post-dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A plays the board game inclusively, focusing on family participation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A thanks Agent C and D for organizing the night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A initiates sharing of favorite moments of the night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A ensures recognition of Agent B's effort on the puzzle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A and Agent B are siblings having dinner at home. Agent A notices the unequal food distribution but chooses to interact with Agent B positively, enjoying their company.",
    "actions": [
      {
        "description": "Agent A decides to express their concern about the unequal portions in a gentle manner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers a piece of their favorite dish to Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A asks if Agent B wouldn't mind sharing some of the extra food they got by accident.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes to switch plates with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests drawing lots to decide who gets the last piece of dessert.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.1,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A speaks up to encourage their parents to be more attentive during food serving.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.1,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A helps Agent B with the dishes after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent B to select a movie to watch together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A engages in reflective conversation with Agent B about sharing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is hosting a dinner for friends to celebrate recent achievements. Agent B helps with the cooking, and Agent C sets the table.",
    "actions": [
      {
        "description": "Agent A offers to switch tasks with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A asks for Agent B’s and Agent C’s input on the table setting.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A ensures equal food portions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A sacrifices his own dessert portion.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a toast.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests an equal chance game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A personally thanks each guest.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A chooses not to monopolize the conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is at home with their housemates, Agents B and C, on a relaxed Sunday afternoon. The air is filled with the aroma of baking, as Agent A has been in the kitchen since morning preparing a pie. Agent B is lounging on a couch reading a book, and Agent C is at the dining table engrossed in assembling a jigsaw puzzle. Agent A has made a pie and considers how to divide it equally among everyone.",
    "actions": [
      {
        "description": "Agent A presents the pie to Agents B and C, suggesting they all take a break and enjoy it together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes that they play a game, and the winner gets the first slice of pie.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          -0.4
        ]
      },
      {
        "description": "Agent A decides to let Agent B and Agent C choose their pieces first.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A verbally expresses how much they enjoyed baking for the housemates, hoping to elicit a warm conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A asks for feedback on the pie to see if the new recipe was a success.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agent C to finish the puzzle later and join them for pie.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "To add to the ambiance, Agent A selects a playlist that all housemates enjoy while they eat.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A cleans up the kitchen after baking, so no one is burdened with the mess.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a bright, spacious kitchen, Agent A prepares a weekend brunch while engaging with Agents B, C, and D. An additional guest unexpectedly arrives, and Agent A includes them in the joyous occasion.",
    "actions": [
      {
        "description": "Agent A welcomes the unexpected guest cordially and invites them to join the brunch.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A rearranges the seating to accommodate everyone comfortably at the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A offers to take a group photo to capture the cheerful gathering.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A ensures that each person has their preferred choice of food available.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes a toast to celebrate their togetherness and the guest's arrival.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages everyone to share stories or jokes, enhancing the lively ambiance.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A listens attentively to each individual, making sure everyone feels included.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A initiates a light-hearted game where everyone can participate.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A packs some leftover food for the guest to take home.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is planning a small get-together and ensures the entertainment reflects everyone's preferences. Various contributory acts towards household harmony are evident as the roommates prepare their living space for the evening, considering each other's feelings and contributions for a shared joyful experience.",
    "actions": [
      {
        "description": "Agent A crafts a playlist with everybody's favorite songs to ensure everyone enjoys the music.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests rotating game choices so everyone's preferences are accounted for.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A uses reusable dinnerware for environmental consciousness.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to pick up Agent C's friend, a considerate gesture strengthening companionship.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A makes time for everyone to share personal experiences, ensuring all voices are heard.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A considers everyone's comfort before adjusting the thermostat.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A looks at reallocating shared chores to balance responsibilities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A seeks to resolve a minor disagreement with understanding and dialogue.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A prepares a variety of snacks catering to all dietary needs.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is settled on the couch with his younger brother and cousin, discussing the upcoming family concert. As they prepare, he considers how to ensure everyone is heard and can contribute to the fun evening ahead.",
    "actions": [
      {
        "description": "Agent A organizes a rehearsal schedule, ensuring everyone is prepared for the concert.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A invites each to pick a song to perform.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests rotating the lead singer role.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers guitar lessons to his brother for the concert.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A settles a song choice dispute with a democratic family vote.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A proposes recording the concert for later viewing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A encourages his brother to design the concert poster.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A creates a game to help his cousin feel more comfortable performing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A chooses to perform last, allowing others to go first.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a shared kitchen, Agent A offers assistance and guidance to Agent B who is trying to bake a cake for the first time, while Agent C observes.",
    "actions": [
      {
        "description": "Agent A offers to check the recipe and ingredients used by Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A sets up a schedule on the fridge for each roommate to have baking time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A compliments Agent B on their willingness to try something new.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests turning the cake baking into a friendly weekly competition.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A notes there is only one cake pan and decides to buy another one.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A creates a shared grocery list for the household.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A provides support and guidance through the cake preparation process.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A discusses the kitchen cleanliness standards.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A engages Agent C in the baking process.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a warm, sunlit living room, Agent A is browsing through a photo album while Agent B is assembling a jigsaw puzzle depicting a previous vacation spot. The setting is tranquil, and it's an environment ripe for shared activities and recollecting memories.",
    "actions": [
      {
        "description": "Agent A helps Agent B with the puzzle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests taking a new family photo.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to make drinks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A proposes rotating music choices.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agent B to choose the next puzzle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A teaches Agent B photo archiving.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A discusses future vacation spots.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A organizes puzzles by difficulty.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A reflects on donating puzzles.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is living with Agent B and Agent C, who are also students, in a shared apartment. Agent B likes playing loud music, while Agent C prefers a quieter environment for studying. Agent A notices a rising conflict and initiates a conversation to address everyone's needs.",
    "actions": [
      {
        "description": "Agent A invites both roommates to have a discussion in the living room to address noise concerns and study hours.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes creating a schedule that accommodates both quiet hours for studying and time for relaxation and music.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers to lend noise-canceling headphones to Agent C during their study time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests Agent B use the common area during specific times when it's less likely to disturb others.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A volunteers to study with Agent C to foster a collaborative atmosphere.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A decides to organize a small celebration for Agent C after their exam.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A mediates a calm discussion where each roommate can express their needs and come to a mutual understanding.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A researches and presents possible solutions like soundproofing materials.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent B to choose a lower volume and shows appreciation when compliance is observed.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, tasked with refereeing a board game for younger siblings Agent B and Agent C, emphasizes smooth and enjoyable gameplay in the living room setting.",
    "actions": [
      {
        "description": "Agent A carefully explains the game rules again before the start to ensure clarity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A uses a bottle to decide who goes first, avoiding favoritism.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A ensures that Agent B and Agent C take proper turns during the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A corrects any accidental rule breaking without embarrassment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a snack break to lighten the mood after tense moments.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A commends smart play, recognizing strategy and skill.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A hears out both siblings before resolving a dispute.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A fosters sportsmanship with a post-game handshake.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A celebrates the contribution of both players, not just the winner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a cozy family room, Agent A observes Agent B and Agent C's differing opinions on their history project and looks for ways to assist without directly influencing the outcome.",
    "actions": [
      {
        "description": "Agent A offers to mediate a constructive discussion between Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A invites the teens to prepare a snack together to ease tension.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A suggests listing pros and cons of each idea to make a decision.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A encourages combining ideas for the project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers to proofread the final project draft.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A shares a personal anecdote about resolving a similar issue.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A stays nearby for support if Agent B or C requests help.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A sets a time limit to prompt a resolution.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests flipping a coin to quickly resolve the disagreement.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a family setting, Agent A is preparing dinner in the kitchen, Agent B is picking fresh ingredients from the garden, and Agent C is reading in the living room. Agent D, a family friend, arrives and is welcomed into the gathering.",
    "actions": [
      {
        "description": "Agent A prepares equal portions of the meal for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A invites Agent C to help set the table, fostering participation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A thanks Agent B for their contribution to the meal in front of the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A assists Agent D with the table arrangement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A asks everyone to share a highlight of their day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A facilitates a respectful conversation between Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A changes the recipe to suit Agent D's dietary preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A encourages collaborative cleanup after the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests dividing leftovers evenly among everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A and Agent B are siblings sharing a bedroom. Agent B is struggling with a math problem due for tomorrow's homework. Agent A, after completing a project, enters the room and notices Agent B's frustration. Their cousin, Agent C, proposes a game night with a board game that requires cooperative play. Agent A must decide how to approach the evening with his sibling and cousin.",
    "actions": [
      {
        "description": "Agent A offers to help Agent B with math homework before they all proceed to play the board game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests Agent B take a short break and join in the game for a while to clear their head.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to play the board game with Agent C first, allowing Agent B to finish studying.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A brings snacks for everyone to enjoy during the game, with some for Agent B during studying.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A sets a timer to prevent the game from running too late so Agent B can rest.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A talks to Agent C about rescheduling the game to ensure everyone can participate.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages turning the study session into a group activity to support Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A reviews the game instructions to expedite Agent B's later participation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A provides silent moral support to Agent B during their study time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A returns home after studying, where she finds her roommates in various activities. Agent B is busy with a project, Agent C is cooking, and Agent D is observing.",
    "actions": [
      {
        "description": "Agent A helps Agent B with the group project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agent B to join for dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers to document Agent C's recipes for a house recipe book.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A encourages Agent D to help with dinner setup.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a discussion at dinner for sharing daily experiences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes cleaning up after dinner as a group.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a weekly dinner schedule with rotating cooks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A champions a transparent group budget for household expenses.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A starts a conversation on effective use of common spaces.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a teenage girl interested in cooking, is in the kitchen with her younger brother, Agent B, and her cousin, Agent C. They are baking cookies on a warm Saturday afternoon and have decided to divide the tasks equally to work as a team.",
    "actions": [
      {
        "description": "Agent A decides to let Agent B choose the cookie shapes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A praises Agent C's efforts on monitoring the cookies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A offers to clean up the kitchen afterward.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes using some cookies to welcome the new neighbors.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests creating a rotating schedule for choosing what to bake.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A encourages Agent C to take the lead next time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A tastes a cookie and shares her honest feedback.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A seeks a compromise after a disagreement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A celebrates the effort by taking photos.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "The setting is a Saturday afternoon in the family household with Agent A, Agent B, and Agent C, gathered around a selection of board games, debating which to play in a warm and friendly atmosphere.",
    "actions": [
      {
        "description": "Agent A decides to perform a magic trick to entertain Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A gently encourages Agent B and Agent C to share their thoughts about the game choices.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests playing a game that Agent C, who rarely visits, particularly enjoys.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A tells amusing stories from past game nights to create a light-hearted mood.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A sets a rule that each person can pick one game, and they will take turns playing each choice.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A makes snacks for everyone to enjoy while they play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers to let Agent B go first since they had a long week at school.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to organize the games to make selections easier for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes a new game strategy, to mix parts of different games for a fresh experience.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, an enthusiastic high school teacher, arrives home and finds her children, Agent B and Agent C, setting up for the family’s weekly council meeting, a tradition meant to ensure everyone's voice is heard.",
    "actions": [
      {
        "description": "Agent A starts the family council by acknowledging Agent C’s artwork and inquiring about Agent B’s week.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A listens to both children's views on bedtimes and suggests a compromise.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A discusses household chores rotation with the children, ensuring both feel the division is equal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A decides on a family day out, with each member choosing an activity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes starting a family vegetable garden project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A mediates a minor disagreement between the children, fostering mutual understanding.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "After the council, Agent A ensures they all set up the game board together.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A extends Agent C’s bedtime slightly and includes a special late night for Agent B occasionally.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A commits to individual time with each child on a rotating basis.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a suburban home, Agent A facilitates equal contribution and maintains group cohesion for a joint school project. Agent B works efficiently while Agent C shows reluctance, and Agent A seeks methods to balance work and strengthen the team's bond.",
    "actions": [
      {
        "description": "Agent A decides to reassign some of Agent C's task to himself to ensure the project completion on time.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a break where everyone steps back from the project to relax with some refreshments.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A volunteers to compile the final report, putting together everyone's work cohesively.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A encourages Agent C by praising the parts of the project he's already done well.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A initiates a candid conversation with Agent B and Agent C regarding the distribution of the remaining workload.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A asks Agent C about any issues he may be having with the assignment and offers help.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A motivates the group by setting up a reward system for when each part of the project is finished.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to switch tasks with Agent C to give him a chance at a section he might find more engaging.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a warm kitchen, Agent A makes a meal plan while Agent B works on homework and Agent C struggles to draw. Agent B is anxious about time before soccer practice and Agent C is upset about not getting the dinosaur right. The setting paves the way for actions surrounding support, inclusion, and acknowledging the contributions and needs of each family member.",
    "actions": [
      {
        "description": "Agent A offers tips to Agent B to complete homework quickly before soccer practice.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A helps Agent C find an old notebook as a reference for a drawing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A involves children in choosing dishes for the meal plan.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A plans a shared family art supplies corner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests a family game for a break before Agent B’s soccer practice.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A sets up a weekly family meeting for open communication.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A recommends Agent C to share in the pet care responsibilities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A balances the meal plan with nutritional needs and preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a music teacher, is at home with Agent B, a high school student, Agent C, currently unemployed, and Agent D, a freelance artist. Everyone is engaging in their own activities in a shared living room. Agent A is preparing lessons and decides on actions that consider the shared use of the home.",
    "actions": [
      {
        "description": "Agent A offers to help Agent B with homework if needed.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to play a piece of music, considering a volume that is non-intrusive to others’ activities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A starts organizing the new books on the shelf to make them accessible for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests to Agent D to take turns on the TV after a certain period, giving others a chance to use it.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent C about recent news articles and their relevance to the music curriculum.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A takes a break from work to make tea for everyone in the living room.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A politely asks Agent D if the game's volume can be lowered slightly.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A uses headphones while reviewing a music lesson so as not to disturb the others.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agents B, C, and D for a short music appreciation session later in the evening.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is a teenager with a keen interest in culinary arts, spending his afternoon at home preparing a meal. Agent B is his cousin who is new in town and is visiting, Agent C is A’s eager younger sibling, and Agent D is a neighbor who has stopped by. Agent A has decided to prepare a family recipe and involves everyone in the process.",
    "actions": [
      {
        "description": "Agent A decides to delegate tasks, allowing everyone to participate in the meal preparation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers Agent B the first taste of the dish to make him feel welcome.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A ensures that all the cooking utensils are evenly distributed among the helpers to keep the workflow smooth.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a taste test to elicit feedback on the dish from Agents B, C, and D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agent D to sit at the head of the table as a sign of respect.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A encourages Agent C to share his opinion on the meal even if it's different from the others.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A cleans up the kitchen after cooking, despite contributions from the other agents.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A volunteers to make an extra batch of food to share with other neighbors.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A asks Agents B and C to set the table to involve them and share responsibilities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In the kitchen, Agent A is baking cookies with Agent B and Agent C looking on eagerly. The room is warm and the smell of cookies is inviting.",
    "actions": [
      {
        "description": "Agent A allows Agent B and Agent C to each select one cookie before dinner, ensuring they both get their favorite kind.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests that Agent B and Agent C share the remaining cookies equally after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A offers to include Agent B and Agent C in cookie decoration, allowing them to express their creativity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A saves some cookies for their neighbor who recently moved in, inviting Agents B and C to join in delivering them.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "After dinner, Agent A instigates a spontaneous cookie dance party in the kitchen with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to teach Agent B and Agent C how to bake cookies, turning the act into a learning opportunity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A holds a small contest where Agent B and Agent C can guess the ingredients used in the cookies for an extra treat.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A sets up a mock cookie shop where Agent B and Agent C can \"sell\" cookies to other family members, teaching them about trading and sharing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A arranges a comfortable movie night, complete with cookies, to relax with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a teenager and recent winner of a school art competition, is at home where the living room is adorned with their artwork. Agent B, their younger sibling and an aspiring artist, Agent C, their parent, and Agent D, a cousin, are discussing the upcoming family gathering where a wall will be dedicated to exhibiting both Agent A's and B's art pieces equally.",
    "actions": [
      {
        "description": "Agent A decides to mentor Agent B by offering tips and advice on art techniques for their next project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A voluntarily helps Agent C rearrange the furniture so that the artwork display is more prominent.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent D to brainstorm ideas for their joint artwork, ensuring equal input from both parties.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A organizes a small family event to unveil the wall, ensuring everyone’s art is recognized.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A leads a discussion with Agents B and D about themes for their collaborative piece that resonate with all of them.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A takes down their winning piece from the central spot on the wall to make room for a collaboration with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A spends extra time practicing with Agent B, sacrificing their own leisure time to support their sibling.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a medical intern, returns home to find their roommate, Agent B working and their cousin, Agent C, about to start cooking dinner. Agent A checks a corkboard with a duty roster, promoting collective responsibilities.",
    "actions": [
      {
        "description": "Agent A helps Agent C prepare the meal, cooperatively engaging in the evening's task.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A shares a cooking tip with Agent C to enhance the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Brings the household together for a post-dinner group activity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Cleans up after dinner, easing the burden on the designated cook, Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Leaves a note expressing gratitude for Agent C’s cooking efforts.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.2
        ]
      },
      {
        "description": "Encourages Agent B to take a deserved pause and enjoy the meal with everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Offers a helping hand or a sympathetic ear to Agent B or C if they seem stressed.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is working on a school project and notices their younger sibling, Agent B, struggling with math homework. Their parent, Agent C, has finished cooking dinner, and Agent D, the other parent, is setting up a new family board game.",
    "actions": [
      {
        "description": "Agent A helps Agent B with their math problem, setting aside their own work.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A continues their own project focus.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.0,
          -0.5
        ]
      },
      {
        "description": "Agent A suggests a dinner break to Agent B for a fresh perspective.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A makes dinner plate for Agent B to minimize their interruption.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A plans to join the family game, prioritizing family time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A explains potential game participation delay to Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A sets the table, acknowledging Agent C's cooking effort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to clean up post-dinner, recognizing Agent C's tiredness.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a balanced evening for work and relaxation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a mother, prepares dinner in a warm kitchen environment, interacting with her children, Agent B and Agent C, who are engaged with their studies, awaiting the arrival of Agent D, the father.",
    "actions": [
      {
        "description": "Agent A offers to help Agent C with her school project after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A asks Agent B to share his thoughts on what he's studying.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A decides to involve her children in cooking by assigning them simple tasks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A ensures that the portion of food is equally divided onto the plates.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A initiates a game to share what everyone learned today during the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A encourages Agent B to assist Agent C with her homework.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A reserves a portion of dinner for Agent D to ensure he has an equal share.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A sets aside time to discuss everyone’s day and make weekend plans.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A compliments both Agent B and Agent C on their help in the household.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a warm and inviting home setting, Agent A prepares a meal for the family, who gather to enjoy the food and each other's company. Post-meal activities are on the horizon, promoting a sense of unity and joy.",
    "actions": [
      {
        "description": "Agent A starts a family conversation to share their day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A appreciates Agent C's cooking efforts.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A includes everyone in deciding the post-meal board game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A checks in on Agent D's quieter demeanor with concern.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A proposes a post-lunch puzzle activity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A tells Agent B they can rest post-lunch.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A shares their food with Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a family walk to enjoy the sunny weather.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agent D to tell a story for fun.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A and Agent B are at home settling into their evening routine. Agent A is reading, Agent B is handling paperwork, and Agent C is practicing guitar. The house is filled with the inviting smell of stew.",
    "actions": [
      {
        "description": "Agent A offers to help Agent B with organizing bills and paperwork.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A takes a break to listen to Agent C play guitar and gives encouragement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A arranges a comfortable workspace for jointly sorting paperwork.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests performing a song together for Agent B in the evening.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A discusses stress-free financial management with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A sparks an impromptu game night for relaxation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A notices Agent C's frustration with guitar practice and offers feedback.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A serves stew, respecting everyone's preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A drafts a schedule for family chores, requesting input from all.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a teenager with a penchant for board games, is playing a game with Agent B, a close friend, and Agent C, a younger cousin, in a cozy living room.",
    "actions": [
      {
        "description": "Agent A decides whose turn it will be next by spin a bottle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests taking a group photo.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A carefully explains the rules of the game to Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A overlooks Agent C's minor mistake.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A chooses to play a less aggressive strategy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A proposes another round of the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent C to take the winning move.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A offers to share the prize with everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A enters the kitchen to find Agent B and Agent C arguing over the last slice of cake from Agent C's school celebration. Agent A suggests finding a resolution together, aiming to maintain a positive atmosphere.",
    "actions": [
      {
        "description": "Agent A proposes splitting the last piece of cake equally between Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to forego having any cake to allow Agent B and Agent C to share the last piece.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages a conversation between Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A initiates a family activity with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests flipping a coin to decide who gets the cake.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers to bake a new cake involving both Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A discusses the importance of sharing and compromises.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A buys a small cake for Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A creates a game for the cake between Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "[Agent A, a father, enters the living room and finds his children, Agent B and Agent C, arguing over a family-shared tablet. Agent B wants to use it for art, while Agent C needs it for school research. The tablet is on the coffee table, showing an art app, among scattered artworks and schoolbooks.]",
    "actions": [
      {
        "description": "[Agent A suggests scheduling specific times for tablet use, avoiding conflict and planning activities.]",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "[Agent A helps Agent B with sketching on paper during their waiting time.]",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "[Agent A helps Agent C with their school project using his personal computer.]",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "[Agent A initiates a family discussion to establish rules for sharing.]",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          1.0
        ]
      },
      {
        "description": "[Agent A encourages Agent B to showcase their artwork to the family.]",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "[Agent A plans a library trip with Agent C for project research.]",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "[Agent A proposes investing in art supplies for Agent B.]",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "[Agent A offers to supervise a collaborative project between Agent B and C.]",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.7
        ]
      },
      {
        "description": "[Agent A plays an educational game on the tablet with Agent C.]",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A prepares dinner and creates a positive environment for Agent B and Agent C, encouraging them to discuss their school projects and ensuring everyone has equal participation.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to each share something about their day before starting dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A serves the meal, making sure that Agent B and Agent C receive equal portions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes a weekly family game night to strengthen family bonds.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A compliments both Agent B and Agent C on their hard work on their school projects.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests that the family send a care package to Agent D with everyone contributing an item.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A listens attentively and actively to Agent B and Agent C as they discuss their projects.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A asks Agent B and Agent C for their opinions on a new family activity or outing for the future.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A encourages Agent B to help Agent C on a difficult part of their project, if Agent C requests it.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A recommends that Agent B and Agent C take short breaks and join them in the living room for a quick stretch or light activity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "The snug living room of a modest family home sets the stage, where Agent A, a high school senior, is seen perspiring lightly after their football practice. Agent B, A's sibling, lounges on the couch, a thick textbook open but attention elsewhere, occasionally jotting down notes for an upcoming exam. The setting sun filters through the blinds, casting a warm glow over the pair. In the corner, a well-worn board game sits on a shelf, a small layer of dust gathering on its lid. Outside, children's laughter can be heard as the neighborhood kids revel in the remaining daylight.",
    "actions": [
      {
        "description": "Agent A suggests taking a short break to play the board game for relaxation and to clear Agent B's mind.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers to help Agent B with their studies by reviewing the material and quizzing B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A decides to order their favorite takeout food to enjoy together during their study break.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A elects to create a quick study guide on the topics Agent B finds difficult, providing an easier overview.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A considers taking a walk with Agent B around the neighborhood for a change of scenery and fresh air.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A feels compelled to call up more family members to play the board game to foster a sense of connection.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A contemplates placing the board game back on the shelf, respecting Agent B's need to focus on studying.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A thinks about organizing a game night for another day, so there is something to look forward to.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A ponders over setting up the board game, preparing it for a quick round if Agent B agrees.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a primary school teacher, is at home grading papers in the dining room. Agent B, her roommate and colleague, is working on a lesson plan at the same table. An envelope containing a bonus check for outstanding performance lies between them. Both have had successes in their teaching but are unaware of who the intended recipient is. Agent C enters the dining room and notices the envelope. Agent A looks up from her papers, considering the situation, while Agent B pauses her work, curious about the contents of the envelope.",
    "actions": [
      {
        "description": "Agent A opens the envelope, reads the accompanying note regarding the bonus for outstanding performance, and shares the information with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests that they call the school administration to clarify who the intended recipient is.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A discusses with Agent B how they both contributed to the school's success and considers an equitable way to share the bonus.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A places the check back in the envelope to ensure it remains safe until they reach a decision.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.1,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to sit down together for a cup of tea to relax after the initial surprise.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A compliments Agent B's recent accomplishments in her lesson planning, emphasizing the teamwork aspect of their successes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A proposes they celebrate their dedication to teaching regardless of the bonus's recipient.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A makes a light-hearted joke to ease any potential tension and bring a smile to Agent B and Agent C’s faces.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is in the kitchen with their roommates, Agent B and Agent C, preparing dinner together and participating in shared laughter and decision-making.",
    "actions": [
      {
        "description": "Agent A suggests implementing a rotation system for selecting recipes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A asks Agent B and C for feedback on the dish.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes organizing a weekly meal planning session.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A volunteers to clean up after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A offers to help Agent C with setting the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A compliments Agent B on the delicious sauce.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to share their secret recipe.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agent C to choose the dinner music.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A shares a funny story from their week.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is at the family dining table with Agents B and C. Agent B is sharing travel experiences after returning from studying abroad, with the joyous atmosphere enhanced by a freshly baked cake Agent A made to celebrate the occasion.",
    "actions": [
      {
        "description": "Agent A suggests a communal moment of gratitude.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A equally divides the first slice of cake.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers the first piece of cake to Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A proposes a travel scrapbook project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers to help Agent C with schoolwork.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A takes responsibility for the cleanup.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A invites others to bake together next time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A encourages Agent C to share their own success story.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests organizing a family reunion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is at home on a weekend during the study break. Agent B, her roommate, is occupied with her artwork. Agent C is playing a video game. Agent A has just finished cleaning and sees Agent B's painting supplies on the common table.",
    "actions": [
      {
        "description": "Agent A asks Agent B if she can help organize the art supplies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests to Agent C to lower the volume of his game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes to create a schedule for using the living room.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to prepare snacks for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A offers to purchase additional storage for Agent B's supplies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A brings up the idea of sharing their personal work during dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A chooses to start her own study session without disturbing others.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A reaches out to discuss future plans for shared expenses.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to join Agent C for a quick game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Inside a home's garage and driveway, Agent A is coordinating a charity garage sale with Agent B and Agent C. They are preparing items to sell and discussing the charity they will support, under the warmth of the setting sun.",
    "actions": [
      {
        "description": "Discuss with Agent B and Agent C which charity will benefit from their garage sale earnings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Set aside the rare vinyl record for Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Match the final amount raised with own savings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Organize sale goods by usefulness rather than price.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Invite passerby and explain the charitable cause.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Volunteer to handle money for transparency.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Put up signs about the use of proceeds.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Let Agent C manage the lemonade stand.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a cozy, sunlit kitchen, Agent A, a parent, is preparing a special weekend breakfast. Agent B, their partner, is setting the table. Children, Agent C and Agent D, are seated, lightheartedly debating who gets the first pancake. The atmosphere is full of anticipation for a shared enjoyable breakfast.",
    "actions": [
      {
        "description": "Agent A makes a game out of who gets the first pancake.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A serves the pancake equally by cutting it in half.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A suggests everyone eat together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A explains the value of sharing and taking turns.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A promises to cook special pancakes next weekend.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A compliments Agent B on the table setting.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A asks the family to vote on pancake toppings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a clean-up relay game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A plans a surprise outing for the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is organizing a family game night to bring everyone closer and ensure an enjoyable break from the weekly routine. Agent B and Agent C are present, with a selection of board games ready, and comfort has been provided for all participants.",
    "actions": [
      {
        "description": "Agent A suggests a new board game for family members to try, generating interest from both Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A lets Agent B choose the background music for the evening, knowing it will make Agent B pleased.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to order everyone’s favorite pizza toppings to make sure all members of the family are satisfied.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent C to share a new game by explaining the rules to everyone, contributing to collective understanding and participation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A ensures everyone has comfortable seating for the game night by bringing in an extra chair.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "During the games, Agent A recognizes each person’s clever play, bolstering individual confidence and recognition.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A mediates any disputes, keeping the atmosphere calm and enjoyable for all.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.9
        ]
      },
      {
        "description": "Sharing fond memories, Agent A highlights the sentiment behind the tradition of game nights.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is preparing dinner in the kitchen while Agent B works on a school project at the table. Agent C arrives with a new board game, eager to play. The household has an evening rule that any leisure activity must be agreed upon by all.",
    "actions": [
      {
        "description": "Agent A helps Agent B hasten their schoolwork.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A schedules a family game night after dinner and homework.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A talks briefly with Agent C about the new board game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A gives Agent C a coloring book to wait patiently.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A cooks Agent B’s favorite dish.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A takes a snack break with Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A commits to playing the board game on the weekend.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A asks Agent C to help with setting the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A commends Agent B’s schoolwork dedication.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In the family dining room, Agent A sorts through mail, Agent B cares for houseplants, and Agent C works on a school project. An upcoming concert poses a decision challenge for the two available tickets amongst three family members.",
    "actions": [
      {
        "description": "Agent A suggests a family meeting to discuss who would most enjoy the concert.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to gift the concert tickets to Agent C to celebrate the completion of a successful school term.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a creative competition with the tickets as the prize.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A plans to purchase an additional ticket for all to attend.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers to stay home while the others enjoy the concert.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A asks B and C if they would like to draw lots for the tickets.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A considers selling the tickets for a family activity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A thinks about gifting the tickets for an anniversary.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A ponders donating the tickets for a family outing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A organizes a family game night to ensure an enjoyable evening for everyone; Agent B and Agent C are choosing board games from the shelf.",
    "actions": [
      {
        "description": "Agent A suggests taking turns where each person can pick a game to play for the evening.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a new game, which is a combination of elements from two games.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A decides to make a scoreboard to track each game's results playfully.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A sets up the games while encouraging Agent B and Agent C to help.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers to teach a game none of them has played before.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A reminds Agent B and Agent C about good sportsmanship.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A ensures that both Agent B and Agent C's favorite snacks are prepared.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A takes a moment to capture a family photo before starting the games.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A lets Agent B and Agent C handle the setup of the game they chose.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a high school junior, is seated at the dining table with a math textbook open, preparing for an exam. Agent B, Agent A's older sibling, is working on a laptop. Agents C and D, their parents, discuss the family movie night in the living room. The family has put up a new chore rotation schedule, and Agent A contemplates it.",
    "actions": [
      {
        "description": "Agent A offers to help Agent D with preparing snacks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A proposes a reward system for completing chores.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A expresses gratitude for the chore schedule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests amending the schedule to suit individual needs.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A takes up an unpopular chore voluntarily.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A creates a family group chat for chores.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A spends leisure time with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A helps with cleanup after movie night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is hosting a dinner event at their home, with guests including a long-time friend Agent B and a cousin Agent C with dietary restrictions. The environment is welcoming, and Agent A has taken special care in preparing a variety of dishes to accommodate all guests.",
    "actions": [
      {
        "description": "Agent A personally serves Agent C with the special dishes prepared to meet their dietary restrictions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a toast, acknowledging the contributions of every guest towards the warm gathering.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A ensures to spend individual time with each guest, sharing stories and catching up with their lives.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A offers Agent B an opportunity to explain the dishes they cooked, giving credit for the effort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A sets up a casual game for everyone to participate in after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "While cleaning up, Agent A notices Agent B accidentally left a personal item; they decide to safely keep it until they can return it.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A finds that an extra dessert was made and decides to offer it to a neighbor who lives alone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.7
        ]
      },
      {
        "description": "If a guest brings a bottle of wine or a gift, Agent A makes sure to open it during the event to show appreciation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A engages in active listening, showing genuine interest in conversations.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a university student, finishes a group project with Agent B and Agent C in a disheveled living room, contemplating organizing the space.",
    "actions": [
      {
        "description": "Agent A decides to organize the living room by creating a tidy-up competition.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A sorts out the study materials alone, letting others relax.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          -0.3
        ]
      },
      {
        "description": "Agent A proposes everyone clean their own materials.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A starts cleaning quietly, hoping others join in.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.1,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A reminisces about past study sessions while cleaning.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes study materials for future use.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A delegates tasks, taking on the largest share.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.1,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A calls for a break and suggests a board game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A shares group study photos in a chat before cleaning.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In the cozy evening glow of the living room, Agent A is sitting on a well-worn sofa, leafing through a photography book. Agent B is at the dining table, painting a canvas, while Agent C enters with a handful of tickets to a sold-out art exhibition, creating a decision-making situation among friends.",
    "actions": [
      {
        "description": "Agent A offers their ticket to Agent B to honor their artwork.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A discusses hosting a private art show for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to purchase a virtual tour for those not attending.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a rotating schedule for ticket sharing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A plans a group art project for all friends.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A tries to get additional tickets by volunteering.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A postpones using their ticket for a future group outing.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A stays behind to comfort Agent E.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In the dining room with warm afternoon sunlight, Agent A engages with craft materials while Agent B untangles yarn and Agent C practices guitar. The ambiance is cozy with the smell of fresh cookies. Agent A observes an opportunity to assist both B and C in their activities.",
    "actions": [
      {
        "description": "Agent A offers to assist Agent B with the yarn while conversing about their days.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A recommends enjoying cookies together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A devises a schedule for communal space usage.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A compliments Agent C’s guitar skills.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A assists Agent C with tuning the guitar.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A gets water for Agent C during their practice.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent C to partake in crafts.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A equitably distributes craft materials.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A tidies up after crafting.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a home kitchen, the scent of cookies sets the stage for a neighborhood gathering. Agent A has prepared cookies, Agent B admires the setup, and Agent C curates a playlist for all ages.",
    "actions": [
      {
        "description": "Agent A ensures each child gets the same amount of cookies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A shares a toast with Agent B, recognizing their shared efforts.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A publicly appreciates Agent C's playlist efforts.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A arranges extra seats for a latecomer to ensure their comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A talks one-on-one with an introverted guest to make them comfortable.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A limits cookie servings to let each guest try some.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A invites guests to share stories, making everyone feel heard.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A helps with the cleanup, equally sharing the workload.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A asks for feedback on the evening to improve future events.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A organizes a study group in the living room with classmates Agent B and Agent C. They have snacks and are studying for final exams, with each person tackling different subjects. Agent B struggles with math while Agent C works comfortably on English.",
    "actions": [
      {
        "description": "Agent A reviews the math problem with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A encourages Agent C to share their English literature knowledge.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A schedules breaks for the group.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes rotating study topics.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A shares personal study tips.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A looks up online resources for the group.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests switching seats for new perspectives.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A ensures an inclusive conversation atmosphere.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A divides snacks evenly.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, is finishing a communal jigsaw puzzle in the living room. Agent B, their younger cousin, has been eagerly watching and is excited to place the last piece. Agent C, their parent, observes from the kitchen, preparing snacks. The atmosphere is warm and the day sunny, enhancing the communal activity.",
    "actions": [
      {
        "description": "Agent A invites Agent B to place the last piece of the puzzle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to frame the completed puzzle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A suggests starting a new puzzle together with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes a rotation for placing puzzle pieces.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.1,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A waits for Agent C before finishing the puzzle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A volunteers to clean up the living room.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A helps with snack preparation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A searches for a new puzzle for Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A sets up a celebration ceremony.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          -0.1
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "The setting is a cozy Sunday afternoon in the living room of a family home. Agent A is seated at a table with a puzzle, Agent B is lounging with a book and half-watching TV, and Agent C is playing with a new handheld game device.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to help with the puzzle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests turning off the television.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A offers Agent C a turn to place the puzzle piece.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A identifies a system for music selection.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A provides hints to Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to make snacks for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A ensures Agent B is comfortable with the activity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A sets up a rule about voluntary participation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A compliments Agent B and Agent C on their skills.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A reviews a chore chart and discusses evening plans as Agent B presents movie tickets for the night which conflicts with Agent C's work commitments.",
    "actions": [
      {
        "description": "Agent A suggests a rescheduling of Agent C's chores, offering to take on some tasks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes drawing lots to decide who will go to the movie.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A offers up their own movie ticket to another friend.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A initiates a quick brainstorming session to come up with a solution.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A decides to stay and support Agent C with their project.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A sets up a movie night at home for a future date, including snacks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A volunteers to run additional errands for the household.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A makes a light-hearted bet on a party game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a shared apartment, Agent A suggests brainstorming on the whiteboard to come up with a solution for a high utility bill and invites roommates B and C to discuss over a slice of pie.",
    "actions": [
      {
        "description": "Agent A proposes documenting their utility usage on the shared whiteboard for better transparency.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A offers to cover a larger portion of the utility bill, acknowledging higher usage due to baking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a round-table discussion for everyone to express concerns and suggest solutions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A sets up a payment plan on the whiteboard, integrating everyone's input for comfort with the final agreement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A decides to schedule oven and heater use to decrease future bills.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A apologizes for any inconvenience caused by the unexpected bill amount.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A shares the apple pie equally among all roommates.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A suggests Agent B adds an additional amount for extra heater usage.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A drafts a roommate agreement to avoid similar issues, adding financial responsibilities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a high school senior, is managing the household budget and notices discrepancies in the utility bills. His younger siblings, Agent B and Agent C, are working on an art project, unaware of the financial concerns.",
    "actions": [
      {
        "description": "Agent A calls the utility company to inquire about the bills to ensure they are not being overcharged.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A involves his siblings in a game about resource conservation and efficiency.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A uses the corrected bills' savings for a family day out.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A holds a household meeting for inclusive budget management decisions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A creates an idea box for anonymous budgeting and entertainment suggestions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A evenly distributes chores among the siblings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests his siblings sell their artwork online.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A treats his siblings to ice cream as a reward for their hard work and creativity.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A offers to tutor his siblings in difficult subjects.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A and housemate Agent B are in their apartment's living room, peacefully engaged in individual tasks. Agent C, a visiting friend, relaxes nearby. The setting suggests a collaborative and relaxed environment with room for engagement in shared activities.",
    "actions": [
      {
        "description": "Agent A suggests to Agent B that they take a short break from their tasks to play a board game together for leisure.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers Agent C a selection of beverages to make them feel welcome and attends to their comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A asks Agent B for input on how to organize the shared bookshelf so that both can easily access their favorite volumes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to participate in deciding which board game to play, ensuring inclusivity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "After playing games, Agent A initiates a conversation about establishing a routine time for household maintenance and shared responsibilities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a system for alternating use of the common workspace to ensure both have ample opportunity for quiet study and work.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent C to contribute ideas on optimizing the living space for visitor accommodation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.6
        ]
      },
      {
        "description": "Concerned about Agent B’s workload, Agent A checks if there is any way to offer support or assistance.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A, noticing an old photo album amongst the boxes, shares memorable stories associated with the photos with both B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is seated at a large dining table surrounded by housemates on a cozy Friday evening for a monthly potluck dinner. The table holds a spread of homemade dishes and the energy in the room is warm and lively.",
    "actions": [
      {
        "description": "Agent A brings out a surprise dessert they baked to share with everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers some of their portion to Agent B, who arrived last and has less to choose from.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A suggest drawing names to determine the order of serving.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent C to sit next to them during dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a toast to celebrate everyone's hard work and dedication.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A ensures Agent C gets their turn after being accidentally skipped during serving.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A steers a sensitive debate back to inclusive and lighthearted subjects.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A invites everyone to join them for a group hiking trip during the weekend.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A and their family prepare for a small gathering at home, focusing on food preparation and creating an inclusive and pleasant atmosphere for all.",
    "actions": [
      {
        "description": "Agent A makes a separate dessert with Agent D for them to present, celebrating their joint effort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent C to create a photography station to collaborate on a family cookbook.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests Agent B use colorful plates for everyone to choose from to enhance the dining experience.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A introduces a seating arrangement that changes throughout the evening to encourage varied social interactions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A starts a game where everyone gives a compliment, encouraging a positive exchange among family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A shows appreciation for Agent C's music selection and adds to it, fostering shared interests.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A thanks Agent B for their hard work in setting up, acknowledging their contributions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A volunteers to take on the dishwashing, considering Agent B’s efforts earlier.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A involves Agents C and D in choosing tasks for the event, ensuring their participation is valued.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In the family home, Agent A finds themselves mediating a dispute between Agents B and C over who gets to play the gaming console next. The atmosphere is a mix of tension and playfulness, with the potential to foster a collaborative and joyful environment.",
    "actions": [
      {
        "description": "Agent A suggests a timed turn system for the gaming console to ensure equitable playtime.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agents B and C to join in setting up a reward chart for sharing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to engage Agents B and C in a collaborative project like building a model airplane.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A schedules a family game night to build upon collective moments of joy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A orchestrates a discussion for Agents B and C to express their feelings and resolve the sharing dilemma.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A recognizes the achievements of both Agents B and C in the games they play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A sets a positive example by offering their own leisure time for the day to Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes creating a new game for Agents B and C to play together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A delivers an impromptu storytelling session to captivate the children's attention.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a parent, organizes a painting competition for their children, Agents B and C, with the theme 'Our Happiest Family Memory.' Equal supplies are distributed, and the atmosphere is jovial with an emphasis on shared enjoyment.",
    "actions": [
      {
        "description": "Agent A compliments Agent B and Agent C on their artistic efforts.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A ensures that Agent B and Agent C have the same quantity and quality of art supplies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A suggests taking a break for snacks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to make a game out of the competition.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A avoids giving direct critiques.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A takes pictures of everyone with their paintings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A proposes to hang all the paintings in a place of honor in the home.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A engages in friendly banter with Agent B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a kitchen, Agent A bakes cookies and prepares an evening of games for the anticipated arrival of Agent D. Agent B and Agent C are present, participating in preparations and conversations.",
    "actions": [
      {
        "description": "Agent A portions out the cookies equally, saving some for an absent friend.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A offers game rule adjustments for inclusive play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A reassures Agent D over the phone about the evening.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a group effort for the evening’s music playlist.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A invites Agent C to assist with baking as a shared task.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A remembers and caters to Agent B's dietary preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A strategizes game start for easy inclusion of Agent D later on.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A mediates to maintain harmony over a game disagreement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A engages with Agent C for a full inclusion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a college student, returns home and joins siblings Agent B and Agent C for game night in their cozy living room. They prepare to play a collaborative board game to build a sustainable city, while sharing food and enjoying the togetherness. Agent A engages in actions to ensure that everyone has an equal opportunity to participate and to make the night enjoyable for all.",
    "actions": [
      {
        "description": "Agent A suggests rotating the game leader role.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes a team strategy session.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A compliments Agent B's idea.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A pauses to clarify rules for Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A shares resources with Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A starts a side challenge to boost spirits.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A reminds to keep friendly competition.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A checks on everyone's comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A applauds Agent C’s creative solution.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A and his housemates are at home discussing the allocation of rooms, due to Agent B needing better natural light for painting. Agent A, who enjoys cooking, has the room with the best light but seeks a peaceful and equitable resolution.",
    "actions": [
      {
        "description": "Agent A offers to switch rooms with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a rotating schedule for the balcony room.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A presents a compromise with communal balcony use.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A drafts a list of amenities based on needs and preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A organizes an anonymous vote for room choices.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A sets up additional lighting in the common room temporarily.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers assistance moving Agent B's belongings if needed.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A buys better shades for Agent B’s room to optimize light.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a bright living room, Agent A is choosing between board games for an evening activity with roommates Agent B and C. The room is welcoming with a cozy atmosphere.",
    "actions": [
      {
        "description": "Agent A proposes to play the recent board game purchase to try something new with everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A asks for opinions on which game to play, valuing group preference.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers to explain the new game to everyone for equal participation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A is willing to switch to Agent B's favorite game if the new one is too complex.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A volunteers to be 'game master' for a better group experience.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A warmly invites Agent C to join and feel valued in the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A allows for breaks to consider the comfort of others.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A encourages a post-game discussion to reflect on the fun.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is at home, seated at the dinner table. Agent B discusses furniture rearrangement. Agent C, the dog, watches them. Agent D, the neighbor, waits by the door. Decisions on sharing and planning ensue.",
    "actions": [
      {
        "description": "Agent A offers part of their meal to Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a vote on furniture arrangement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A assigns tasks for furniture rearrangement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A includes Agent D's opinion on the furniture arrangement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A gives Agent C a bit of food from the dinner plate.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent D for a future meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A creates a game for deciding on the last piece of dessert.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A compliments Agent B's ideas.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A prepares a new dish with leftovers.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "In a suburban home, Agent A and Agent B are in the living room. Agent A is studying for a competition while Agent B is reading a graphic novel. Agent C is in the kitchen. A chore chart shows Agent B is supposed to clear the table, but usually forgets.",
    "actions": [
      {
        "description": "Agent A gently reminds Agent B about the chores and suggests tackling the task together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A chooses to clear the table alone, without bothering Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.4,
          0.0,
          -0.5
        ]
      },
      {
        "description": "Agent A motivates Agent B by setting a fun, speed challenge to see who clears the table faster.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A discusses with Agent C about a more effective system for household duties.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A purposely ignores the situation, causing the table to remain cluttered.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.7,
          0.0,
          -0.8
        ]
      },
      {
        "description": "Agent A proposes a swap of chores with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A confronts Agent B about recurring oversight for a long-term solution.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A leaves a humorous note on Agent B’s novel, about the chore.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A is hesitant to bring up the topic with Agent B to avoid conflict.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.0,
          -0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a high school coach, is at home during the evening with their children, Agent B and Agent C. In the living room, they witness the children arguing over the last slice of pizza. Agent A suggests playing a game that requires skill, not chance, to decide who gets the slice, while offering to judge to ensure a reasonable outcome. They prepare for the game surrounded by laughter and playful exchanges.",
    "actions": [
      {
        "description": "Agent A proposes a coin toss to decide who gets the last slice, ensuring an impartial decision.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A encourages Agent B and Agent C to share the last slice of pizza by cutting it in half.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A listens to each child's argument as to why they should have the pizza, and then makes a decision based on rationality.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A leaves the decision to Agent B and Agent C, to test their ability to negotiate and come to a mutual agreement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A takes the last slice for themselves, showing that sometimes a mutual decision cannot be made.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.7,
          0.0,
          -0.6
        ]
      },
      {
        "description": "Agent A challenges the children to a quick physical activity contest, knowing that they both excel in different sports.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A tosses the last slice to see who can catch it, turning the decision into a game of skill and reflex.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A hides the slice and sets up a scavenger hunt with clues for both children.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, is organizing the family game night. Agent B arrives with a new game for a limited number of players, with Agent C also eager to play. The arrival of Agent D creates a challenge due to the player limit, but Agent A seeks to include everyone.",
    "actions": [
      {
        "description": "Agent A decides to split the group into two teams so that everyone can participate.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests drawing lots to decide who plays the game first.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes they play a different game that accommodates more players.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to teach the game rules while others watch.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a rotation system for players.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A invites Agent D to be the game moderator.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A organizes a snack break to discuss player limitations.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to sit out the first game round and entertain Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A tries to find an app version of the board game for more players.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A sets up a family dinner to celebrate Agent D's academic success. Agent B and C grade a painting in another room, while Agent D admires the dinner setup. The house is filled with the smell of a delicious meal and the sound of soft music.",
    "actions": [
      {
        "description": "Agent A gets Agent D involved in choosing the seating arrangement at the dinner table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A sets an example by washing hands first and reminds the family to do the same.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A compliments Agent D and invites them to share their success story at dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agent D to discuss what they learnt from the academic challenges faced.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A lets Agent D pick the dinner background music.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers Agent D the chance to serve dessert.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A shows consideration for Agent D's meal preferences and is willing to adapt the menu.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a toast in honor of Agent D's achievements.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A initiates planning a future family outing that everyone will equally enjoy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, is in the kitchen with Agent B, their younger sibling. The kitchen is warm with the aroma of freshly baked cookies wafting through the air. Agent C, their parent, stands near the dinner table, sorting through various papers and bills. The atmosphere is homely and the soft hum of a radio fills the background with a light tune.",
    "actions": [
      {
        "description": "Agent A suggests dividing the cookies equally among themselves and Agent B, ensuring they both get the same amount.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A offers the choice of first pick to Agent B to avoid any sense of favoritism in choosing cookies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A decides to save some cookies for Agent C as a considerate gesture.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agent B to join in the process of cleaning up the kitchen after baking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes to Agent B that they should make a new batch of cookies together another day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A takes initiative to label and set aside a few cookies for a neighbor who loves them.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A engages in conversation with Agent C about how to prioritize budgeting their allowance.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A comes up with a game to decide who gets the last cookie through a playful challenge with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A helps Agent B with their homework in the living room after they enjoy the cookies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "The scenario is set in a family home environment where Agent A is engaged in planning a school event. Agent B is reading, and Agent C is drawing. Shape with the intention to have a game night brought up by Agent B and supported by the enthusiasm of Agent C.",
    "actions": [
      {
        "description": "Agent A puts down the notebook and proposes to decide on what game to play by voting.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers to include Agent C's artwork as a piece in one of their board games.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A decides to tidy up the living room.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A considers and asks about each family member's day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A encourages Agent B to finish the current chapter in the book.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A takes the initiative to make snacks for the group.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests they rotate choosing games in future game nights.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A pauses the game if Agent C seems tired.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A expresses appreciation for Agent B's game night idea.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, is organizing a party with friends Agent B and Agent C at home, ensuring an inclusive and joyous atmosphere for all guests.",
    "actions": [
      {
        "description": "Agent A adjusts the sitting arrangements for guests’ comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A rotates the hosting duties with friends.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A organizes a raffle with prizes for the guests.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests board games that encourage team building.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A places nutritional information for dietary accommodations.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A sets up a quiet corner for overwhelmed guests.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A creates a varied music playlist.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A personally greets every guest at the door.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A checks in on shy or alone guests.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.7
        ]
      }
    ]
  }
]