[
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenager, notices a strange, old cabinet with ornate designs that was left in the new family home. Agent B is focused on organizing the house, and Agent C is resting but available to help.",
    "actions": [
      {
        "description": "Agent A examines the cabinet more closely, looking for any kind of mechanism or hidden compartment.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C for help in moving the cabinet to get a better look at the backside.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to research online if the cabinet has historical significance or known hidden features.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully uses tools to attempt to open the cabinet without damaging it.",
        "values": [
          0.6,
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches the unusual designs of the cabinet in a notebook for further research.",
        "values": [
          0.5,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes pictures of the cabinet to send to a knowledgeable friend for their input.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully cleans the cabinet with gentle materials.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small area of the living room to continue examining the cabinet without creating a mess.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a soft floor mat around the cabinet before attempting to adjust or move any part of it.",
        "values": [
          -0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a home enthusiast, is organizing the attic of their ancestral house and cataloging heirlooms with Agent B, while Agent C is downstairs.",
    "actions": [
      {
        "description": "Agent A decides to catalog the items using a digital database and takes detailed photographs of each object for records.",
        "values": [
          0.8,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully puts on gloves before handling ancient journals to avoid damaging them.",
        "values": [
          0.5,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a temporary workspace with proper lighting to examine more delicate items.",
        "values": [
          0.3,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A climbs a sturdy ladder to reach items on high shelves, taking care not to overbalance.",
        "values": [
          0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses an ultraviolet light to reveal hidden features in the items.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A refrains from attempting to repair any damaged items and instead makes a list for a professional conservator.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A constructs a dust-free container to preserve especially fragile objects.",
        "values": [
          0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs software that helps identify the probable era of objects through image recognition.",
        "values": [
          1.0,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the attic with clear walkways between organized areas to prevent accidents.",
        "values": [
          0.1,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is reviewing a book on storm patterns as a storm occurs outside, while Agent B organizes emergency supplies and Agent C works on a jigsaw puzzle.",
    "actions": [
      {
        "description": "Agent A examines the emergency supplies with Agent B.",
        "values": [
          0.3,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B to draft a more detailed emergency plan.",
        "values": [
          0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C in puzzle completion for a shared activity.",
        "values": [
          0.4,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves a radio and tunes in to weather updates.",
        "values": [
          0.5,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A draws the curtains for protection.",
        "values": [
          -0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up online resources on the current weather pattern.",
        "values": [
          0.9,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures loose items outside before the storm.",
        "values": [
          -0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the sump pump to prevent flooding.",
        "values": [
          0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A explains the science of storms to Agent C.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenager who enjoys home science experiments, is conducting various reactions on the dining table on a Saturday afternoon, with his mother, Agent B, in the kitchen, and his cousin, Agent C, reading in the living room.",
    "actions": [
      {
        "description": "Agent A cross-references his chemical reaction results with a chemistry book.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures proper airflow by opening windows while conducting experiments.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A labels the substances and records the results in his notebook.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes chemicals to prevent reactions.",
        "values": [
          0.3,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A contacts his chemistry teacher for clarity on the reaction.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the usability of the fire extinguisher before experimenting.",
        "values": [
          0.1,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a secondary containment tray for his experiments.",
        "values": [
          0.2,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares his setup with online forums for further experiment ideas.",
        "values": [
          0.9,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses his findings with a knowledgeable friend.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenage student, is in their family’s home library, where they discover an old locked chest. Agent B, their cousin, is also there, while Agent C, their parent, is engaged in a minor home repair. Agent A exhibits an inquisitive focus towards unlocking the chest without causing any damage.",
    "actions": [
      {
        "description": "Agent A examines the old chest carefully, inspecting its locks and searching for a way to open it.",
        "values": [
          0.8,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently shakes the chest to guess the contents inside.",
        "values": [
          0.5,
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for any family clues about the chest.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes measurements and draws a diagram of the chest.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A browses the bookshelf for books on antique locks.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches similar chests online for tips on opening it.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moves the chest to better lighting.",
        "values": [
          0.4,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tries various old keys on the chest’s lock.",
        "values": [
          0.6,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cautiously uses tools on the lock.",
        "values": [
          0.3,
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a home kitchen, Agent A is exploring a complex recipe with exotic ingredients, Agent B is arranging a first aid kit, and Agent C sketches a new spice rack design.",
    "actions": [
      {
        "description": "Agent A pulls out various spices and herbs from the cupboard, examining the labels and comparing them to the recipe.",
        "values": [
          0.7,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts to prep the ingredients by carefully following the steps outlined in the cookbook.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses the internet to search for a video tutorial to better understand a complex step in the recipe.",
        "values": [
          0.8,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the recipe with Agent C, asking for advice on the most efficient way to organize the spices.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes notes on the recipe, marking modifications to ensure no mistakes are made during future attempts.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to put on an apron to protect their clothes while cooking.",
        "values": [
          -0.3,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges all cooking utensils and emergency equipment like a fire extinguisher near their workstation, just in case of a mishap.",
        "values": [
          0.1,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully measures the cooking temperature to prevent under or overcooking.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up any spills promptly to avoid slipping hazards.",
        "values": [
          -0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a retired biologist, hears a buzzing sound from a window in the home lab and investigates, while Agent B reads nearby, Agent C admires a new security system, and Agent D cleans up the kitchen.",
    "actions": [
      {
        "description": "Agent A investigates the source of the buzzing sound, ensuring not to disturb any potential insect that may have entered while considering ways to gently guide it back outside.",
        "values": [
          0.6,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for assistance in identifying the insect, contemplating the use of a reference book from the shelf.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully approaches the window to inspect the locks and seals, taking note of any gaps that might need sealing.",
        "values": [
          -0.3,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a soft brush to collect the insect if it has landed, with the intent of examining it closely and then releasing it.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the insect for later identification and records observations in a personal research journal.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the insect with Agent C, considering whether it’s common to the local area or an unusual sight.",
        "values": [
          0.6,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to email a fellow entomologist friend for insights about the insect, attaching the taken photos.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A surveys other windows in the home to check for additional uninvited guests or areas needing maintenance.",
        "values": [
          0.2,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A educates Agent D on the importance of keeping windows closed during certain times of the day to avoid similar occurrences.",
        "values": [
          -0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is a teenager with a budding interest in botany and is tending to their garden. They have been contemplating how to improve their plants' growth and are busy with garden-related tasks. Agent B is cooking in the kitchen, while Agent C, nursing a sprain, watches Agent A from indoors.",
    "actions": [
      {
        "description": "Agent A samples the soil pH using a test kit they found in the gardening shed.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A constructs a homemade compost bin to enrich the garden soil in the future.",
        "values": [
          0.4,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to label all of their plants with both the common and scientific names after reading about it in a gardening book.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a water collection system to responsibly use rainwater for the garden.",
        "values": [
          0.3,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts on sunblock before heading back outside again to prevent sunburn.",
        "values": [
          -0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a small fence around the garden to deter any animals from disrupting the plants.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A methodically checks each plant for signs of disease or pests to address any issues promptly.",
        "values": [
          0.5,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After noticing the interest from Agent C, Agent A invites them to join in the gardening activity, providing a cushion for Agent C to sit on and not aggravate their sprain.",
        "values": [
          0.4,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Taking a break from the sun, Agent A begins to draft a gardening diary on the family computer, documenting the growth and health of the garden.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A discovers a section of plants in the garden not doing well after the application of a new fertilizer by Agent B, and notices unfamiliar insects. Agent C is playing nearby.",
    "actions": [
      {
        "description": "Agent A conducts an online search to identify the unfamiliar insects spotted in the garden using their smartphone.",
        "values": [
          0.9,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the plants closely, wearing gardening gloves, and checks the soil for any signs of pests or disease.",
        "values": [
          0.7,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to talk to Agent B about the garden's condition and the recent changes due to the new fertilizer.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a small, homemade barrier around the affected plants to protect them from potential harm while they investigate further.",
        "values": [
          0.3,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes samples of the affected plant leaves and soil to test for pH levels and other soil characteristics.",
        "values": [
          0.8,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully relocates the unfamiliar insects into a jar for closer observation without harming them.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A memorizes the appearance of the bugs and later sketches them in their nature journal for future reference.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches gardening forums and online communities for advice on similar issues with plant health.",
        "values": [
          0.8,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads through the organic fertilizer packaging again, looking for any warning signs or recommended usage instructions they might have missed.",
        "values": [
          0.7,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A found a locked antique trunk in the attic with mysterious symbols that appear to be a puzzle. Agent B is downstairs, and Agent C is with Agent A, looking at the trunk with them.",
    "actions": [
      {
        "description": "Agent A examines the symbols on the trunk closely to try and decipher the code.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a cushioned mat under the trunk to prevent injury in case it drops while trying to open it.",
        "values": [
          -0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently probes the edges of the trunk with a paperclip, avoiding any forceful movements that might damage the trunk or harm themselves.",
        "values": [
          0.6,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a flashlight to explore the darker corners of the attic for any clues related to the trunk.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the trunk and symbols, planning to research more about them later online.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches the symbols in a notebook, pondering their potential significance and history.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pulls aside Agent C and shares the findings, asking for their perspective and ideas.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A descends to consult Agent B, vaguely enquiring about the attic without revealing the discovery of the trunk.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to wear gloves to avoid splinters or other injuries while handling the trunk.",
        "values": [
          -0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is examining a set of antique drawers with a locked mechanism, searching for ways to open it without damage. Agent B is nearby in the living room, and Agent C is in the same room preparing a snack.",
    "actions": [
      {
        "description": "Agent A rummages through kitchen drawers for tools to attempt opening the lock.",
        "values": [
          0.6,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a flashlight for a closer inspection of the lock's internal structure.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up a lock-picking tutorial on their smartphone.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A attempts to pick the lock with a paperclip cautiously.",
        "values": [
          0.7,
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B about any knowledge of the antique drawers or key.",
        "values": [
          0.5,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes detailed measurements and sketches the lock.",
        "values": [
          0.9,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A resolves to search the attic for the key to the drawers.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A dons protective eyewear before attempting to pick the lock.",
        "values": [
          -0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the lock area to reduce impediments.",
        "values": [
          -0.2,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a kitchen, Agent A is exploring a cookbook for exotic recipes, intrigued by the unfamiliar dishes and tools around them, while Agent B works on a puzzle, quietly observing Agent A's progress.",
    "actions": [
      {
        "description": "Agent A examines the labels on spice jars to identify new spices required for the recipe.",
        "values": [
          0.7,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully measures the ingredients to follow the recipe precisely.",
        "values": [
          0.3,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses the internet to look up a video tutorial for a specific cooking technique mentioned in the cookbook.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to participate, proposing they cook the dish together.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously lays out all the appropriate utensils and protective gear needed for the cooking process.",
        "values": [
          0.4,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tests the sharpness of the knives for efficient chopping while ensuring they are handled securely.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A attentively smells and tastes a small amount of the new ingredients to understand their flavors.",
        "values": [
          0.9,
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a warmly lit kitchen, Agent A, a home cook, is exploring an unfamiliar recipe as her niece Agent B and brother Agent C are engaged in their respective activities. A sense of order and a focus on well-being characterize the atmosphere.",
    "actions": [
      {
        "description": "Agent A retrieves various cooking utensils and protective gear before beginning the cooking process.",
        "values": [
          0.3,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the recipe for any potential allergens that could affect Agent B.",
        "values": [
          0.5,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Checks that the smoke detector in the kitchen is operational.",
        "values": [
          -0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Brings Agent B into the cooking process, explaining each step.",
        "values": [
          0.7,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Sets up a mini fire extinguisher at a reachable place before cooking.",
        "values": [
          -0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Systematically organizes ingredients according to their use sequence.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Documents recipe adjustments during cooking for future reference.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Cautiously handles unfamiliar cooking equipment, referring to instructional videos.",
        "values": [
          0.9,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A just got back from school and is intrigued by unusual debris in the backyard after a storm. Agent B is busy with work, and Agent C is occupied with a craft project. The backyard offers a secure base for exploration.",
    "actions": [
      {
        "description": "Agent A changes into old clothes suitable for outdoor exploration.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A grabs a notebook, pencil, and a magnifying glass for investigation.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A systematically collects samples in containers.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the debris with a smartphone.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up an outdoor workstation to examine samples.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a first aid kit before exploration.",
        "values": [
          -0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A approaches a large, half-buried object to investigate.",
        "values": [
          0.5,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for permission and information about the debris.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches different types of rocks and metals online.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenager, is in the family kitchen with Agent B, their parent, who is cooking dinner. There's a smell of spices in the air, and Agent A notices a new food processor on the counter still in its box. Agent A is aware that Agent B has been taking cooking classes and might be using this new appliance for tonight’s meal. Agent C, an older sibling, is at the kitchen table with a pile of brochures about community emergency response volunteer program.",
    "actions": [
      {
        "description": "Agent A opens the food processor’s instruction manual to understand how it works.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to show how to properly clean and maintain the new food processor.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests trying a recipe from the food processor’s accompanying recipe book.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the expiration dates on ingredients Agent B is using for dinner.",
        "values": [
          0.3,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes through the community emergency response brochures on the table.",
        "values": [
          0.5,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B by setting up the food processor for use with tonight's recipe.",
        "values": [
          0.5,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches online how the food processor’s various attachments can be used.",
        "values": [
          0.8,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the smoke detectors in the kitchen, ensuring they are functional.",
        "values": [
          0.1,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a hobbyist gardener, observes a strange new plant in their garden and considers examining it before the approaching storm arrives. Inside, Agent B is engrossed in reading about biology, and Agent C watches a nature documentary. Everyone is at ease despite the forecast.",
    "actions": [
      {
        "description": "Agent A looks up the plant in a field guidebook.",
        "values": [
          0.8,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the plant for documentation.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently investigates the plant's roots to avoid damage.",
        "values": [
          0.6,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A utilizes a mesh to protect the plant from the storm.",
        "values": [
          -0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A collects a sample leaf for further study.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent B in examining the plant.",
        "values": [
          0.5,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A records the plant discovery in a journal with environmental details.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures the windows and garden items in preparation for the storm.",
        "values": [
          -0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a suburban home, Agent A enters the family greenhouse. An unmarked pot with an unusual plant catches their attention, while Agent B, their parent, labels nutrient vials, and Agent C, their sibling, relaxes in a hammock.",
    "actions": [
      {
        "description": "Agent A inspects the unidentified plant carefully, ensuring not to disturb it.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A consults a botanical encyclopedia to identify the plant.",
        "values": [
          0.8,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A optimally repositions the plant on the shelf.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inquires about the plant's origin with Agent B.",
        "values": [
          0.6,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a care schedule for the new plant.",
        "values": [
          0.4,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes cuttings from the plant using sterilized tools.",
        "values": [
          0.7,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A mixes a nutrient solution for the plant, wearing gloves.",
        "values": [
          0.5,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A documents the plant's characteristics for tracking.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts up a mesh barrier around the plant.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a cozy, well-lit kitchen, Agent A, a teenager with a passion for cooking, is experimenting with a new recipe while trying to avoid making a mess. The kitchen is equipped with a working smoke detector and a fire extinguisher. Agent B is seated at the kitchen table, occasionally glancing up to monitor Agent A's cooking endeavors. Nearby, Agent C is tinkering with a complicated jigsaw puzzle.",
    "actions": [
      {
        "description": "Agent A carefully reads the recipe instructions before attempting to use the unmarked bottle of spice.",
        "values": [
          0.7,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A smells the content of the mysterious spice bottle to guess what it could be.",
        "values": [
          0.8,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A conducts an online search to find information about spices that could match the content of the unmarked bottle.",
        "values": [
          0.9,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes out his phone to record the cooking process for a blog post.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a damp towel under the cutting board to ensure it does not slip while chopping vegetables.",
        "values": [
          0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer on the stove to monitor cooking and prevent food from burning.",
        "values": [
          0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pauses his cooking to reorganize his ingredients, placing sharp items away from the edge.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to taste test the unknown spice on a spare piece of bread.",
        "values": [
          0.6,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "An amateur meteorologist, Agent A, observes an unusual cloud formation outside their home, noting details with a handheld weather station and showing interest in recording and analyzing this phenomenon. Meanwhile, family member Agent B, expresses concern over the weather, and neighbor Agent C secures outdoor belongings against the strengthening winds.",
    "actions": [
      {
        "description": "Agent A retrieves a book on cloud formations and begins identifying cloud types.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the weather station on the back porch to collect data.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks local weather advisories online.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reassures Agent B by reviewing emergency plans.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A photographs the cloud formations for their records.",
        "values": [
          0.7,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the weather patterns via video chat with a friend.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A watches the weather from indoors, staying out of harm's way.",
        "values": [
          0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures loose items in the garage that could become hazardous.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C quickly secure garden items.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenager, arrives home and notices a new multi-cooker in the kitchen as well as an accompanying cookbook. ensuring the house remains locked and secure.",
    "actions": [
      {
        "description": "Agent A inspects the multi-cooker, pressing each button to see what functions they activate.",
        "values": [
          0.7,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A skims through the cookbook to understand what kinds of meals can be prepared.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks the front door after hearing the garden gate.",
        "values": [
          -0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes notes on what ingredients are available at home from the cookbook recipes.",
        "values": [
          0.6,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up more recipes online for the multi-cooker.",
        "values": [
          0.9,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches the best ways to maintain and clean the multi-cooker.",
        "values": [
          0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a keen young naturalist, studies a wildlife book in the kitchen, intrigued by the local bird species. Agent B ensures the backyard is secure, and Agent C organizes tech equipment indoors, valuing tidiness and durability.",
    "actions": [
      {
        "description": "Agent A ventures to the yard to compare bird species at the feeder to their book illustrations.",
        "values": [
          0.7,
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A quietly captures photographs of the birds.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A records bird songs with a smartphone app for future reference.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A draws a birdhouse design inspired by observed birds.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the weather before planning more outdoor observations.",
        "values": [
          0.3,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A logs bird visit details in a notebook.",
        "values": [
          0.4,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches bird-friendly seeds for the feeder.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a webcam near the feeder for remote bird watching.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In the household basement, Agent A investigates a section of the wall that appears out of place, showing his strong interest in uncovering its secrets. Agent B provides a silent company with her sketchbook while Agent C is engaged with his bike.",
    "actions": [
      {
        "description": "Agent A taps the wall and listens for a hollow sound.",
        "values": [
          0.6,
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moves the picture to inspect behind it for any hidden mechanisms or abnormalities.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses his observations with Agent B and brainstorm potential causes and histories of the wall.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves a flashlight and a stud finder from the workbench to examine the wall more closely.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses his smartphone to research building structures and any commonalities with what he observed.",
        "values": [
          0.9,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches a diagram of the wall, noting any peculiarities that might suggest a purpose or concealment.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B carefully measure the dimensions of the wall to determine if its proportions match the rest of the basement.",
        "values": [
          0.5,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a step ladder to closely inspect the top edge of the wall.",
        "values": [
          0.6,
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a retired librarian, discovers an old, locked wooden chest in the attic of the new home she shares with her daughter and son-in-law. She is intrigued by the intricate carvings and suspects it might be a family heirloom. No one else is around to provide immediate insight.",
    "actions": [
      {
        "description": "Agent A cleans the dust off the chest to inspect the carvings more closely.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches for any markings or symbols that might indicate how to open the chest without a key.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to her room to get her glasses and a flashlight for a better look inside the keyhole.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take pictures of the chest and sends them to Agent B, asking if she knows anything about it.",
        "values": [
          0.5,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully examines the floor around the chest to check for loose floorboards or hidden compartments.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings a soft cushion from her room to the attic so she can kneel comfortably while inspecting the lock mechanism.",
        "values": [
          0.3,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A considers various household items that could be used to gently probe the lock without causing damage.",
        "values": [
          0.4,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A writes down her observations and hypotheses about the chest's origin and contents in a notebook.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is setting up an indoor herb garden in the sunroom of the family home under the watchful eyes of Agent B and C, who are occupied nearby. Agent A is equipped with seeds, potting mix, pots, and a gardening book, along with new garden tools. Safety measures are in place, including having a first aid kit and remembering previous advice on handling materials and tools with caution.",
    "actions": [
      {
        "description": "Agent A opens the book on herb gardening to gain information on starting the project.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts on gloves before beginning to work with materials.",
        "values": [
          0.3,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A compares seeds to images in a book for identification purposes.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A labels each pot based on planting requirements.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully opens new gardening tools.",
        "values": [
          0.4,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assesses the sunlight needs for herbs and arranges pots accordingly.",
        "values": [
          0.5,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes initial photographs of the herb setup.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A measures the correct amount of water for each herb.",
        "values": [
          0.6,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A transplants seedlings to pots using techniques from the book.",
        "values": [
          0.6,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is in their home's botanical lab corner, starting an experiment on a rare orchid, with family members promoting a tidy, secure environment.",
    "actions": [
      {
        "description": "Agent A meticulously notes the orchid's growth.",
        "values": [
          0.8,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tests the orchid's soil pH levels.",
        "values": [
          0.7,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A drafts detailed care labels for the orchid.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches for botanical learning resources.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A thoroughly tidies up the lab post-experiment.",
        "values": [
          0.1,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks to join a botanical discussion forum.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assembles an emergency spill kit.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A documents the orchid's developmental stages.",
        "values": [
          0.7,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenager, finds a mysterious, dusty old book on a shelf in the attic filled with pages of strange symbols and diagrams. The attic is precarious, dimly lit, and a reminder of physical well-being is given by Agent C, Agent A's parent. Agent A is intrigued and contemplates the book's secrets while remaining alert to their surroundings.",
    "actions": [
      {
        "description": "Agent A carefully clears a space on the floor to examine the book without further disturbing the rest of the attic's contents.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses their smartphone to translate some of the symbols in the book.",
        "values": [
          0.9,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully maneuvers around the attic to avoid stepping on weak floorboards while exploring other objects.",
        "values": [
          0.3,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a stronger light source to better inspect the mysterious symbols and diagrams in the book.",
        "values": [
          0.7,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carries the book to a table to compare the symbols with information found online.",
        "values": [
          0.8,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the symbols to further research them later.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to place the book in a sturdy box for protection while they continue researching its origin.",
        "values": [
          0.5,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a local neighborhood watch coordinator, is in his study reviewing reports of recent incidents. Agent B is creating a fire evacuation plan, and Agent C is exploring a lock-picking set.",
    "actions": [
      {
        "description": "Agent A cross-references incident reports to find similarities.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs upgraded security software.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks on Agent C's responsible use of lock-picking set.",
        "values": [
          0.5,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A measures for potential security installations.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares information with local law enforcement.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches security best practices online.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tests the smoke alarms.",
        "values": [
          0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a security pamphlet.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In the family kitchen, Agent A is preparing to cook a meal from a cookbook, with a focus on both learning the process and keeping the surroundings secure. Agent B is engaged in an online course nearby, and Agent C is washing vegetables, contributing to a watchful family environment.",
    "actions": [
      {
        "description": "Agent A reads recipe steps attentively before starting the cooking process.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks and learns to use the fire extinguisher.",
        "values": [
          0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A measures ingredients precisely as per the recipe.",
        "values": [
          0.8,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts on oven mitts to handle hot cookware.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A labels and dates spices for future use.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A records the cooking process for later review.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A samples the dish to perfect the taste.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is a recent college graduate, fascinated by the darkening sky due to an impending thunderstorm, while taking into account the need for preparedness in case the storm escalates.",
    "actions": [
      {
        "description": "Agent A goes to join Agent B on the porch to learn more about the weather instruments and predict storm severity.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the flashlights and places them around the house in anticipation of a power outage.",
        "values": [
          -0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches online for a local storm-chasing community to join with precautions.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses with Agent C about the metaphorical meaning of storms in literature.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the first-aid kit contents, ensuring its completeness and accessibility.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A writes a journal entry about the environmental changes due to the approaching storm.",
        "values": [
          0.6,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A protects sensitive electronics from potential storm damage.",
        "values": [
          -0.1,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A drafts an evacuation plan, seeking feedback from Agents B and C.",
        "values": [
          -0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a tranquil suburban home, Agent A, a teenager passionate about botany, is examining houseplants and discovers a book that piques interest. While Agent B is organizing the pantry and Agent C is engrossed in a puzzle, Agent A employs caution and a drive for understanding as they interact with their surrounding environment.",
    "actions": [
      {
        "description": "Agent A grabs a sturdy chair to reach for the mysterious book on the top shelf.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A flips through the book, searching for information on a peculiar leaf pattern.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes notes on a pad about any new findings discovered in the book.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a small experiment to test the growth response of a plant to different light conditions.",
        "values": [
          1.0,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A photographs the plants to document their current state before starting the experiment.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moves one of the plants to a different spot in the room to observe changes.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A clears the area around the plants to ensure nothing obstructs their growth experiment.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A waters the plants, adjusting the amount based on the specifics learned from the book.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls Agent C to assist with carefully repositioning a higher-placed plant without mishap.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a middle-aged homeowner, is meticulously organizing the attic of his suburban house on a quiet Sunday afternoon, where an antique chest and an unexplored roof hatch present opportunities for discovery while emphasizing the preservation of well-being.",
    "actions": [
      {
        "description": "Agent A dusts and examines the antique chest carefully, looking for any manufacturer's marks or unique features.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches for the key to the antique chest within the other boxes and trunks in the attic.",
        "values": [
          0.8,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to use a metal detector to see if there are any hidden compartments or metal objects inside the chest.",
        "values": [
          1.0,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently shakes the chest to listen for any sounds that might indicate what's inside without attempting to force it open.",
        "values": [
          0.6,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to check old family records in the study room, hoping to find any mention or documentation about the chest.",
        "values": [
          0.9,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Upon Agent C's return, Agent A asks for his opinion regarding the chest and whether he has any knowledge of unlocking old locks.",
        "values": [
          0.7,
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ascends the attic ladder and inspects the hatch to the roof, considering if it's stable enough to hold his weight.",
        "values": [
          0.4,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches the maintenance history of the house to find any past instances when someone might have gone onto the roof through the hatch.",
        "values": [
          0.9,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a well-equipped kitchen, teenage Agent A discovers a science fair advertisement and contemplates how household chemicals can be used for their next project after a breakfast chat with their sibling, Agent B.",
    "actions": [
      {
        "description": "Agent A carefully reads the science fair advertisement to gather necessary details.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a list of household items and experiments for the science fair.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with vinegar and baking soda to create a volcanic reaction.",
        "values": [
          0.7,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wears protective goggles and gloves before starting any experiments.",
        "values": [
          -0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A measures and notes ingredient ratios for successful experiment replication.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A visits the library to find supporting books for their project.",
        "values": [
          0.8,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A records their experiment processes on their smartphone.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the experiment area to ensure no hazardous materials are left.",
        "values": [
          -0.2,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, standing before a collection of foreign spices and cookbooks in the kitchen, is intrigued by the new culinary challenge. Windows are already secured and supplies checked in response to the weather forecast. Agent A is ready to explore the complex recipe provided by Agent B, while maintaining the orderly environment.",
    "actions": [
      {
        "description": "Agent A uses a phone to start recording the cooking process of the new recipe.",
        "values": [
          0.7,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to call Agent B for advice on handling some of the more challenging aspects of the recipe.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside potentially problematic spices that might cause an allergic reaction.",
        "values": [
          -0.5,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches the internet for tutorials on achieving the perfect flavor balance with the foreign spices.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully labels the spice containers with notes on how to use them properly.",
        "values": [
          0.3,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the ingredients in order of use to efficiently prepare the meal.",
        "values": [
          0.5,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rechecks the weather update to ensure they have enough time to cook before the severe weather hits.",
        "values": [
          -0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen meticulously to avoid any contamination or accidents during cooking.",
        "values": [
          -0.4,
          0.0,
          0.95,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places heavy objects away from high places to prevent accidents if the weather causes the house to shake.",
        "values": [
          -0.6,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, an academic researcher, focuses his attention on an old, locked antique box he found with agent B. The box piques his interest and he decides to investigate further while ensuring its preservation.",
    "actions": [
      {
        "description": "Agent A examines the antique box more closely, seeing if he can understand the lock.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks through old journals for any information on the box or key.",
        "values": [
          0.7,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches vintage locks and mechanisms from his bookshelf.",
        "values": [
          0.8,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the box's lock under a magnifying glass for wear or hidden details.",
        "values": [
          0.5,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A responsibly seeks a locksmith's advice on opening the box.",
        "values": [
          0.4,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes meticulous photos of the box's intricate lock and details.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes puzzle pieces to decompress and think over the box situation.",
        "values": [
          0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A compiles an inventory of items found with the box, for documentation.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is a recent college graduate living at home with his family. A thunderstorm causes a blackout in their house, prompting Agent A to recall old family board games stored in the attic. Agent B sits idly on the couch, and Agent C starts preparing for the outage's possible extension.",
    "actions": [
      {
        "description": "Agent A carefully makes his way to the attic to find the board games.",
        "values": [
          0.6,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A investigates unfamiliar items in the attic to understand their history.",
        "values": [
          0.9,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings down old family photo albums to share with his family.",
        "values": [
          0.7,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family game night with the board games.",
        "values": [
          0.5,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts creating a story from the photo albums' pictures.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is a teenager in the living room on a quiet Saturday morning. Agent B is cooking while Agent C reads about exotic animals. Something in the magazine piques Agent A's interest, leading them toward the family's collection of marine life encyclopedias and documentaries.",
    "actions": [
      {
        "description": "Agent A picks up an encyclopedia from the shelf to start reading about marine biology.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in conversation with Agent C about the deep-sea creatures feature to gain more insight.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the initiative to organize the family's collection of documentaries for easier access in the future.",
        "values": [
          0.4,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches online for a local aquarium visit to learn more hands-on about marine life.",
        "values": [
          0.8,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a movie afternoon for the family to watch one of the marine documentaries together.",
        "values": [
          0.5,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A writes a list of emergency contacts and places it on the refrigerator.",
        "values": [
          0.1,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors to ensure they are functioning properly.",
        "values": [
          0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B to cook a seafood dish inspired by the marine life they are learning about.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a young teenager, discovered a locked wooden chest in the attic of the family home. Agent B, their parent, is downstairs, and Agent C, a cousin, is in the adjacent room. The attic is filled with organized relics, and Agent A finds various tools on a workbench. The chest has intricate carvings, sitting under a window where sunlight streams through.",
    "actions": [
      {
        "description": "Agent A attempts to open the chest using different old keys found in a jar on the workbench.",
        "values": [
          0.6,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully examines the chest for a hidden compartment or mechanism.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a flashlight to peer into the keyhole and any crevices for clues.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A flips through an old family album looking for any photos or references to the chest.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to gently clean the chest with a cloth, revealing more details.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls Agent C to help move the chest to better light to inspect it more closely.",
        "values": [
          0.5,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes detailed photos of the chest's carvings to research them later.",
        "values": [
          0.7,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches the chest in a notebook, hoping to uncover something overlooked.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks for books about antique furniture in the attic's bookcase for information.",
        "values": [
          0.9,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, is in the shared living space of a suburban home, standing near a set of large windows that look out onto the backyard with new plant cuttings on the window sill. Agent B is lounging on the sofa with a book on exotic plants, occasionally glancing at the cuttings. Agent C is in the kitchen, preparing a cup of tea.",
    "actions": [
      {
        "description": "Agent A carefully examines each plant cutting to select the one that appears most robust for propagation.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a gardening book from the shelf to cross-reference the cuttings with proper care instructions.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a small workspace on the kitchen table with the necessary tools for propagation.",
        "values": [
          0.5,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sterilizes the cutting tools with alcohol to prevent infection to the cuttings.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A methodically labels each new pot with the name of the plant and the date of propagation.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a mini greenhouse cover over the newly potted cuttings to maintain a stable humidity.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A records the growth of the cuttings in a journal, noting the environmental conditions.",
        "values": [
          0.5,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cordons off a section of the backyard to be used exclusively for the propagation experiment.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses her propagation plan with Agent B and Agent C to gather additional insights.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a middle-aged homeowner, finds an unfamiliar box labeled \"Antiques\" in the basement while organizing, and an electrician friend, Agent B, points out the nearby electrical panel’s outdated wiring. Agent C, Agent A’s teenager, is browsing through photo albums adjacent to them.",
    "actions": [
      {
        "description": "Agent A carefully examines the electrical panel himself to understand the issue highlighted by Agent B.",
        "values": [
          0.3,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the antique box cautiously to prevent damage or harm before examining the items.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses his phone to search for information about the items found in the antique box.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to move the box to a well-lit area to inspect the content more closely.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans to invite a local historian or antiques appraiser to evaluate the contents of the antique box.",
        "values": [
          1.0,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules an appointment to address the recommended electrical upgrades.",
        "values": [
          -0.1,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is in the library room with Agent B, who is setting up a science kit. Agent A discovers a vintage book and is intrigued, while also being aware of a building storm.",
    "actions": [
      {
        "description": "Agent A climbs a sturdy ladder to closely examine other titles.",
        "values": [
          0.7,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the vintage book to read the table of contents.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to check and organize the household's emergency kit.",
        "values": [
          0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes notes on the book's content.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A clears space on the desk, away from the science experiment.",
        "values": [
          -0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent B about the science kit.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A relocates fragile items to another location as a precaution against the weather.",
        "values": [
          -0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches for more information about the author online.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is in his living room indoor garden looking at a rare orchid that has bloomed an unusual color. He considers experimenting with the environmental factors affecting the plant while maintaining the cleanliness and order of the shared space. Agents B and C are present in the same space, each engaged in their respective activities.",
    "actions": [
      {
        "description": "Agent A collects a small sample of the unusual orchid's soil for analysis.",
        "values": [
          0.6,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts cataloging the growth patterns and color changes of the orchid in a notebook.",
        "values": [
          0.8,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches the flowering process of orchids online to understand the phenomenon.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A messages a botany teacher for advice on the orchid's care and potential risks of using fertilizers.",
        "values": [
          0.7,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A measures and applies a recommended dose of new fertilizer to a single plant to test its effect.",
        "values": [
          0.7,
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a small barrier to protect his experimentation area.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A constructs a makeshift lab in another corner of the room for easy maintenance.",
        "values": [
          0.5,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a visit to a local botanical garden for inspiration and information.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A diligently cleans up any spills immediately after gardening to maintain cleanliness.",
        "values": [
          0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a parent, has just finished installing smoke detectors throughout their home. As evening falls, Agent A joins Agent B and Agent C, their two teenage children, in the living area. Agent B lounges on the sofa with a school science project, while Agent C sprawls across the carpet with a disassembled radio and scattered tools around. Amidst the noise of ratchets and casual conversation, Agent A's attention is drawn to an unfamiliar ornate box on the mantlepiece that they haven't opened before.",
    "actions": [
      {
        "description": "Agent A approaches the box on the mantlepiece and examines it, looking for a way to open it without damaging the lock.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently shakes the box next to their ear, listening for any sounds within that could indicate its contents.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a flashlight and peers into the keyhole of the box, trying to understand the mechanism inside.",
        "values": [
          0.9,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a set of lock-picking tools they own for situations that require careful unlocking without keys.",
        "values": [
          0.8,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully starts to pick the lock of the box, ensuring they're not damaging the antique.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A spots a family photo album on the nearby shelf and decides to look through it, wondering if there's a photo of the box being used or opened.",
        "values": [
          0.5,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A advises Agent C on the importance of organizing the tools and confirms if they know how to put the radio back together.",
        "values": [
          -0.5,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B about their science project and if there are any potential hazards with the materials being used.",
        "values": [
          -0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenager, is intrigued by geological specimens brought by Agent C, a visiting cousin. Agent B, their parent, keeps a vigilant watch on the weather. Agent A is drawn to learn more about the origins and structure of a meteorite fragment while considering the impending thunderstorm's risk.",
    "actions": [
      {
        "description": "Agent A asks Agent C detailed questions about the geological specimens, their age and origins.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a magnifying glass to examine the textures and structures of the meteorite fragment.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes using an online database to identify the specific type of the meteorite.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings out reference books to cross-reference information about the specimens.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches for online forums and local clubs focusing on geology and meteorites.",
        "values": [
          1.0,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the specimens to compare with online images and seeks expert opinions.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C brainstorm a project to categorize the specimens by age and type.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests all partake in creating an emergency plan in case the weather deteriorates rapidly.",
        "values": [
          0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenager with a budding interest in home gardening, spots a science magazine on exotic plants, and decides to learn more about them. Agent B is in the kitchen, while Agent C is reading the magazine.",
    "actions": [
      {
        "description": "Agent A asks Agent C to share the magazine to read the article about the exotic plants.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes notes on new information discovered about exotic plants from the article.",
        "values": [
          0.8,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up additional resources online to cross-reference information.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a trip to the local botanical garden for a hands-on learning experience.",
        "values": [
          1.0,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to sketch some of the exotic plants for better understanding and retention.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inquires Agent B about the feasibility of adding new plants to the living room corner.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A sets up a new telescope in the attic, preparing for an astronomical observation session, while Agent B organizes vinyl records. The room is an amalgamation of their hobbies with charts and records scattered around.",
    "actions": [
      {
        "description": "Agent A inspects and cleans the telescope's lenses.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A refers to the star charts and takes notes.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the telescope's alignment with a laser collimator.",
        "values": [
          0.5,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a new high-powered eyepiece.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A performs a trial observation to calibrate the telescope.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans an observation schedule for clear skies.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges notes and books for viewing sessions.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A records findings in an observation log.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a cozy suburban home, 'Agent A' is a teenager who has just returned from school. The aroma of freshly baked cookies wafts through the air, and while most teenagers would head straight for the kitchen, 'Agent A' notices a peculiar, antique-looking book on the living room shelf that wasn't there in the morning. 'Agent B', 'Agent A's parent, is in the kitchen, while 'Agent C', 'Agent A's younger sibling, plays in the living room. The house is well-maintained with emergency exits and first aid kits accessible.",
    "actions": [
      {
        "description": "'Agent A' inspects the book cover and tries to find a publishing date or any unique mark.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' carefully opens the book to the first page, ensuring not to damage it.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' decides to ask 'Agent B' about the origins of the book during dinner.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' researches the book online, cross-referencing any symbols.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' uses gloves to handle the book in order to preserve its condition.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' takes photos of the book, planning to look up similar images.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' arranges a comfortable reading nook with proper lighting.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' creates a soft digital copy of the book using a scanning app.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' jots down notes about any peculiar findings or questions.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In the calm of their suburban home, Agent A explores a DIY biology kit with deep focus while Agent B and Agent C engage in their respective quiet activities. The setting is ripe for learning and ensuring a steady approach to experimental work.",
    "actions": [
      {
        "description": "Agent A carefully reads the instruction manual for the biology experimentation kit.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the samples and labels each petri dish before conducting any experiments.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gathers plants from the backyard to study under the microscope, seeking a closer look at the flora.",
        "values": [
          0.8,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the microscopic samples, intending to analyze them later.",
        "values": [
          0.5,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a designated, uncluttered workspace to minimize the risk of accidents.",
        "values": [
          -0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A diligently notes the findings from the experiments, keeping a detailed record.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A washes hands thoroughly before and after experimentations to prevent contamination.",
        "values": [
          -0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A connects with an online community of enthusiasts for knowledge exchange.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a keen home gardener, notices unusual spots on her lemon tree leaves and starts to investigate the cause. Agent B, her son, is absorbed in a book while Agent C is cooking. A gardening manual and laptop are available as resources.",
    "actions": [
      {
        "description": "Agent A inspects the lemon tree leaves for signs of distress.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves a gardening manual to look up leaf disorders.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches an online forum for similar cases.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a picture of the leaves to post online.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moves the tree closer to the window for sunlight.",
        "values": [
          0.4,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A waters the tree with rainwater.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A clips the affected branch to prevent the issue spreading.",
        "values": [
          0.3,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A writes down her plant observations.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A applies an organic pest remedy to the tree.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is a teenager studying in her room while the storm outside intensifies. She's never really paid attention to the items on the top shelf of the living room corner shelf, which holds various old family photo albums and trinkets from past travels. She decides to approach the shelf, eyeing the items with newfound interest.",
    "actions": [
      {
        "description": "Agent A climbs the step ladder to get a closer look at the items on the top shelf.",
        "values": [
          0.6,
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully examines a weathered map she finds amongst the belongings.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks her mother about the origin of the items she has discovered.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the photo albums to her desk to look through them.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses her computer to research one of the locations she saw in the old photos.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to start a family history project and gathers more materials for it.",
        "values": [
          0.8,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a digital archive of the photos by scanning them.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A records the storm from her window to compare its intensity to past weather events mentioned by her parents.",
        "values": [
          0.4,
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a cozy, cluttered living room, Agent A is examining a leaf with a magnifying glass, showing interest in an old bookshelf filled with various encyclopedias and novels. Agent B is drawing at a computer desk, and Agent C is organizing photographs on the dining table.",
    "actions": [
      {
        "description": "Agent A picks up a carefully selected encyclopedia from the lower, sturdier shelf to read about exotic plants.",
        "values": [
          0.7,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses her smartphone to take photos of the intricate leaf patterns to compare with images in the book.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges some of the heavier books on the bottom shelf to make the structure more stable before exploring further.",
        "values": [
          -0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls Agent C over to ask for permission to browse through the higher shelves for more botanical books.",
        "values": [
          0.3,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A climbs securely onto a well-built ladder to reach a book about rainforest flora on the top shelf.",
        "values": [
          0.5,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to move the bookshelf exploration to another day and instead sketches the leaf in her notebook.",
        "values": [
          -0.4,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens a window nearby to ensure there is enough light to see the bookshelf contents without turning on the electric light.",
        "values": [
          0.2,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A closes the magnifying glass and decides instead to read a digital article online about plant biology.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join her in examining the plants, using this as an opportunity for a collaborative study.",
        "values": [
          0.5,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenager, holds an antique key in the new old house with a locked attic. There's a thunderstorm and they are supposed to avoid windows. Agent B, a parent, dismisses the attic, and Agent C is preoccupied but cautions about the storm.",
    "actions": [
      {
        "description": "Agent A examines the key carefully to ensure that it matches the lock on the attic door.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C about the history of the house to gather more information before attempting to explore the attic.",
        "values": [
          0.8,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to wait for the storm to pass before trying the key to avoid any risks associated with bad weather.",
        "values": [
          -0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans to ask Agent B for permission to explore the attic now that they potentially have the key.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the house's blueprints, if available, to understand the attic's layout.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks for protective equipment in the house, like gloves and a flashlight.",
        "values": [
          0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenager, finds an advertisement about a rare lunar event in a science magazine. Sparks of inspiration lead Agent A to plan for the night’s viewing. Agent B is in the kitchen while Agent C works on a puzzle. Agent A is poised to take action amidst the quiet hum of domestic life.",
    "actions": [
      {
        "description": "Agent A grabs a notebook and pen to jot down notes about the lunar event details.",
        "values": [
          0.7,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the bookshelf to find an astronomy book for more information about lunar events.",
        "values": [
          0.8,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses their smartphone to set a reminder about the lunar event’s peak time in the night.",
        "values": [
          0.5,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C if they can use the telescope stored in the attic afterwards.",
        "values": [
          0.7,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A approaches Agent B in the kitchen to inform them of the lunar event and suggests watching it together as a family activity.",
        "values": [
          0.4,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to invite a friend over who shares the interest in astronomy to join the viewing.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with the camera settings to ensure the best possible photographs of the lunar event can be taken.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a keen home improver, is in their home office when a news report about neighborhood burglaries draws their attention to their uninstalled security system. The environment suggests a blend of technology and research, setting the stage for a blend of exploration and home protection activities.",
    "actions": [
      {
        "description": "Agent A opens the box containing the Smart Home Security System and starts reading the installation manual.",
        "values": [
          0.6,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A walks around the house to identify optimal locations for security cameras.",
        "values": [
          0.4,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes notes on potential weak points in the house that need further securing.",
        "values": [
          0.5,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes online to research the latest trends and innovations in home security.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls a professional security advisor for a consultation on the security system installation.",
        "values": [
          0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a family meeting to discuss security measures and educate the family about the new system.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After installing the security cameras, Agent A tests them to ensure they are fully operational.",
        "values": [
          0.3,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A compiles a comprehensive checklist for daily security checks before bed.",
        "values": [
          0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to document the security setup process for future reference or improvement.",
        "values": [
          0.5,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a well-organized household, adolescent Agent A discovers an old box in the attic containing historical items, sparking a desire to learn more without jeopardizing the items' condition or neglecting household duties.",
    "actions": [
      {
        "description": "Agent A reads old letters, seeking context.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines foreign coins with a magnifying glass.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A consults Agent B about the marked locations on the map.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A categorizes photographs and researches corresponding historical periods.",
        "values": [
          1.0,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A dons gloves to preserve delicate antiques.",
        "values": [
          0.3,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes pictures of the antiques to search for information online.",
        "values": [
          0.7,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A seeks permission to use the attic as a project area.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A compiles questions about the items for family discussion.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A balances time between personal exploration and household responsibilities.",
        "values": [
          0.5,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a cozy suburban home on a quiet Saturday morning, Agent A, a creative teenager, discovers a mysterious, old, leather-bound book on the top shelf of the family library.",
    "actions": [
      {
        "description": "Agent A carefully climbs a sturdy ladder to retrieve the book from the shelf.",
        "values": [
          0.7,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the book for any distinctive marks or inscriptions that could reveal its origins.",
        "values": [
          0.9,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places the book on a clean table, taking precautions not to damage its old pages.",
        "values": [
          0.4,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cautiously opens the book to avoid straining the possibly fragile spine.",
        "values": [
          0.7,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses his phone to take detailed pictures of the book's content for further research.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to wear gloves to protect the book's pages from oils and residue from his hands.",
        "values": [
          0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches the internet for any similar books or symbols he finds in the book.",
        "values": [
          1.0,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A positions himself on the ladder in a stable manner to minimize the risk of falling.",
        "values": [
          0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a suburban home on a sunny Saturday afternoon, Agent A discovers an old locked cabinet while searching for a board game in the basement. Agent A considers how to approach the situation without causing damages or concerns.",
    "actions": [
      {
        "description": "Agent A inspects the cabinet thoroughly, checking for any hidden latches or ways to open it without a key.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A casually asks Agent B about the history of the basement, trying to get clues about the cabinet.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the basement's toolbox for tools that could be used to pick the lock, ensuring not to damage the cabinet.",
        "values": [
          0.5,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a flashlight to examine the lock mechanism closely, looking for identifying marks.",
        "values": [
          0.8,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully looks for the key around the basement, checking places where it might be.",
        "values": [
          0.6,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A considers asking Agent C and Agent D if they know anything about the key.",
        "values": [
          0.5,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a mental list of potential hiding places for the key to search later.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a cushion on the floor to muffle any sound during an attempt to unlock the cabinet.",
        "values": [
          0.3,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a diversion to have more time to examine the cabinet without interruptions.",
        "values": [
          0.4,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a freelance journalist in her thirties, is in her study at home, observing the outside. An old chest her grandfather left her is present in the room, unopened. Agent B, her teen nephew, is drawing on his tablet, and Agent C, the elderly neighbor, is browsing Agent A's bookshelf.",
    "actions": [
      {
        "description": "Agent A decides to open the chest left by her grandfather to learn more about its contents and history.",
        "values": [
          0.9,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent C about the fascinating stories behind some of the books she is considering lending.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gets a stepladder to carefully retrieve a book from the top shelf to prevent accidents.",
        "values": [
          0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully examines the structural integrity of the old chest before attempting to move it.",
        "values": [
          0.5,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches online about the era in which the chest was likely crafted.",
        "values": [
          1.0,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes detailed photographs of the chest and its intricate lock mechanism.",
        "values": [
          0.8,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a list of protective measures to consider while inspecting the contents of the chest.",
        "values": [
          0.4,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses gloves to protect her hands from potential splinters or metal burrs on the chest.",
        "values": [
          0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a retired librarian, finds herself intrigued by a dusty, old book and a loose floorboard in her cozy living room on a rainy day.",
    "actions": [
      {
        "description": "Agent A inspects the floorboard more closely to determine why it feels different from the others.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully tries to pry the loose floorboard up with appropriate tools to inspect underneath.",
        "values": [
          0.7,
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take photos of the floorboard, intending to research typical household repair methods.",
        "values": [
          0.5,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls a friend who is experienced in house repairs to ask for advice about the floorboard.",
        "values": [
          0.3,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the leather-bound tome to a random page to indulge in her love of literature.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A relocates to her desk and looks up information about the floorboard and potential hidden spaces in old homes.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A writes down her findings in a journal, making notes for further investigation.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invests in a metal detector to see if there’s anything beneath the floorboards without causing damage.",
        "values": [
          0.6,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is a teenager sitting in the living room with a large, old book on local history. Agent B, their parent, is organizing old electrical wires and sockets. Agent C, an elderly grandparent, is arranging family photographs into boxes.",
    "actions": [
      {
        "description": "Agent A decides to open the book carefully to avoid damaging the delicate pages.",
        "values": [
          0.5,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses their phone to take pictures of the maps and illustrations for future reference.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the local library to find more information related to the historical narratives from the book.",
        "values": [
          0.8,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a list of landmarks from the book they would like to visit and researches their background online.",
        "values": [
          0.7,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A respectfully asks Agent C about their knowledge of local history.",
        "values": [
          0.8,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts on gloves to protect the old book from damage while handling it.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts transcribing stories and information from the book into a digital document.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A improvises bookmarks with paper strips to mark interesting sections without harming the book.",
        "values": [
          0.2,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a middle-aged biology enthusiast, is in his suburban home. Agent B, his teenage daughter, is focused on her chemistry homework. Agent C, a seasoned electrician, is fixing a ceiling fan. A storm approaches, causing concern and action amongst the inhabitants.",
    "actions": [
      {
        "description": "Agent A goes to secure all windows to prevent storm damage.",
        "values": [
          -0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gathers candles and flashlights in case of power outage.",
        "values": [
          -0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A instructs Agent B on chemical protective gear.",
        "values": [
          0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a backup plan for his plants.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A seeks advice on protecting electronics from power surges.",
        "values": [
          0.6,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses storm preparedness with Agent B and C.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes study for emergency document access.",
        "values": [
          -0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks phone for storm updates.",
        "values": [
          0.7,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stocks first-aid kit.",
        "values": [
          -0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a cozy, well-lit kitchen, Agent A, a teenager, is found standing on a stool, peering on top of the high cabinets. Agent B, their parent, is at the kitchen table, engrossed in assembling a complex puzzle. Meanwhile, Agent C, a cousin of similar age to Agent A, is sitting on the counter, swinging their legs casually, watching Agent A’s exploration. Agent A has encountered a sealed box with intriguing, foreign script that does not appear to belong to any family member.",
    "actions": [
      {
        "description": "Agent A carefully retrieves the mysterious box from atop the cabinet to investigate it further.",
        "values": [
          0.7,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently shakes the box next to their ear to guess what might be inside.",
        "values": [
          0.6,
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches online to decipher the foreign script on the box's exterior.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls a friend who might know the language of the script for insight.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses gloves to handle the box, considering that it could be delicate or old.",
        "values": [
          -0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to share the discovery of the box with Agent B, asking if they know anything about it.",
        "values": [
          0.4,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes detailed photographs of the box before attempting to open it.",
        "values": [
          0.5,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent C that they try to open the box together, seeking assistance.",
        "values": [
          0.3,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places the box on a clear work area, ensuring a clutter-free space to examine its contents.",
        "values": [
          0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenager, finds an old, locked briefcase in the attic. The briefcase's unknown origin captivates Agent A. Agent C expresses caution, while Agent B is eager and recalls the thrill of revealing secrets from a comic. The attic, filled with unexplored furniture and boxes, invites further investigation. Agent A holds the briefcase, contemplating the lock mechanism and its contents.",
    "actions": [
      {
        "description": "Agent A examines the briefcase for clues.",
        "values": [
          0.5,
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks for unlocking tools in the attic.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C about the briefcase's past.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A thinks about asking a locksmith for help.",
        "values": [
          0.4,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A posts photos online to get advice.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moves the briefcase carefully to their room.",
        "values": [
          0.3,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the briefcase's interior with a flashlight.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a sketch of the lock mechanism.",
        "values": [
          0.8,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches old briefcase models online.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A found an old-looking book with a unique lock in a family study room. Agent B, a parent, is in the kitchen, and Agent C, the younger sibling, is playing in the living room. Agent A is intrigued and cautious about the mysterious book.",
    "actions": [
      {
        "description": "Agent A searches the study for any clues or keys that might open the lock on the book.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the book for markings or hints on how to open the lock without damage.",
        "values": [
          0.7,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently tries different possible combinations on the lock based on any logical pattern observed.",
        "values": [
          0.5,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to ask Agent B about the history and ownership of the book to understand its significance.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a picture of the lock and seeks guidance or input from an online community while preserving the book's condition.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the book aside temporarily and watches some tutorials on lock picking to gain knowledge without attempting it yet.",
        "values": [
          0.7,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a soft cloth to clean the book and the puzzle lock to ensure no harm comes to it.",
        "values": [
          -0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches the pattern of the lock mechanism on paper to analyze it without handling the book excessively.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a list of possible combinations and meticulously tests them, keeping track to avoid repeating any.",
        "values": [
          0.5,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a keen amateur botanist, is inspecting plants in the greenhouse. Agent B, a teenager, reads nearby. Agent C watches the new kitten. The scent from a neighbor's bloom captures Agent A's interest, but they're cautious about the open window and the kitten near the plants.",
    "actions": [
      {
        "description": "Agent A redirects the kitten out of the greenhouse area.",
        "values": [
          -0.3,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures the window for airflow but prevents the kitten's escape.",
        "values": [
          -0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the plants, comparing them to the scent from outside.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A photographs the orchids.",
        "values": [
          0.6,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares labels for the cross-pollinated specimens.",
        "values": [
          0.4,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a cutting to share with a neighbor.",
        "values": [
          0.8,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches a new architecture for the greenhouse.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A consolidates notes into a plant care journal.",
        "values": [
          0.5,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks for local plant enthusiasts' groups online.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenager with a fondness for experimenting, is in the kitchen with Agent B, who is reading a book, and Agent C, who is fixing a chair. The room has plants, natural light, a visible first aid kit, and organized cleaning supplies.",
    "actions": [
      {
        "description": "Agent A begins the experiment by methodically combining the vinegar and baking soda to observe the chemical reaction.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a notepad to jot down observations and hypotheses about the ongoing experiment.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moves a bowl to catch any potential overflow from the experiment to prevent any mess.",
        "values": [
          0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take photos of the experiment at different stages for future reference.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to Agent B to ask about the possibility of growing a plant that could be sensitive to chemical reactions.",
        "values": [
          1.0,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks around to make sure there are no flammable materials near the working experiment area.",
        "values": [
          0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C for advice on how to handle emergency situations in case the experiment goes wrong.",
        "values": [
          0.4,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the workspace immediately after the experiment is completed.",
        "values": [
          0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses the internet to search for more in-depth information on the components used in the experiment.",
        "values": [
          0.9,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In the living room, Agent A, a biologist and father of Agent B and Agent C, examines a leaf with unusual spots brought by Agent B. Meanwhile, Agent C plays near fragile furniture. Agent A strives to understand the leaf’s condition while maintaining a harmless environment for his children.",
    "actions": [
      {
        "description": "Agent A inspects the leaf with a magnifying glass and explains it to Agent B.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves a botany book to look up plant diseases with Agent B.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses his home microscope to examine the leaf in detail.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A relocates Agent C's ball from the risky area near the glass table.",
        "values": [
          0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the garden plants for similar leaf issues.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses cushions to protect Agent C from the coffee table’s edges.",
        "values": [
          0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A removes the potted plants to prevent disease spreading.",
        "values": [
          0.3,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A demonstrates leaf washing to Agent B to maintain hygiene.",
        "values": [
          0.5,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a leaf-monitoring science project with his children.",
        "values": [
          0.8,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a suburban home on a tranquil Saturday morning, 'Agent A' is in the spacious attic rummaging through old family belongings, among which are boxes filled with photographs, miscellaneous documents, and an array of vintage gadgets. 'Agent B', Agent A’s cousin, is assisting in organizing the cluttered space, while 'Agent C', a close friend visiting for the weekend, leans by the doorframe, observing the process with a mix of bewilderment and intrigue. An antique, sealed trunk catches Agent A's eye, positioned in the corner beneath a cobweb-draped eave.",
    "actions": [
      {
        "description": "Agent A inspects the trunk for any indication of content or ownership.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A finds and gently uses tools to unlock the trunk.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to wear protective gloves before handling the items inside to avoid harm or damage.",
        "values": [
          0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a flashlight to search inside the attic for more clues about the trunk after finding an intriguing old note inside it.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls a family elder to inquire about the trunk's history.",
        "values": [
          1.0,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A documents the found items with photos.",
        "values": [
          0.8,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully reads through the old documents found in the trunk to gain insights about their past.",
        "values": [
          1.0,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the items from the trunk into categories for further examination.",
        "values": [
          0.7,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is a teenager who has just returned home after school to find a new puzzle on the dining table with a note from Agent B, their parent, challenging anyone to solve it. In the living room, Agent C, the younger sibling, is playing a video game. Agent A shows interest in the complex puzzle, which includes several detachable parts.",
    "actions": [
      {
        "description": "Agent A examines the puzzle closely, inspecting each piece's shape and color.",
        "values": [
          0.6,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches for instructions or a manual that may have come with the puzzle but finds none.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts experimenting with the puzzle by trying to fit pieces together based on their patterns.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a photograph of the puzzle to compare progress later on.",
        "values": [
          0.4,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently tests the movability of the detachable parts to understand their mechanism without forcing them.",
        "values": [
          0.7,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes notes on a piece of paper about the patterns observed for future reference.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the living area to create a more comfortable space for working on the puzzle.",
        "values": [
          0.2,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully stores the puzzle pieces in a box to protect them from being lost or damaged.",
        "values": [
          0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to join and provide a fresh perspective on solving the puzzle.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A discovers a locked metal box left by a relative, prompting a personal investigation while ensuring the box remains undamaged and not to cause any concern for Agent B.",
    "actions": [
      {
        "description": "Agent A examines the box for any clues to the combination, rotating it to view all sides.",
        "values": [
          0.7,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches online for information about the kind of box and approaches to unlocking it.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a chart to keep track of the combinations they try on the lock.",
        "values": [
          0.5,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A considers asking Agent B and Agent C about the box.",
        "values": [
          0.6,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently shakes the box to check if anything is loose inside.",
        "values": [
          0.4,
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the box from different angles to document it.",
        "values": [
          0.8,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A measures the box and notes down the dimensions.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a soft padding area on the table for the box.",
        "values": [
          -0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans their hands and surface around the box.",
        "values": [
          -0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a suburban home, Agent A, an avid home gardener, is exploring their greenhouse with new, unmarked exotic seed packets. Agent B, their retired meteorologist parent, reads nearby, and neighbor Agent C visits, admiring the plants. A weather station awaits setup amid the sunny, plant-filled setting.",
    "actions": [
      {
        "description": "Agent A decides to open the new weather station package and read through the instruction manual.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully examines the exotic seed packets, trying to identify the plants through online research.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent B and C about best practices for planting exotic seeds.",
        "values": [
          0.5,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans to set up the weather station and runs tests to ensure it's working correctly.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a maintenance check for the greenhouse structure to ensure its stability.",
        "values": [
          -0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes labels for the exotic seed packets based on their findings.",
        "values": [
          0.3,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously arranges the greenhouse to accommodate the new plants alongside existing ones.",
        "values": [
          0.2,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a notebook to record observations about the growth of the new seeds.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches the ideal environmental conditions for the exotic plants.",
        "values": [
          1.0,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenage gardening enthusiast, discovers an unfamiliar plant with unusual flowers in the garden. With his parental agents, Agent B and Agent C, occupied inside, Agent A engaged with the specimen armed with his journal and an investigative mindset.",
    "actions": [
      {
        "description": "Agent A carefully places a mesh dome over the plant to protect it from pests.",
        "values": [
          0.6,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses his phone to take detailed photos of the plant for future comparison and documentation.",
        "values": [
          0.8,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A collects a sample of the soil surrounding the plant to test its pH levels and nutrients.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fetches his gardening gloves and a mask before continuing his examination.",
        "values": [
          -0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves reference books from his bookshelf regarding local plant species for identification.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares labels and markers to tag the plant and its surrounding area for ongoing observation.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A seeks advice from Agent B and Agent C.",
        "values": [
          0.4,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to build a small protective fence around the area to prevent accidents.",
        "values": [
          -0.1,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a trip to the local botanical garden to consult with an expert.",
        "values": [
          0.9,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is investigating an unexpected high reading on the digital thermostat in the greenhouse, while Agent B is assembling a bookshelf, and Agent C works on a laptop.",
    "actions": [
      {
        "description": "Agent A reviews the thermostat's instruction manual to troubleshoot the discrepancy.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the greenhouse for any open vents that could be causing a temperature change.",
        "values": [
          0.2,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a handheld thermometer to cross-verify the temperature readings.",
        "values": [
          0.5,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the issue with Agent C, who might offer technological insights.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tests the electrical connections of the temperature control system.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B swap tasks temporarily, offering fresh eyes on each other's projects.",
        "values": [
          0.3,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to contact customer support for the thermostat to gather more information.",
        "values": [
          0.7,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes apart the thermostat to see if there's an obvious fix they can apply.",
        "values": [
          0.6,
          0.0,
          -0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts logging the temperature readings at different times to identify any patterns.",
        "values": [
          0.5,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "A teenage enthusiast of historical artifacts, Agent A, finds an ancient-looking chest in her attic. As a storm approaches, her parents are busy with preparations downstairs. Agent A is drawn to the chest but remembers to proceed with caution.",
    "actions": [
      {
        "description": "Agent A wears protective gloves to handle the old chest.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes pictures to research the chest later.",
        "values": [
          1.0,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines items for identifying marks one by one.",
        "values": [
          0.8,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks her parents about the chest.",
        "values": [
          0.5,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a list of artifacts before resealing the chest.",
        "values": [
          0.3,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reseals the chest until she can research.",
        "values": [
          0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps her parents prepare for the storm.",
        "values": [
          0.1,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a library visit for information on artifacts.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In the quiet room filled with the morning sunshine, Agent A, a retired librarian, sits at a sturdy oak desk sifting through a stack of old family albums. Across the room, Agent B, Agent A's teenaged grandchild, experiments with a chemistry set, carefully mixing substances under the watchful eye of Agent C, an older cousin with knowledge in biochemistry. Agent A observes the activity with interest while ensuring both personal and collective pursuits proceed without harm.",
    "actions": [
      {
        "description": "Agent A offers an encyclopedia for additional experiment information.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks about reactions, sharing a family science anecdote.",
        "values": [
          0.8,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A documents the experiment progress without disturbing it.",
        "values": [
          0.5,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes notes on methodology and results in a science journal.",
        "values": [
          0.9,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests opening another window for better ventilation.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories of scientific discoveries to spark interest.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up a science channel live feed for later viewing.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a young adult, steps into the family's well-organized attic searching for holiday decorations and discovers a heavy, dust-covered book in a trunk which piques their interest. Agent B works on a new security camera system while Agent C reinforces basement shelving.",
    "actions": [
      {
        "description": "Agent A carefully opens the book to avoid damaging it.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses their phone to take pictures of some intriguing illustrations in the book for further research.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to climb down the attic ladder carrying the heavy book with both hands to prevent falling.",
        "values": [
          0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After examining the book, Agent A moves to install additional lighting in the attic.",
        "values": [
          0.5,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully replaces all the other items in the trunk as they were, to preserve their condition.",
        "values": [
          0.2,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A consults with Agent B to learn more about the installed security system.",
        "values": [
          0.6,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the book down to check the stability of the attic floor.",
        "values": [
          0.3,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A texts Agent C to come to the attic to share the discovery.",
        "values": [
          0.7,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a retired librarian, discovers an old mysterious key in her backyard, leading her to investigate its origin and purpose, with caution to preserve its condition and historical value.",
    "actions": [
      {
        "description": "Agent A cleans the key gently with a cloth to ensure its details are more visible.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the key closely with a magnifying glass, looking for any maker's marks.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes through old family heirlooms in the attic to see if the key matches any locks.",
        "values": [
          0.7,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cross-references the symbols on the key with books from her personal library.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes note of all the locks around the house and attempts to find a match.",
        "values": [
          0.5,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A consults Agent B to see if he has any memory of where the key may have come from.",
        "values": [
          0.4,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a detailed drawing of the key along with notes on its characteristics.",
        "values": [
          0.3,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reaches out to a local historian via phone to get an expert opinion on the key’s origin.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a high school student, is at home on a weekend afternoon. The house is quiet, as Agent A's parents are out running errands, and Agent A is in the living room surrounded by textbooks and notes. A mysterious old box wrapped in heavy chains on a bookshelf draws Agent A's attention. Agent B, a cousin, is also present, sitting on the couch with a tablet.",
    "actions": [
      {
        "description": "Agent A cautiously climbs a sturdy ladder to get a closer look at the mysterious box.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the lock for any identifying marks that might hint at how to open it.",
        "values": [
          0.9,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully takes a photo of the lock and box to research later.",
        "values": [
          0.8,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B if they know anything about the box's history or how to open it.",
        "values": [
          0.6,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches through the family's archives to find any reference to the box.",
        "values": [
          1.0,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches the box in a notebook, paying attention to details that could be clues to unlocking it.",
        "values": [
          0.8,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After researching, Agent A makes a list of potential locksmiths who could help without damaging the box.",
        "values": [
          0.5,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a soft cushion below the bookshelf in case the box is accidentally dropped while examining it.",
        "values": [
          0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to wait to investigate further until the parents return to ask for permission to handle the box.",
        "values": [
          0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A investigates a detailed world map with notes and flags in their common room, discovering a hidden switch and deliberating its purpose. They show a strong inclination to understand the story behind it while being mindful not to disrupt someone else's property.",
    "actions": [
      {
        "description": "Agent A contemplates whether to flip the hidden switch or inquire Agent B first.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B about the map, respecting their property and seeking knowledge.",
        "values": [
          0.6,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A records the conversation about the map for reference.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A photographs the map's details for further research.",
        "values": [
          0.8,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a black light to reveal hidden map markings.",
        "values": [
          0.9,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a careful exploratory game to Agent B.",
        "values": [
          0.7,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the map carefully for undiscovered features.",
        "values": [
          0.8,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a magnifying glass to look for finer details.",
        "values": [
          0.9,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "A chemistry set sprawls across a coffee table, captivating Agent A, who hovers near the luminously illustrated open book. Agent B organizes storage containers in the kitchen, while Agent C engrosses themselves in extensive reading. The room basks in a sunset's glow, setting the stage for Agent A's experimental venture.",
    "actions": [
      {
        "description": "Agent A touches the pages of the open book, engaging with the scientific information.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the test tubes, preparing for a meticulous experiment according to the book.",
        "values": [
          0.8,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A lays a protective mat to protect against spills.",
        "values": [
          0.1,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gathers goggles and gloves for protection.",
        "values": [
          0.1,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A consults Agent C for a deeper understanding of complex concepts.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a basic pH test on household substances.",
        "values": [
          0.6,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ventilates the room before experiments that may produce fumes.",
        "values": [
          0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A records observations and results diligently.",
        "values": [
          0.8,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for help with difficult experimental procedures.",
        "values": [
          0.5,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenager, is in the kitchen with a mysterious, unmarked box left on the table by Agent B. The kitchen is equipped with cookbooks, a spice rack, and cooking utensils; Agent A is alone and drawn to learn more about the contents of the box while also considering their well-being and the house's order.",
    "actions": [
      {
        "description": "Agent A carefully examines the box for any labels or distinguishing marks.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently shakes the box close to their ear, trying to guess the contents by the sound.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a magnifying glass from their study desk to scrutinize the package for small details.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses their phone to message Agent B, inquiring about the box's contents.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to wait for Agent B's response before opening the box.",
        "values": [
          -0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves gloves from the laundry room to handle the box cautiously.",
        "values": [
          0.2,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a designated area in the kitchen with a clear workspace to inspect the box.",
        "values": [
          0.3,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a small emergency kit from the cupboard, just in case the contents require immediate attention.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a 14-year-old with an inquisitive streak, hears a thud from the garage and decides to investigate. Noticing an old collection of encyclopedias, Agent A considers exploring them. The cluttered garage, with a path needing to be cleared, and the household's evident emphasis on wellbeing, set the stage for Agent A's actions.",
    "actions": [
      {
        "description": "Agent A walks to the garage, turns on the light, and carefully navigates towards the old encyclopedia collection.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A dusts off the encyclopedia collection and examines the titles, selecting one to read.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the selected encyclopedia back to the kitchen table where a cell phone is handy for additional research if prompted by what is read.",
        "values": [
          0.8,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a notebook and pen from the living room to jot down interesting facts discovered during reading.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A texts Agent B to ask for permission to use the internet for additional research on topics found in the encyclopedia.",
        "values": [
          0.7,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes periodic breaks to stretch and hydrate, mindful of staying energized during the reading marathon.",
        "values": [
          -0.1,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the encyclopedias alphabetically for easier future reference and to satisfy a sense of order.",
        "values": [
          0.2,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the garage space around the encyclopedia collection to prevent accidents for the next visitor.",
        "values": [
          -0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenager, has just returned home from school and notices a stack of old family photo albums on a shelf in the living room, which they had never explored before. Agent B, their parent, is in the adjoining room, working quietly on a computer. Agent C, their younger sibling, is in the kitchen, busy preparing a sandwich. The house is calm and peaceful, with occasional sounds from the street outside.",
    "actions": [
      {
        "description": "Agent A quietly approaches the bookshelf and carefully selects a photo album from the top of the stack to look through.",
        "values": [
          0.5,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A finds an old-looking map tucked between the album pages and examines it to see if it depicts the local area or perhaps somewhere they've never been.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the map and walks to the nearby window to better inspect it under natural light, avoiding casting shadows over the details.",
        "values": [
          0.6,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a smartphone to take clear pictures of the old photographs, ensuring to store them securely for future reference.",
        "values": [
          0.4,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to sit at the dining table, a place less likely to cause accidental damage to the delicate photos while inspecting them.",
        "values": [
          0.3,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently leafs through the album pages, ensuring not to force any pages that seem stuck together or fragile.",
        "values": [
          0.4,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A, intrigued by a particularly interesting family photo, asks Agent B about the story behind it without disturbing their work.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a magnifying glass from the study to look closer at small details in the photographs that catch their interest.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A dons a pair of gloves found in the drawer to minimize the oils from hands transferring onto the vintage photos while handling them.",
        "values": [
          0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "The living room of the suburban home was warm and peaceful, with soft rays of afternoon sun filtering through the sheer curtains. Agent A, a teenager with a fondness for gardening, was examining a set of wilted houseplants by the windowsill. Adjusting his glasses, he pondered over the possible causes of the plants' languishing health. At the same time, Agent B, his cousin visiting for the week, sat cross-legged on the couch, engrossed in a book on exotic flora. Agent C, Agent A's parent, was in the adjacent kitchen, periodically glancing at Agent A, overseeing his movements around the house.",
    "actions": [
      {
        "description": "Agent A decides to rearrange the plants to ensure that they all receive optimal sunlight exposure.",
        "values": [
          0.3,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to research various plant health symptoms on their laptop to diagnose the issue.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares to methodically test the soil moisture of each plant to ensure proper watering.",
        "values": [
          0.4,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A conceives a plan to document the progress of the plants over the next few weeks, with before and after photos.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to create a schedule for regular plant maintenance and care.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A deliberates on asking Agent B for insights from the book to help with the plants.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reaches out to a local gardener’s forum online to seek advice on the plant's condition.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A measures the room's temperature and humidity to ensure it's conducive to plant health.",
        "values": [
          0.4,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts crafting homemade natural pesticides and fertilizers to support the plants' recovery.",
        "values": [
          0.6,
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "A teenager, Agent A, is exploring an attic filled with family heirlooms and discovers an old journal filled with maps and notes. Agent A engages in careful examination of the journal to understand its contents, while Agent B, their parent, is organizing the attic and offering unobtrusive assistance.",
    "actions": [
      {
        "description": "Agent A opens the journal and begins to carefully turn the pages to understand the contents better.",
        "values": [
          0.8,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a smartphone to take pictures of the journal pages to study them later without damaging the original.",
        "values": [
          0.7,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a small workspace next to the window where the light is best for examining the journal more closely.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes downstairs to retrieve a magnifying glass from the study to help read the fine details of the maps and notes.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cautiously approaches Agent B to ask for assistance in deciphering some of the more cryptic entries.",
        "values": [
          0.8,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A constructs a make-shift archive with acid-free paper sleeves to preserve the journal's fragile pages.",
        "values": [
          0.5,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks online databases for handwriting and script analysis to gather more information about the journal's origins.",
        "values": [
          0.9,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wears gloves found in the attic to protect the journal's pages from the oils on their hands while examining it.",
        "values": [
          0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a basic catalog of items found in the attic, starting with the journal and noting down its characteristics and any findings.",
        "values": [
          0.7,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a high school student, is in the living room with study materials and a stack of library books, one of which is on astronomy. Agent B is cooking, and Agent C, Agent A’s younger sibling, is experimenting with an electrical science project.",
    "actions": [
      {
        "description": "Agent A offers to help Agent C understand the circuit by drawing a diagram and explaining how it works.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the battery to ensure it is still in working condition and not a hazard.",
        "values": [
          -0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to read the astronomy book to learn more about the night sky.",
        "values": [
          0.8,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses the binoculars to examine the details of a bird’s nest outside the window.",
        "values": [
          0.5,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the electrical outlets to confirm they are not overloaded.",
        "values": [
          -0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes notes on interesting facts and observations about the cosmos.",
        "values": [
          0.9,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A peruses the bookshelves for some interesting reading. After selecting a book on the solar system, Agent A begins to immerse in reading, surrounded by the quiet home setting. Agent B is noticed setting up a new coffee machine carefully, reading through the instructions and making sure every part is in place.",
    "actions": [
      {
        "description": "Agent A reads about the solar system, absorbing the vast knowledge within the pages.",
        "values": [
          0.7,
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A approaches Agent B to learn about the intricacies of the new coffee machine.",
        "values": [
          0.5,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps to ensure the coffee machine is placed securely.",
        "values": [
          0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches more about the solar system online to complement the book's information.",
        "values": [
          0.9,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes detailed notes on fascinating space facts.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A draws diagrams of the solar system to enhance understanding.",
        "values": [
          0.6,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a visit to a planetarium to Agent B.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the initiative to check the smoke detectors in the house.",
        "values": [
          -0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "A parent finds an unmarked bottle of cleaning liquid and is intrigued but cautious about using an unidentified substance.",
    "actions": [
      {
        "description": "Agent A sniffs the liquid carefully to guess what it might be.",
        "values": [
          0.4,
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks for signs of spoilage in the liquid.",
        "values": [
          0.3,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A questions the teenager about the mysterious cleaning fluid.",
        "values": [
          0.6,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moves the bottle to a secure location.",
        "values": [
          0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns to the internet for clues on the liquid's properties.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A intends to call the cleaning service for details about their product.",
        "values": [
          0.5,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares to post the photo online for expert opinion.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ponders performing a discreet test of the cleaner.",
        "values": [
          0.6,
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, noticing an odd sound from the attic, feels intrigued and decides to investigate, ensuring her approach respects the need to maintain a stable environment and control over the unknown situation.",
    "actions": [
      {
        "description": "Agent A examines the attic layout and identifies all possible exit points before beginning the exploration.",
        "values": [
          0.5,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses her phone to record the sound and to take pictures of the attic and any unusual findings.",
        "values": [
          0.9,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cautiously steps in the attic, making sure to walk only on the secure beams.",
        "values": [
          0.6,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans away cobwebs with a stick, creating a clear path.",
        "values": [
          0.3,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A comes across an old family heirloom and gently cleans it to get a better look.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A finds the source of the dripping sound and places a bucket underneath.",
        "values": [
          0.9,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the found artifacts in order to inspect them more closely.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to mark the trail from the attic door to the spot with the leak.",
        "values": [
          0.4,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a 13-year-old, explores a new science kit in the kitchen while Agent B, their parent, and Agent C, their older cousin, are present. Agent A proceeds with an experiment carefully, taking both explorative and precautionary measures.",
    "actions": [
      {
        "description": "Agent A reads the instructions thoroughly before starting the experiment.",
        "values": [
          0.8,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks to see if Agent B's coffee mug is far away from the experiment area to prevent spillage.",
        "values": [
          0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A measures the vinegar precisely using the provided kit tools.",
        "values": [
          0.7,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C for assistance in constructing the volcano to ensure structural integrity.",
        "values": [
          0.6,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places towels around the experiment area in case of an overflow.",
        "values": [
          0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to perform the experiment near the kitchen sink for easy clean-up and to contain potential spills.",
        "values": [
          0.4,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully disposes of the experiment's remnants according to the disposal instructions in the booklet.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A documents the experiment step by step with a smartphone.",
        "values": [
          0.9,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, an enthusiast in ancient histories and culture, has just moved into an old Victorian house with a secret room that nobody in the family has been able to open yet. Agent B, her college-age cousin, is visiting and staying over for the weekend. Agent C, the elderly neighbor who has lived next door for decades, stops by to welcome the family to the neighborhood. The secret room door is in the living room, where they are all sitting. Agent A is staring at the door, pondering over what mysteries it holds and how to gain access to it without damaging the structure.",
    "actions": [
      {
        "description": "Agent A approaches the secret room door and examines it for hidden mechanisms or clues on how to open it.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes online to research the history of Victorian houses and any similar secret room discoveries.",
        "values": [
          0.8,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to visit the local library to find blueprints or information about her specific house.",
        "values": [
          0.9,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a call to a professional locksmith skilled in antique locks to seek advice.",
        "values": [
          0.6,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully uses a metal detector around the door frame to check for metallic mechanisms without damaging the walls.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A measures the room dimensions to compare with the house's exterior.",
        "values": [
          0.5,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes detailed notes and takes photos as part of her investigation for future reference.",
        "values": [
          0.8,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C if there are any old stories or known facts about the house that might provide hints.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses protective gear before attempting to gently prod and lightly tap around the mysterious room's doorframe.",
        "values": [
          0.4,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In a family home, Agent A is conducting home science experiments in the kitchen, while Agent B prepares lunch and Agent C reads at the dining table. Agent A is exploring chemical reactions using household items under the watchful eyes of agents B and C.",
    "actions": [
      {
        "description": "Agent A writes down observations of the chemical reaction in a notebook, pondering the outcome.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully measures and mixes another batch of chemicals, noting the different reactions.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for advice on edible substances that could cause interesting reactions.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to organize the experiment's steps using household items to demonstrate the scientific method.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up additional information on their phone to compare results with online resources.",
        "values": [
          1.0,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the work area immediately after an experiment to prevent contamination.",
        "values": [
          0.2,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tests the acidity of a substance using a homemade cabbage juice indicator.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A labels all materials used in the experiment to avoid future confusion or misuse.",
        "values": [
          0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores leftover chemicals properly, away from food items in the kitchen.",
        "values": [
          0.1,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "In the kitchen, Agent A is readying to cook with new spices and herbs, while family members and a neighbor are nearby. This setting provides the backdrop for Agent A's exploration of culinary skills and flavors, yet it is essential to consider proper handling and precautionary measures to maintain well-being.",
    "actions": [
      {
        "description": "Agent A decides to look up recipes that use the new herb plant.",
        "values": [
          0.8,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A delicately snips a few leaves from the herb plant to taste and assess their flavor profile.",
        "values": [
          0.7,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the gas flame to a lower setting to prevent any accidental flare-ups while trying to multitask.",
        "values": [
          -0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts chopping vegetables using a knife guard for protection.",
        "values": [
          -0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully labels the antique dishes with a piece of tape noting 'fragile' after observing Agent C handle them.",
        "values": [
          -0.3,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses an app to scan the unfamiliar spices and learn about their origins and uses.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A politely asks Agent D to share some tips about caring for the herb plant.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously cleans up a small liquid spill on the floor to avoid any slips or falls.",
        "values": [
          -0.4,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A explores combining the unfamiliar spices with traditional recipes for a new creation.",
        "values": [
          1.0,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A, a teenage hobbyist, is organizing their collection of exotic plants in the sunroom. Agent B, Agent A's parent, is in the kitchen and Agent C, a younger cousin, enters the sunroom, fascinated by the plants. The room is equipped with gardening tools and new pots.",
    "actions": [
      {
        "description": "Agent A carefully examines a plant to determine if it needs to be repotted into a larger container.",
        "values": [
          0.5,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A browses a botany book for the best methods to propagate a rare plant species they own.",
        "values": [
          0.7,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to install a new shelf to properly display a delicate fern that requires specific light conditions.",
        "values": [
          0.4,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cautiously moves a spiny cactus to a higher shelf to prevent Agent C from being hurt.",
        "values": [
          0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes down a book about local flora to show Agent C, offering to teach them about the native plants.",
        "values": [
          0.6,
          0.0,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A labels all the new pots with the names of plants they plan to nurture, keeping the space organized and systematic.",
        "values": [
          0.3,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inquires about Agent B’s opinion regarding the layout of the plants to obtain a new perspective.",
        "values": [
          0.6,
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A, with gloves, transfers a potentially irritant-producing plant to a secure area out of reach from family and visitors.",
        "values": [
          0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a small fencing barrier around a section of the sunroom where some fragile plants are placed to prevent accidental damage.",
        "values": [
          0.1,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "safety"
    ],
    "scenario": "Agent A is looking out the window at a newly discovered bird's nest in his garden, considering ways to observe and learn about the bird without causing it stress or harm.",
    "actions": [
      {
        "description": "Agent A finds the binoculars.",
        "values": [
          0.7,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up bird species.",
        "values": [
          0.9,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos from a distance.",
        "values": [
          0.6,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a weather-resistant camera.",
        "values": [
          0.8,
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a bird observation journal.",
        "values": [
          0.9,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses observations with Agent B.",
        "values": [
          0.7,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up an indoor viewing spot.",
        "values": [
          0.5,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A designs a homemade bird feeder.",
        "values": [
          0.8,
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads ornithology books.",
        "values": [
          1.0,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  }
]