[
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a young adult, is immersed in a book within a peaceful reading nook at home, while Agent B works out and Agent C sleeps. The environment is calm, with natural light and the presence of fitness and health-promoting elements.",
    "actions": [
      {
        "description": "Agent A decides to take a break from reading to prepare a nutritious breakfast for everyone.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A jots down a shopping list of healthy ingredients needed for the week.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B for a short stretching session before their jog, using the foam roller to prevent muscle soreness.",
        "values": [
          0.0,
          0.4,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the first aid kit in the apartment to ensure it is well-stocked and accessible.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A straightens the loose area rug in the living room to prevent tripping.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reorganizes the bookshelf, placing heavier books on lower shelves for stability.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures all windows are closed and locked before leaving for the jog.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches online for jogging routes that are scenic and have well-maintained paths.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a nutritionist and fitness enthusiast, returns from a morning run and prepares a nutrient-rich smoothie. Agent B is still asleep, and Agent C is engaged in video games. Agent A is mindful about nutrition and well-being, and the environment at home is depicted as calm and orderly.",
    "actions": [
      {
        "description": "Agent A creates a nutrient-rich smoothie, carefully measuring each ingredient for optimal benefit.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stretches on the kitchen mat after preparing the smoothie, to cool down their muscles.",
        "values": [
          0.0,
          0.5,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows in the house to let in fresh air, including in the room where Agent C is playing video games.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discreetly disengages the wifi for a minute to encourage Agent C to take a break from the screen.",
        "values": [
          0.0,
          -0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the expiration dates on the kitchen's fire extinguisher and first aid kit.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares an additional glass of smoothie and leaves it beside Agent B in bed, with a gentle wake-up nudge.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a new air-purifying plant in the living room.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to sit with Agent C in the living room and engage in light exercises during a game intermission.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is planning the weekly meal schedule in a kitchen filled with fresh produce and a variety of cookbooks. Agent B is doing a puzzle in the dining area, and Agent C is reading about gardening in the living area.",
    "actions": [
      {
        "description": "Agent A checks and compares the nutritional information of recipes to include a variety of meals.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a recurring alarm at regular intervals to remind them to stay hydrated.",
        "values": [
          0.0,
          0.9,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a portion of meals in advance to reduce stress during busier days.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans and organizes the refrigerator to make access to food and drink more efficient.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a time in their weekly planner for a home exercise routine.",
        "values": [
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a small indoor herb garden to ensure fresh herbs are always at hand.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a fire extinguisher in the kitchen to be readily accessible in case of an emergency.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A equips the home with a carbon monoxide detector near the kitchen.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a freelance writer, stretches after a long morning at their home office. Agent B is doing a workout session, while Agent C is checking smoke detectors. Agent A goes to the kitchen to prepare a nutritious lunch.",
    "actions": [
      {
        "description": "Agent A decides to prepare a nutritious homemade lunch using the fresh ingredients from the refrigerator.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows throughout the home to let in more fresh air while they move about.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a short break to do a series of stretches and light exercises in the living room.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits down to enjoy their meal and hydrates with a tall glass of water.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to prepare a smoothie with extra protein powder for Agent B after the workout.",
        "values": [
          0.0,
          0.5,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to take a power nap to rejuvenate for the work tasks ahead.",
        "values": [
          0.0,
          0.9,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a short walk outside after lunch for a change of environment and movement.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reorganizes the work desk to further enhance the ergonomic setup for the afternoon tasks.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "'Agent A', a teenager with a passion for sports and outdoor activities, is in their suburban kitchen preparing a hearty breakfast. 'Agent B', their parent, reads the paper, and 'Agent C', a younger sibling, is asleep upstairs. The backyard hosts a set of outdoor fitness equipment, and favorable weather conditions invite outdoor activities.",
    "actions": [
      {
        "description": "Agent A decides to prepare a large, nutrient-packed breakfast for themselves and their family members.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After breakfast, Agent A invites 'Agent B' and 'Agent C' to join them for a morning workout session in the backyard.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets out to double-check the equipment in the backyard to ensure it is in good condition and poses no hazard.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Once Agent C wakes up, Agent A helps them prepare a daily schedule which includes time for schoolwork, exercise, and leisure activities.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews various workout routines on their tablet and starts drafting a new training program tailored to their and Agent C's athletic progression.",
        "values": [
          0.0,
          0.8,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A then heads to the garden, spends some time maintaining it, ensuring that the space remains pleasant and risk-free.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Observing that the weather conditions are perfect for outdoor activities, Agent A organizes a family cycling trip for the weekend.",
        "values": [
          0.0,
          0.6,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After their morning workout, Agent A takes a moment to rest and hydrate properly.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the first aid kit, checking its contents to confirm everything is up to date and easily accessible.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a suburban family home on a weekend afternoon, Agent A is a health-conscious home chef preparing a nutritious dinner. Agent B, a teenager, lounges on the sofa playing video games, while Agent C, a freelance writer, contemplates a walk outside. Agent A contemplates incorporating a complex new recipe that requires careful handling of kitchen utensils.",
    "actions": [
      {
        "description": "Agent A decides to prepare an unfamiliar, complex dish using sharp kitchen knives.",
        "values": [
          0.0,
          0.6,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A steps outside to pick fresh herbs for meal freshness.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates conversation with Agent B to invite participation in meal preparation.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the cooking area immediately after meal prep.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A emphasizes taking a break for a family meal with Agent C.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to stretch and do light exercises.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously sets up the dining table for a formal experience.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors before starting to cook.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a dedicated marathon runner and home chef, invites Agent B to their home for dinner and engages in meal preparation while Agent C observes. The action takes place in a well-ventilated, organized kitchen where Agent A is cooking a nutritious meal.",
    "actions": [
      {
        "description": "Agent A adjusts the flame on the stove to ensure that the soup cooks at the correct temperature.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully stores the sharp knives back into their sleeves after use.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A clears the kitchen floor of any obstacles to prevent any tripping hazards.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table with the proper utensils for dinner, considering their friend’s preferences.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a stretching routine while waiting for the oven timer to go off.",
        "values": [
          0.0,
          0.9,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent C a taste of the soup while using a clean spoon each time to avoid cross-contamination.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A demonstrates how to extinguish a small kitchen fire using baking soda, as a precautionary measure.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to open more windows to allow more fresh air into the home.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a young adult, arrives home exhausted. Agent B is lounging, Agent C is making a salad, and Agent D is absent. Agent A is considering a walk or other household activities.",
    "actions": [
      {
        "description": "Accepts an invitation for a walk.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Declines the walk and prepares a meal.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Assists in making dinner.",
        "values": [
          0.0,
          0.5,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Retires early for rest.",
        "values": [
          0.0,
          0.9,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Grabs a snack and seeks solitude.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Cleans the living space.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Organizes to reduce clutter.",
        "values": [
          0.0,
          0.3,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Suggests a group activity.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Checks the security system.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, after a long day at work, is in the kitchen with Agent B and Agent C. They are preparing for dinner, maintaining a clean environment, and ensuring a secure and comfortable home. Agent A demonstrates responsibility for his well-being and the household’s security.",
    "actions": [
      {
        "description": "Agent A prepares a nutritious meal with fresh ingredients from the garden, emphasizing a variety of vegetables.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks if all the doors are locked and the security system is activated before sitting down to dinner.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to initiate a conversation about the importance of regular breaks while studying, hinting towards Agent C's tired state.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows further to allow for more ventilation while cooking.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to do a quick 15-minute workout in the living room before dinner to rejuvenate himself.",
        "values": [
          0.0,
          0.6,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to examine the fire extinguisher location and ensures it is in working condition.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to take a brief nap on the couch to recover from the fatigue of the workday before engaging in any tasks.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a light stretching routine in the kitchen while chatting with Agents B and C.",
        "values": [
          0.0,
          0.5,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up clutter from the walkways of the house, creating a clear path to navigate around.",
        "values": [
          0.0,
          -0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a college student, has settled in for a weekend of study at home. Agent B, their housemate, is preparing a meal, and Agent C, Agent A's cousin, is reading a book on the couch. The study area is well-lit and tidy.",
    "actions": [
      {
        "description": "Agent A prepares a study schedule to optimize their focus sessions and include adequate breaks.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stretches briefly every hour to reinvigorate themselves during their study sessions.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer to remind themselves to drink water regularly throughout their study time.",
        "values": [
          0.0,
          0.8,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses a balanced snack from the kitchen to maintain their concentration while studying.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a brisk walk outside during one of their study breaks to freshen up.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to join Agent B for a quick home workout session during a longer study break.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C to discuss public health issues for a small diversion from studying.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reorganizes their study materials to maintain a clear and efficient workspace.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the study area after finishing to ensure there's no clutter.",
        "values": [
          0.0,
          0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is in the kitchen of a suburban home, beginning a morning routine before the rest of the household wakes up. The smell of coffee hits the air as Agent A fills up the kettle. The kitchen table features a half-completed puzzle that Agent B, a fellow housemate, has been working on for the past week. A large fruit bowl filled with colorful produce is carefully placed at the center of the table. Meanwhile, Agent C is quietly snoozing upstairs, unaware of the quiet bustle below. Agent A glances at the wall clock, noting the time is early enough to start the day without rush.",
    "actions": [
      {
        "description": "Agent A prepares a nutritious breakfast using fresh produce available.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a brisk walk around the neighborhood after finishing the meal.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the kitchen supplies to make the space more efficient and accessible.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the smoke detectors to make sure they are functioning properly.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A crafts a weekly meal plan to organize upcoming food preparations.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A maps out an emergency evacuation plan for the household.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the first-aid kit, replenishing any missing items.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places non-slip mats in the shower to prevent accidents.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to join an online fitness class to stay active indoors.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Inside a suburban home, Agent A is preparing brunch in the kitchen with Agent B seated at the island and Agent C absorbed in a book on the couch. The kitchen door is slightly open, letting in a breeze.",
    "actions": [
      {
        "description": "Agent A checks the smoke alarms in the kitchen area.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses healthy cooking techniques for the meal.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows for more ventilation and light.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A washes hands thoroughly to prevent contamination.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the stove flame for even cooking.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a non-slip mat on the kitchen floor.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to stretch and refresh.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a cozy dining area.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Inside a cozy residential kitchen, Agent A is arranging fresh vegetables and lean meats on the countertop. Agent B checks smoke detectors and a first aid kit, while Agent C sips water and reviews fitness cookbooks. The kitchen is bright, and a soft breeze fills the room with fresh air.",
    "actions": [
      {
        "description": "Agent A preps vegetables, cutting each piece uniformly.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks expiration dates on meat packages before cooking.",
        "values": [
          0.0,
          0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows for better air circulation.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sips water to stay hydrated while cooking.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer for cooking tracking.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wears an apron to protect clothing.",
        "values": [
          0.0,
          0.1,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses glove grips for hot pots and pans.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans spills to prevent slips.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores knives in a block after use.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a freelance writer, stands in her kitchen preparing to cook a healthy meal, with Agent B doing stretches in the adjacent living area and Agent C working at the kitchen table.",
    "actions": [
      {
        "description": "Agent A starts chopping vegetables for a nutritious meal.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks that she turned off the stove after cooking.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a meal schedule for the upcoming week.",
        "values": [
          0.0,
          0.7,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to organize a family hiking trip for the weekend.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows for ventilation while cooking.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a short workout session with Agent B in the living area.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the locks on doors and windows before bed.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up the kitchen to prevent accidents from clutter.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a fitness enthusiast in his early thirties, is in the kitchen preparing a well-balanced meal while his teen daughter, Agent B, is working on her school project and elderly relative, Agent C, reads a book. They are in a modern apartment with large windows, considering whether to join Agent A in his yoga exercises or continue with their own activities.",
    "actions": [
      {
        "description": "Agent A decides to open the windows only partially to allow fresh air in while mitigating the impact of outside construction dust.",
        "values": [
          0.0,
          0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts preparing a fruit and vegetable smoothie to have a nutritious post-workout snack ready.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up an indoor air purifier to ensure the air quality remains high as he exercises.",
        "values": [
          0.0,
          0.5,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects a calming yoga sequence that also engages Agent B and Agent C if they wish to join.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses the kitchen island to demonstrate a healthy meal prep process for Agent B.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs and tests a smoke detector in the kitchen as a precaution while cooking.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the locks on the windows after opening them to ensure they are secure from intruders.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join his yoga routine, ensuring she takes breaks from her study to move around.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In the kitchen of a suburban home, Agent A is preparing a complex dinner recipe. Agent B, coming from a jog, is told to clean up before dinner due to mud on the floor. Agent C works on a laptop at the dining table, observing the interaction while hydrating.",
    "actions": [
      {
        "description": "Agent A carefully cleans and chops vegetables for the meal, methodically wiping down the cutting board.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A verifies the locks on the doors and windows as the evening darkens into nighttime.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors in the house to ensure they're working before he starts to cook.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer to avoid overcooking dinner, ensuring the meal is well-prepared.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes spices and ingredients, creating a clean and orderly workspace.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that Agent B use an outdoor shower to avoid tracking more dirt inside.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to include a variety in the meal for different tastes.",
        "values": [
          0.0,
          0.6,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A delegates tasks to Agent B to manage cooking demands efficiently.",
        "values": [
          0.0,
          0.4,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a cookbook to accurately follow a new recipe.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is tending to the vegetable patch in a sunny, well-ordered backyard. Agent B is practicing soccer, Agent C is tidying the shed, and Agent D ensures the family dog has water.",
    "actions": [
      {
        "description": "Agent A installs a drip irrigation system for consistent watering.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays soccer with Agent B, engaging in light exercise.",
        "values": [
          0.0,
          0.4,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A refills their water bottle to stay hydrated.",
        "values": [
          0.0,
          1.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wears protective clothing for gardening.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A educates Agent D about plant care.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A protects the plants from harsh sunlight with a cover.",
        "values": [
          0.0,
          -0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A picks ripe vegetables for a healthy meal.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a composting area for garden waste.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A does pre-gardening stretches to prevent injury.",
        "values": [
          0.0,
          0.6,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a suburban home, the kitchen busy with Agent A preparing a nutritious breakfast, Agent B securing new locks, and Agent C studying at the dining table. The balanced atmosphere is indicative of well-being and secure environment considerations.",
    "actions": [
      {
        "description": "Pour a glass of water from the filter and drink to hydrate after completing the breakfast preparations.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Perform a quick series of stretches in the living room to re-energize.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Personally test the new lock installed by Agent B to ensure its proper function.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Assist Agent C with study break exercise routines for mental refreshment.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Take a short walk around the garden to revitalize and get some natural ventilation.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Inspect the smoke detectors around the house for functional batteries.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Look for a recipe to prepare a high-protein post-study snack for Agent C.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Organize the kitchen, securely storing away sharp utensils and cleaning any spillage.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "It's a brisk Sunday morning. Agent A, after waking up and stretching, contemplates either going for a run or settling down to study. Meanwhile, Agent B is creating a meal and Agent D is ensuring the home is secure.",
    "actions": [
      {
        "description": "Opting for a healthy breakfast over skipping it",
        "values": [
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Choosing water over a sugary beverage",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Going for a morning jog",
        "values": [
          0.0,
          0.7,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Double-checking bedroom window locks",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Engaging in a study session for a test",
        "values": [
          0.0,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Doing stretching exercises during a study break",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Planning meals for the week",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Helping with home maintenance",
        "values": [
          0.0,
          0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Suggesting a post-dinner family walk",
        "values": [
          0.0,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a suburban home, Agent A, a nutritionist, starts the day with customary verve, while Agent B cooks and Agent C studies.",
    "actions": [
      {
        "description": "Agent A drinks a glass of water upon waking up to hydrate after a night's rest.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a nutrient-dense breakfast that includes whole grains, protein, and fruits.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stretches and warms up properly before going for a jog.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets out for a morning run, taking a familiar route through the neighborhood park.",
        "values": [
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A returns home from the jog and cools down with gentle stretches.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the locks on the doors and windows before leaving for work to ensure home security.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a plan for the day, setting priorities and tasks that need to be completed.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to allow fresh air into the home.",
        "values": [
          0.0,
          0.3,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In the morning kitchen, Agent A browses recipes on a tablet, his mother, Agent B, sorts bills at the dining table, and Agent C, his grandfather, reads the newspaper. Fresh produce awaits use, a first aid kit is visible on the shelf, doors are locked, and windows are open, allowing a clean breeze inside.",
    "actions": [
      {
        "description": "Agent A selects a recipe that includes fruits and yogurt to prepare a nutritious smoothie.",
        "values": [
          0.0,
          1.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to check all the expiration dates on ingredients before using them in the smoothie.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully cuts the fruits on a sanitized cutting board, ensuring the knife is handled correctly.",
        "values": [
          0.0,
          0.4,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen area, storing sharp objects away from the edge of the counter.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the table neatly with the smoothie and a proper portion for everyone.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to eat outside on the patio to enjoy the fresh air and sunlight.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a meal plan for the rest of the week, focusing on a balanced diet.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the smoke detectors and carbon monoxide alarms to ensure they function.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to go for a midday jog, dresses appropriately, and informs Agent B of his route.",
        "values": [
          0.0,
          0.9,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a suburban home, Agent A prepares a balanced breakfast, Agent B is organizing work documents, and Agent C sets up an obstacle course for play.",
    "actions": [
      {
        "description": "Agent A arranges the sliced fruits and hard-boiled eggs on plates for everyone.",
        "values": [
          0.0,
          0.8,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks each room to ensure that the windows are secured.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C in playful exercises through the obstacle course.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A straightens the house and removes clutter from walkways.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a breathing exercise with Agent C.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews planned escape routes with the household.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits down to plan the week’s meals focusing on nutrition.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A demonstrates proper hand-washing techniques to Agent C.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a fire extinguisher to put out a small accidental fire.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a suburban home, 'Agent A' wakes up to a household already buzzing with morning activities. 'Agent B' is preparing breakfast, 'Agent C' is working on a school project, and the family dog 'Agent D' awaits a walk. The house is filled with the sounds and smells of a typical morning.",
    "actions": [
      {
        "description": "'Agent A' plans a workout routine focusing on various exercises.",
        "values": [
          0.0,
          0.9,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' assists 'Agent B' in making a nutritious breakfast.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' restocks and checks the first aid kit for completeness.",
        "values": [
          0.0,
          -0.5,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' adds reflective material to the dog's leash for visibility during walks.",
        "values": [
          0.0,
          -0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' inspects the smoke detectors for functionality.",
        "values": [
          0.0,
          -0.6,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' reviews and optimizes a meal plan for the week.",
        "values": [
          0.0,
          0.8,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' does stretching exercises after working out to cool down.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' researches and prepares lifting techniques for 'Agent C'.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a college student, comes home to find her roommate studying in low light and an elderly relative reading. The home is slightly unkempt, with stale air and an overripe banana on the kitchen counter.",
    "actions": [
      {
        "description": "Agent A opens the windows to let fresh air into the house.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the kitchen counter and gets rid of the overripe fruit.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets an alarm for a full night's rest.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes for an evening run.",
        "values": [
          0.0,
          0.9,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the doors and windows are securely locked.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reorganizes a cluttered desk without consulting her roommate.",
        "values": [
          0.0,
          0.2,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A consumes a large coffee to stay awake for homework.",
        "values": [
          0.0,
          -0.4,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A waters household plants.",
        "values": [
          0.0,
          0.3,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is in the kitchen having just returned from a run. Agent B is at the table, and Agent C enters with groceries. The kitchen is disorganized, a wet spill is on the floor, and the window is open.",
    "actions": [
      {
        "description": "Agent A dries the wet spot on the kitchen floor.",
        "values": [
          0.0,
          -0.5,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with grocery bags.",
        "values": [
          0.0,
          -0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a nutritious post-run meal.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the window for proper ventilation.",
        "values": [
          0.0,
          0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns off the stove's gas knob to prevent a leak.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A does meal prep for the upcoming week.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the kitchen counter.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stretches and cools down after the run.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, feeling the need to refuel after soccer practice, prepares a healthy sandwich and sits at the kitchen island to eat and browse through their phone. Agent B is ensuring that the paperwork is sorted, and Agent C, the younger sibling, is working on homework at the dining table. The setting is a typical suburban home in the evening, with warm light and a breeze coming in through the windows.",
    "actions": [
      {
        "description": "Agent A checks the expiration dates on the sandwich ingredients before using them.",
        "values": [
          0.0,
          0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen area after making and eating the sandwich.",
        "values": [
          0.0,
          -0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help 'Agent C' with homework after finishing their sandwich.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A refills their water glass to stay hydrated during their homework session.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens another window to let in more air and natural light.",
        "values": [
          0.0,
          0.4,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages 'Agent B' to take a break from paperwork and join them for a quick indoor stretching routine to relax.",
        "values": [
          0.0,
          0.5,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to start preparing their school bag for the next day, ensuring everything is ready and there's no last-minute rush in the morning.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors in the house to see if they are functioning correctly.",
        "values": [
          0.0,
          -0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up a new recipe to make for tomorrow’s lunch, planning ahead.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a fitness enthusiast preparing for his run and paying attention to his physical preparation. Agent B ensures a tidied environment and well-arranged first-aid essentials, while Agent C focuses on nutritious food and hydration.",
    "actions": [
      {
        "description": "Agent A meticulously checks the condition of his running shoes.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully stretches after his run to avoid muscle strain.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks the front door after leaving for his run, securing the house.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a moderate pace for his run, mindful of the advised training regimen.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A drinks water from the bottles prepared by Agent C during his workout.",
        "values": [
          0.0,
          0.9,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After the run, Agent A sets a timer to cool down before heading back inside.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the first-aid kit assembled by Agent B.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A acknowledges Agent B's efforts by thanking them for the kit prep.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, now back from school, places his belongings in the kitchen, noticing the household activities of his parents, and assesses the essentials like water and the food being prepared.",
    "actions": [
      {
        "description": "Agent A fills his water bottle from the filter to hydrate after a long day.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to wash his hands thoroughly before helping with dinner preparation.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes out fresh ingredients needed by Agent B.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a short nap to recuperate from school.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A provides a new battery for the smoke detector.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the first-aid kit for completeness.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk post-dinner.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tightens a loose handrail to prevent accidents.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a stretching sequence in the living area.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a fitness enthusiast and responsible family member, engages in an orderly morning routine, enhancing personal productivity and security at home. Other household members are absorbed in their own activities, creating a peaceful and supportive domestic environment.",
    "actions": [
      {
        "description": "Agent A replenishes after a workout with a nutritious smoothie.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures future workouts by checking gym equipment.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies the gym space to avoid accidents.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A performs post-workout stretches for muscle health.",
        "values": [
          0.0,
          0.5,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures familial harmony by organizing daily activities.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A repairs a loose door hinge to protect against injuries.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A maintains home security by installing detector batteries.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the backyard for secure boundaries.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a restorative nap.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a parent, is in the kitchen preparing a family meal. Agent B is organizing the pantry. Agent C is doing homework at the dining table. There's a storm approaching, a draft coming from a window, and the household is preparing for the evening.",
    "actions": [
      {
        "description": "Agent A checks the weather report for storm updates and plans the evening accordingly.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the window to inspect the draft and decides to weather-strip the area.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a quick family meeting to discuss the storm’s potential impact.",
        "values": [
          0.0,
          -0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A oversees Agent C reviewing the emergency preparedness plan.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses with Agent B to create a meal plan for the week to ensure balanced meal prep.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a meal using perishable ingredients first, in case of power outages.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets out candles and flashlights in accessible locations.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to meditate for a few minutes to stay composed.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to take regular study breaks to maintain focus.",
        "values": [
          0.0,
          0.5,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a suburban home, Agent A returns from school and starts preparing the environment for their own needs and the arrival of Agent C. With a focus on maintenance and security, Agent A activates their afternoon by engaging in various activities around the house.",
    "actions": [
      {
        "description": "Agent A prepares a nutritious snack for Agent C's arrival.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fills and sets a water bottle on the table.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks a bicycle helmet for wear and readiness.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A performs stretching exercises to unwind.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows to ventilate the house.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans the afternoon with a to-do list.",
        "values": [
          0.0,
          -0.3,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the first aid kit is fully stocked.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the emergency contacts list.",
        "values": [
          0.0,
          -0.4,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a power nap before an active evening.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a homeowner who has just returned from a weekly grocery shopping trip. The kitchen is stocked with fresh produce and ingredients needed for upcoming meals. Agent B (Agent A's spouse) is in the living room, reading a book on healthy cooking. Agent C, their teenage child, is busy with homework at the dining table. The smell of fresh vegetables and fruits fills the house, and there's a calm atmosphere as everyone is engaged in their activities. Agent A thinks about preparing a nutritious dinner for the family and looks over the groceries, considering what to cook that would be both replenishing and enjoyable.",
    "actions": [
      {
        "description": "Organize the groceries into the refrigerator and pantry, considering proper storage techniques to maintain freshness.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Wash all the fruits and vegetables thoroughly before storing them.",
        "values": [
          0.0,
          0.7,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Begin prepping ingredients for dinner, chopping vegetables, and marinating proteins.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Schedule the meal times for the upcoming week to ensure regular eating habits.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Quickly browse a recipe book or website for a new and nutritious meal idea.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Invite Agent C to take a break from homework to help with dinner preparation, promoting a cooperative activity.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Check the smoke detectors to ensure they’re functioning before starting to cook.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Plan a brief family walk after dinner to incorporate some physical activity.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Arrange the kitchen to allow free movement and eliminate any tripping hazards.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a home chef and nutrition enthusiast, preparing for a weekly meal prep. Agent B is sorting emergency supplies, and Agent C is setting up a home gym. Agent A is chopping vegetables with cut-resistant gloves in a well-ventilated kitchen with an open window.",
    "actions": [
      {
        "description": "Agent A puts on cut-resistant gloves before beginning to chop vegetables.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully reviews the meal plan to ensure a variety of nutrients are included.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer for regular breaks to avoid standing for too long while cooking.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to check the smoke detector in the kitchen before starting to cook.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the first aid kit in the kitchen cabinet to ensure it is fully stocked.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A labels all the meal prep containers with the date of cooking to monitor the freshness.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens additional windows in the house to ensure proper ventilation while cooking.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stretches gently and does some light exercises between cooking tasks.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a college student, arrives home to a calmly settled environment with family members engaged in their individual replenishing activities. Agent A knows it is time to engage in her own routine of replenishment and preparation for her studies.",
    "actions": [
      {
        "description": "Agent A takes a warm shower to cleanse and refresh after a long day.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B in the kitchen to assist in cooking, practicing knife skills and learning a new recipe.",
        "values": [
          0.0,
          0.7,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to set the table meticulously, showing careful attention to the placement of each utensil and plate.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After the meal, Agent A offers to clean the dishes and sanitize the kitchen counter.",
        "values": [
          0.0,
          0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A heads to her room to change into comfortable clothing appropriate for home study.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A allocates time for a concise workout routine in her room, clearing a space for a yoga mat.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Pulling out study materials, Agent A organizes her desk space, ensuring that all necessary books and supplies are within reach.",
        "values": [
          0.0,
          0.3,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes brisk, deep breaths at her window, allowing the outside air into her study space.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets an alarm for an early night to ensure she doesn't stay up too late studying.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a middle-aged fitness enthusiast, is starting his early morning at home with Agent B, his son, and Agent C, his partner. The house is filled with morning activities and the aromas of breakfast. Agent A stands in the living room, surrounded by signs of a day starting in a peaceful suburban setting.",
    "actions": [
      {
        "description": "Agent A chooses to start his day with thorough stretching exercises in the living room.",
        "values": [
          0.0,
          0.8,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to review and sort out the family emergency plan visibly pinned on the refrigerator door.",
        "values": [
          0.0,
          -0.5,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a brisk walk around the neighborhood after breakfast to breathe in the morning air.",
        "values": [
          0.0,
          0.7,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the locks on all doors and windows before leaving the house for additional reassurance.",
        "values": [
          0.0,
          -0.4,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A performs equipment checks and maintenance of the home fire extinguisher and smoke detector.",
        "values": [
          0.0,
          -0.6,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to cycle to work instead of driving, keeping up with his exercise routine.",
        "values": [
          0.0,
          0.9,
          -0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a lunch composed of balanced macros to take with him to work.",
        "values": [
          0.0,
          0.8,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is newly back home and ventures into the kitchen where Agent B is cooking and Agent C is working on papers. The environment is calm, orderly, and prepared with well-placed items such as a first aid kit and open windows letting in fresh air.",
    "actions": [
      {
        "description": "Agent A starts to help Agent B with the meal preparation.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the expiration of the food before using it.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gets their own cutting board and knife to assist in chopping vegetables.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the kitchen is free from potential hazards before starting work.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A drinks water from the filtered pitcher.",
        "values": [
          0.0,
          0.6,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moves Agent C's papers out of the way to avoid any accidents.",
        "values": [
          0.0,
          -0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A includes a protein source in the meal for nutritional balance.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes time to rest and enjoy the serene environment.",
        "values": [
          0.0,
          0.8,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays soft music without disturbing Agent C's focus.",
        "values": [
          0.0,
          0.3,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a home chef and fitness enthusiast who has just returned home from an early morning run and begins to prepare breakfast. Agent B and Agent C are still asleep. Agent A notices a small puddle of water on the kitchen floor near the refrigerator.",
    "actions": [
      {
        "description": "Agent A carefully cleans up the water spill on the kitchen floor to avoid any accidents.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a pitcher and fills it with filtered water to stay hydrated after the run and during breakfast.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A thoroughly washes the fruits and vegetables to use in the breakfast preparation.",
        "values": [
          0.0,
          0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the batteries in the smoke detector to make sure it’s operational while cooking.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to leave a note for Agent C about the breakfast being ready in the kitchen, acknowledging their late study night.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a quick shower to refresh after the morning run before beginning to cook.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assembles an energizing playlist to listen to while preparing breakfast.",
        "values": [
          0.0,
          0.9,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts for a quick meditation session before the others wake up to maintain a peaceful state of mind.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the locks on the front and back doors for security before getting engrossed in the cooking process.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is in the kitchen preparing ingredients for a nutritious meal and is practicing multitasking between cooking and physical activities. Agent B and Agent C are focusing on their respective professions related to health and physiology. The house is secure and equipped for emergencies.",
    "actions": [
      {
        "description": "Agent A decides to cook a recipe that requires precise timing and multitasking.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A performs a series of stretches and exercises in between the cooking processes.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reorganizes the kitchen to make it more ergonomic and effective for meal prep.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously labels all food with expiration dates to keep track of perishables.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to use a sharp knife with proper technique to chop ingredients.",
        "values": [
          0.0,
          0.6,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A thoroughly washes their hands after handling raw meat.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a new lock on the pantry door.",
        "values": [
          0.0,
          -0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a schedule for cleaning the kitchen appliances regularly.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the emergency procedure manual.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, after a run, is stretching in a well-ventilated living room. Agent B is focused on completing a puzzle. The environment is set for individual tasks, with a first aid kit and healthy snacks available.",
    "actions": [
      {
        "description": "Agent A goes to drink water from the filter jug.",
        "values": [
          0.0,
          0.6,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a post-run nutritious snack.",
        "values": [
          0.0,
          0.5,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers help to Agent B with the puzzle.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A hangs running gear near the window.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up new stretching routines on their phone.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a bandage on a scrape.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A draws the curtains to reduce sun glare.",
        "values": [
          0.0,
          -0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets an alarm for a power nap on the couch.",
        "values": [
          0.0,
          -0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B for a light workout.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, already awake in the dewy embrace of early morning, stands in the kitchen preparing herbal tea, reflecting on their day's agenda, which includes a morning exercise and home maintenance. Agent B soon joins the day, offering the subtle hum of two siblings sharing a familial space.",
    "actions": [
      {
        "description": "Agent A starts their day by making a warming cup of herbal tea.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A does a series of morning stretches and contemplates going for a walk.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A writes a note to remind themselves to repair the loose step.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a balanced breakfast to share with Agent B.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the locks on doors and windows as part of their morning routine.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares their work area for a productive day, arranging their desk optimally.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a raincoat on their walk due to clouds gathering in the distance.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A investigates a strange noise coming from the attic to ensure it's not a sign of a problem with the house.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to take the stairs instead of the elevator during their morning routine for extra activity.",
        "values": [
          0.0,
          1.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a freelance graphic designer, works from home sitting for long periods. Agent B, their roommate, cooks a healthy meal downstairs, and Agent C installs smoke detectors.",
    "actions": [
      {
        "description": "Agent A stands up and stretches to revitalize their body.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes downstairs to help Agent B with meal preparation.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a short walk outside for a break.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a power nap to restore concentration.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A does a quick workout with exercise bands.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the window for fresh air circulation.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes and declutters the workspace.",
        "values": [
          0.0,
          -0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A learns smoke detector installation from Agent C.",
        "values": [
          0.0,
          -0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a home-office dietitian, prepares her space for client visits, ensuring a clear emergency exit and an environment conducive to professional consultations. Agent B and C respect the professional setting and wait for their appointments.",
    "actions": [
      {
        "description": "Agent A cross-checks her appointment schedule to prevent overlaps.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews Agent B and Agent C's dietary plans before their sessions.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the lighting in her office for client comfort.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens office windows for air circulation.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines her office door and window locks.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the emergency exit route for obstructions.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a list of emergency contacts for visibility in her office.",
        "values": [
          0.0,
          0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes her space for the consultations.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A performs stretches to prepare for seated work.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a fitness enthusiast, is preparing to work out in his home gym in the basement which has a flickering light. Agent B is ensuring the household's medical kit is well-stocked, while Agent C is making a pre-workout smoothie in the kitchen.",
    "actions": [
      {
        "description": "Starts a dynamic stretching routine.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Tightens the bulb in the basement.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Undergoes high-intensity interval training.",
        "values": [
          0.0,
          0.9,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Sets reminder for equipment maintenance.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Texts Agent B about the light.",
        "values": [
          0.0,
          -0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Ensures weights are neatly racked.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Decides to extend indoor cardio due to rain.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Takes a break to hydrate and consume the smoothie.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Cleans and disinfects exercise equipment.",
        "values": [
          0.0,
          -0.5,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a fitness enthusiast, is choosing ingredients for a post-workout smoothie in the kitchen after a run, while her roommate Agent B, enters with a fresh harvest of vegetables and Agent C is reading on the couch.",
    "actions": [
      {
        "description": "Agent A places her running shoes into a shoe rack.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares her smoothie using the fresh vegetables Agent B has provided.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers a glass of the freshly made smoothie to Agent B.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wipes down the kitchen counter after preparing her smoothie.",
        "values": [
          0.0,
          -0.1,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses with Agent B about potentially planting new vegetables.",
        "values": [
          0.0,
          -0.1,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to read a book on nutrition recommended by Agent C.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows in the living room to allow more airflow.",
        "values": [
          0.0,
          0.1,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a longer than usual shower to relax her muscles.",
        "values": [
          0.0,
          -0.3,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a menu for the week that includes meals from fresh produce.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a young teenager, who has just returned home from school to a harmonious and orderly home environment. Agent B, their parent, is assembling kitchen shelves and Agent C, their sibling, is studying in the living room.",
    "actions": [
      {
        "description": "Agent A starts their homework at their desk, neatly organizing their materials.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B by holding tools or providing an extra set of hands.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens their window further to let more fresh air into the room.",
        "values": [
          0.0,
          0.2,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets an alarm to limit their study period for evening activities.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a short break to do a series of stretches.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a to-do list for their evening chores.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks the back door after remembering it was left unlocked.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A washes their hands thoroughly before setting the table for dinner.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wears protective gloves before helping Agent B.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is organizing a cluttered storage room, wears protective gear, and is focused on the task while B cooks a nutritious meal, and C tends the garden. The house is buzzing with activities aimed at improving their environment and personal health.",
    "actions": [
      {
        "description": "Agent A checks the stability of the shelving before placing heavy boxes on it.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to stretch and do some light exercises in the middle of organizing.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A dons a sturdy pair of shoes to prevent foot injuries while moving heavy items.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tactically places the heaviest boxes on the bottom to prevent the stack from falling.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a fan in the room to improve air circulation while dusting.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to repair a broken step on the storage room ladder to avoid future accidents.",
        "values": [
          0.0,
          -0.5,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a short nap after completing the task to recover strength.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A consumes a snack high in nutrients after finishing the cleaning.",
        "values": [
          0.0,
          1.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a detailed list of the contents of each box for easy future reference.",
        "values": [
          0.0,
          -0.3,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a college student, begins their Sunday by addressing the disordered kitchen and potential for a healthy start to the day. Housemates Agent B and C are still in the early hours of their weekend routine.",
    "actions": [
      {
        "description": "Agent A clears the kitchen and disposes of the waste properly.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A washes the dishes for a clean cooking space.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores leftover food to prevent spoilage.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a balanced breakfast.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fills a water bottle for hydration.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins the day with stretching exercises.",
        "values": [
          0.0,
          0.6,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes for a run for fresh air and physical activity.",
        "values": [
          0.0,
          0.9,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wakes Agent B for a planned study session.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C for a chat over tea.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is preparing a hearty breakfast in the kitchen, with natural lighting, signifying a bright start of the day. Agent B is ensuring the security of the home, while Agent C struggles with morning grogginess at the table.",
    "actions": [
      {
        "description": "Offers to prepare a cup of strong coffee for Agent C.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Invites Agent B to join him for a quick morning workout to recharge.",
        "values": [
          0.0,
          1.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Creates a playlist of energizing music to fill the house with dynamic sounds.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Allocates time for a short meditation session after breakfast to ensure mental clarity.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Checks his supply of vitamins and supplements, making a note to replenish what’s running low.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Encourages Agent C to come out for a jog to shake off the sleepiness.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Hands Agent B a healthy smoothie to ensure he has a nutritious start to his day.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Proposes they all take a break for a few deep breaths of fresh air outside.",
        "values": [
          0.0,
          0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Organizes the pantry, ensuring all food items are properly stored and easy to locate.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a family home kitchen, Agent A, having returned from a jog, is preparing a healthy breakfast with Agent B and C while occasionally ventilating the house for fresh air.",
    "actions": [
      {
        "description": "Agent A serves the breakfast to everyone.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the kitchen after breakfast.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks the backyard door.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family walk post-breakfast.",
        "values": [
          0.0,
          0.5,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the first aid kit stock.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a grocery run for fresh food.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A removes expired items from the pantry.",
        "values": [
          0.0,
          -0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a fitness instructor, relaxes in the shared living room after teaching, with roommates Agent B and C in separate areas, engaged in their respective tasks. The apartment is peaceful, with sounds of nature and daily living subtly in the background.",
    "actions": [
      {
        "description": "Agent A fills a large pitcher with water and places it on the dining table.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a nutrient-rich dinner.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins a series of cooldown exercises.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A visits a health food store for organic vegetables.",
        "values": [
          0.0,
          0.7,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a schedule for work and rest.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes her room for relaxation.",
        "values": [
          0.0,
          -0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A texts Agent B about dinner preferences.",
        "values": [
          0.0,
          -0.1,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests an evening walk for fresh air.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A learns about plant care on the balcony.",
        "values": [
          0.0,
          -0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In the kitchen, Agent A prepares a meal, Agent B organizes finances at the dining table, and Agent C sets the table. The atmosphere is active and filled with familiar homey scents and sounds.",
    "actions": [
      {
        "description": "Agent A ensures all smoke detectors are functional.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reduces the heat under simmering pots to prevent spillage.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to hydrate and rest.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A lets fresh air into the kitchen and dining space.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tastes and seasons the food during cooking.",
        "values": [
          0.0,
          0.6,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discards any food that is not fresh or looks spoiled.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer for oven management.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a suburban two-story house, Agent A, a teenager, is at the kitchen island studying, while Agent B, his parent, is preparing dinner. Agent C, the younger sibling, is drawing in the living room. A light breeze enters from the open window, refreshing the space.",
    "actions": [
      {
        "description": "Agent A stands up to stretch his legs, walking up and down the stairs.",
        "values": [
          0.0,
          0.7,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a nutrient-rich smoothie.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows to increase airflow.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C on the floor, socializing and overseeing.",
        "values": [
          0.0,
          -0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes regular breaks for light exercises.",
        "values": [
          0.0,
          0.6,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets an alarm for bedtime to ensure rest.",
        "values": [
          0.0,
          0.4,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps with chopping vegetables for dinner.",
        "values": [
          0.0,
          -0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes study materials and electronics.",
        "values": [
          0.0,
          -0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Inside a kitchen where Agent A, a home cook, is preparing dinner. Agent B enters with bell peppers from their garden, and Agent C grabs a water bottle after sports practice. The smoke detector beeps, alerting everyone in the kitchen.",
    "actions": [
      {
        "description": "Agent A tests the smoke detector to ensure it is functional for future alerts.",
        "values": [
          0.0,
          -0.5,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the kitchen utensils and appliances to minimize clutter and avoid accidents.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the first-aid kit in the kitchen, replenishing supplies if necessary.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to use the fresh bell peppers given by Agent B, to enhance the nutritional value of the meal.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a meal that requires low oven temperatures to reduce the risk of burning food.",
        "values": [
          0.0,
          0.5,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A exercises by doing squats and stretches in the kitchen while waiting for water to boil.",
        "values": [
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A investigates online for new recipes that incorporate more vegetables.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a young adult, returns from work and adjusts the house temperature for comfort. They take a moment for refreshment and begin stretching, while ensuring the home's readiness for any emergency.",
    "actions": [
      {
        "description": "Agent A fills a reusable water bottle for their desk.",
        "values": [
          0.0,
          0.6,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A steps onto the balcony for fresh air.",
        "values": [
          0.0,
          0.3,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a nutritious homemade meal.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules their next physical appointment.",
        "values": [
          0.0,
          0.5,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls Agent B about the emergency contact list.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tests the smoke alarms.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A does a series of bodyweight exercises.",
        "values": [
          0.0,
          0.7,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moves heavy furniture away from the windows.",
        "values": [
          0.0,
          -0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks all doors and activates the security alarm.",
        "values": [
          0.0,
          -0.4,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a college student, starts her day with a nutritious breakfast and mindful kitchen activity. Agent B, her roommate, joins her later. Safety and balance are subtly highlighted.",
    "actions": [
      {
        "description": "Agent A decides to brew a pot of green tea for its warmth and restorative properties.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to create a meal-prep plan for the week to ensure a balance of nutrients with every meal.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B that they take a morning walk after breakfast for some exercise and fresh air.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a mental note to check the smoke detector batteries after smelling the faint scent of gas.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes time to stretch and do some light exercise in the living room while waiting for the water to boil.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores leftover ingredients properly to avoid spoilage and waste.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the kitchen surfaces with disinfectant after the meal, maintaining cleanliness.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to walk to the grocery store later in the day rather than drive.",
        "values": [
          0.0,
          0.7,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is in the kitchen having completed a vigorous home workout session. Agent B is preparing a grocery list at the counter, and Agent C relaxes on the couch in the adjacent living room. The house is filled with fresh air from the open door.",
    "actions": [
      {
        "description": "Agent A rehydrates by drinking a glass of water.",
        "values": [
          0.0,
          0.8,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A performs cool-down stretches.",
        "values": [
          0.0,
          0.7,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A disinfects kitchen surfaces.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares orange slices with Agent B and C.",
        "values": [
          0.0,
          0.6,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows to improve air circulation.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A contributes to the grocery list with nutrient-dense items.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up a healthy recipe.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A charges their fitness tracker.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses installing more smoke detectors.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A prepares dinner for a food blog post, with attention to hygiene and cooking accuracy in a well-equipped kitchen. Agents B and C provide a passive backdrop as they engage in other activities.",
    "actions": [
      {
        "description": "Agent A thoroughly washes their hands before and after handling different ingredients.",
        "values": [
          0.0,
          0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cuts vegetables with precision and sets them aside in separate bowls.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a food thermometer to ensure proper cooking temperatures.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer to monitor cooking times to prevent overcooking.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores leftover ingredients in containers in the refrigerator.",
        "values": [
          0.0,
          0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans spills immediately to prevent slipping.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A samples and adjusts seasoning of the dish for flavor.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A labels containers with contents and dates for storage.",
        "values": [
          0.0,
          -0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews emergency procedures in case of a kitchen fire.",
        "values": [
          0.0,
          -0.4,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is prepping a meal with fresh ingredients while Agent B organizes a first aid kit and Agent C checks smoke alarms. The environment is productive and proactive towards well-being.",
    "actions": [
      {
        "description": "Agent A begins to chop vegetables for a nutritious meal.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pauses to drink a glass of water.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer to remind themselves to take a break for rest.",
        "values": [
          0.0,
          0.5,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to clean up the kitchen space to remove any clutter.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a light stretching routine while the oven preheats.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows to let in natural light and air.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the fire extinguisher to ensure it is within the expiry date and operational.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to bake the chicken instead of frying.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a slip-proof mat under the kitchen rug.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A has returned from work to a secure and tidy home. Agent B is preparing a nutritious dinner, and Agent C is studying upstairs. Agent A is conscious of the need to relax and prepare for the next day.",
    "actions": [
      {
        "description": "Agent A decides to spend 30 minutes stretching and practicing yoga.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a quick shower, ensuring to use the bathroom mat.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A changes into comfortable clothing appropriate for the evening.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a short walk with the family.",
        "values": [
          0.0,
          0.5,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks that all doors are locked at night.",
        "values": [
          0.0,
          -0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a carbon monoxide detector.",
        "values": [
          0.0,
          -0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares work materials but prioritizes sleep.",
        "values": [
          0.0,
          -0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures Agent C doesn't study too late.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a fitness enthusiast has just returned home from a jog. He prepares to rehydrate and notices a security concern with the back door. Agent B is busy with documents in the study, and Agent C is cooking a nutritious meal in the kitchen.",
    "actions": [
      {
        "description": "Agent A drinks a glass of water to rehydrate after jogging.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks the back door that he noticed was open to ensure the house is secure.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent C with the meal preparations.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes out his meal prep containers to portion the meal for future consumption.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to cool down and stretches to prevent muscle stiffness.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets an alarm on his phone to remind him to go to bed early for adequate rest.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A composes a grocery list of healthy food items for replenishing supplies.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plants to inspect and fix the door lock mechanism to prevent the garden door from being left ajar again.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is beginning her day with a yoga session in her new living room, creating a peaceful ambiance with music. Agent B is crafting a healthy breakfast in the kitchen, while Agent C is still asleep in the guest room.",
    "actions": [
      {
        "description": "Agent A begins her yoga session with gentle stretches.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A refills her water bottle after yoga.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses headphones to not disturb sleeping Agent C.",
        "values": [
          0.0,
          0.1,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows for fresh air during her workout.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up a spill to prevent accidents.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leaves a note for Agent C about breakfast.",
        "values": [
          0.0,
          0.1,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a reminder to stretch in the afternoon.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks food expiration dates.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors before working.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a fitness enthusiast in her late twenties, wakes up early in a suburban home she shares with her brother, a chef, and their elderly grandmother. She prepares for her morning workout in a dimly lit living area, opens windows for air, hydrates, checks on her grandmother, and follows a note from her brother for a healthy breakfast.",
    "actions": [
      {
        "description": "Agent A begins her day with a series of stretching exercises on her workout mat.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After her warm-up, Agent A proceeds to a 30-minute high-intensity interval training (HIIT) session.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A realizes the windows are closed and opens them to let in the fresh morning breeze.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Following her workout, Agent A heads to the kitchen and starts her hydration routine with a glass of water.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After drinking water, Agent A checks on her grandmother, Agent C, to see if she is comfortable and doesn’t require any assistance.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a healthy breakfast using the ingredients left by Agent B to refuel after her workout.",
        "values": [
          0.0,
          0.9,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Once done eating, Agent A makes sure to store leftovers properly to avoid food spoilage.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to plan her workouts for the week and notes them down on her calendar.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is an adult in his mid-thirties, meticulously prepping ingredients for a healthy dinner in his well-organised kitchen. Agent B, a teenager, is studying at the table, and Agent C is stretching in the living space.",
    "actions": [
      {
        "description": "Agent A fills the water bottles from the purifier and places them in the refrigerator.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector in the kitchen to ensure it's functioning.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a 15-minute break to stretch and do a series of light exercises.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the window locks to confirm they are secure before leaving the kitchen unattended.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent B some water and a healthy snack to maintain concentration.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer to take periodic breaks from cooking to check on Agent B’s study progress and offer support.",
        "values": [
          0.0,
          0.3,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to meal prep for the next day to ensure a nutritious diet is followed.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rehearses a fire escape plan mentally and decides to discuss it with Agents B and C later.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the kitchen to avoid any clutter that might cause an accident.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a family kitchen, Agent A selects a complex recipe from a cookbook, organizes with Agent B and C who are getting the cooking space ready, implying a cooking activity is about to commence.",
    "actions": [
      {
        "description": "Agent A starts cutting the vegetables with a sharp knife, using a cutting technique they recently learned to be efficient.",
        "values": [
          0.0,
          0.6,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to systematically arrange the ingredients for a smooth cooking process.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a light stretching routine after inactivity.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk to enjoy fresh air and aid digestion.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures all appliance cords are neatly tucked away.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A washes their hands thoroughly before meal prep.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully adjusts the stove settings and monitors the cooking process.",
        "values": [
          0.0,
          0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to put away leftovers in proper storage containers.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a fire extinguisher for emergency preparedness.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a homeowner, is in the kitchen on a Saturday morning, making fresh whole grain bread, with Agents B and C, her children, studying at the dining table in a comfortable environment filled with natural light and fresh air.",
    "actions": [
      {
        "description": "Agent A slices the fresh bread and serves it with homemade jam and a pitcher of water for breakfast.",
        "values": [
          0.0,
          0.7,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens all windows in the kitchen and dining area to allow more ventilation.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a brief nap in the hammock in the backyard.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a family yoga session for some light shared activity.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the pantry and securely locks the cabinets.",
        "values": [
          0.0,
          -0.5,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the family first aid kit to replenish any missing items.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads her children in an emergency fire drill.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shows Agents B and C how to properly lift weights in the home gym.",
        "values": [
          0.0,
          0.8,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a large pitcher of herbal iced tea for the family.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a 34-year-old marathon runner, is preparing a nutrient-packed smoothie in the kitchen early in the morning. Agent B, a nutritionist, is organizing nutritional supplies in the kitchen, and Agent C is working out upstairs. The house is filled with a sense of vigor and readiness for the day.",
    "actions": [
      {
        "description": "Agent A blends the chopped vegetables and fruits into a smoothie.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fills up a reusable water bottle to stay hydrated throughout the day.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the first aid kit to ensure it's fully stocked.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the running shoes for any signs of wear and tear.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen area after preparing the smoothie.",
        "values": [
          0.0,
          -0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a reminder to take a midday break for stretching.",
        "values": [
          0.0,
          0.3,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the household security system to ensure it's functioning properly.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A writes down a meal plan for the week, including all necessary nutrients.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tests the smoke detectors in the kitchen and other areas of the house.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is preparing dinner with healthy ingredients. Agent B is checking for expired food items, and Agent C is setting the table. The room is well-ventilated with fresh air from an open window.",
    "actions": [
      {
        "description": "Agent A ensures that the knives and other sharp objects are securely placed in a block after use.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to examine the security of the open window.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B with shelf organization.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break from cooking to do a series of quick stretching exercises.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to clear a spill on the floor immediately.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent C to light some candles on the table but to keep them from flammable objects.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts for a brief walk outside to invite the neighbor over for dinner.",
        "values": [
          0.0,
          0.5,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A scans the ingredients for potential allergens.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A just came back from work and notices the wilting potted plants. Agent B is cooking, while Agent C is cleaning the living space. The house is airy with an unfinished board game on the table.",
    "actions": [
      {
        "description": "Agent A waters the potted plants.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent B with meal-prepping.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stretches and exercises briefly.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes board game pieces.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A replaces a flickering light bulb.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a brief nap.",
        "values": [
          0.0,
          0.8,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows for fresh air.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a cleaning rotation.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A restocks the first-aid kit.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is arranging her living space for an exercise session, with emphasis on physical activity and household security. Agent B is consumed in his studies while staying mildly hydrated, and Agent C is comfortably preparing a meal.",
    "actions": [
      {
        "description": "Agent A starts her high-intensity interval training session, carefully adjusting the difficulty.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A diligently logs her workout information on a fitness tracker.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a nutritious post-workout shake from pre-set ingredients.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures that the household is secure after her exercise routine.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies the room, returning all items to their place.",
        "values": [
          0.0,
          -0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A guides Agent B in stretching to improve his physique.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gets ready for the day while keeping personal care in mind.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to drink more water for better hydration.",
        "values": [
          0.0,
          0.3,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C with a heavy kitchen task to prevent an accident.",
        "values": [
          0.0,
          -0.4,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "On a tranquil Sunday morning, 'Agent A' has finished cleaning the kitchen after breakfast. 'Agent B', their child, works on a woodcarving project, while 'Agent C' is busy with paperwork. The home is filled with the scent of coffee and fresh grass, and the air is well-regulated with a slight breeze.",
    "actions": [
      {
        "description": "'Agent A' starts preparing a grocery list focusing on fresh produce and necessary household items.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' inspects all the smoke detectors to ensure they are functioning.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' organizes a family emergency drill.",
        "values": [
          0.0,
          -0.4,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' decides to fit new locks on the doors.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' sets up a family scheduling board to manage chores.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' lays out a detailed meal plan for the week.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' subscribes to an online workout program.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' plans to install a water filter system.",
        "values": [
          0.0,
          0.6,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' goes for a brisk walk for fresh air and sun.",
        "values": [
          0.0,
          1.0,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a lively teenager who has returned home from school. They greet their family, head to their room to change, and prepare for a workout session. The kitchen is ready for dinner, with Agent B cooking and Agent C engaged in an assembly project. The home embodies order and preparedness.",
    "actions": [
      {
        "description": "Agent A decides to change into comfortable attire suitable for a workout session.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts doing warm-up exercises in their spacious room before starting intensive training.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A grabs a banana from the fruit basket to snack on.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A spends some time stretching after their workout for better muscle recovery.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A drinks a glass of water to stay hydrated after exercising.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins to study for an upcoming test in their efficiently arranged workspace.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the window in their room wider to let in more air while studying.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B set the table, taking care to place sharp cutlery out of the way.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a university student, at home in his apartment kitchen, preparing for an important collegiate track event. Various ingredients are laid out on the counter for a nutrient-dense meal. Agent B, Agent A’s roommate, enters the kitchen following a quick grocery run, bringing in more supplies, including fresh produce and bottled water. The room is filled with the aroma of cooking, and a window is open allowing fresh air to circulate. Agent C, a neighbor, is visiting and sits at the kitchen table working on her laptop. She periodically glances over, interested in Agent A's cooking process.",
    "actions": [
      {
        "description": "Agent A carefully chops vegetables and prepares a balanced meal.",
        "values": [
          0.0,
          0.9,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a periodical break from preparing the meal to stretch his muscles.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A finds a recipe online to optimize his meal for his needs.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up an alarm to ensure he doesn’t forget to go to bed early.",
        "values": [
          0.0,
          0.5,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens another window to improve air circulation in the apartment.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector in the kitchen before starting to cook.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a knife guard when chopping the vegetables.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wears an apron to protect his clothes from oil splatter.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A wakes up to a household morning routine and considers joining family members in daily activities that exhibit a focus on physical engagement and maintaining a secure environment.",
    "actions": [
      {
        "description": "Agent A decides to make a hearty breakfast by adding sliced bananas and apples from the fruit bowl into a bowl of granola.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fills up a large glass of water from the pitcher and drinks it to hydrate herself after waking up.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts on suitable attire and her running shoes and takes the family dog out for a brisk walk in the garden.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to join her father in the kitchen and learns a new recipe to cook.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a morning exercise routine she has been following which includes stretching and calisthenics in the backyard.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins her mother in organizing the living room, offering to reach high shelves and handle the heavier items.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits down to plan her meals and activities for the day, considering the balance of nutrition and physical engagement.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After her routine in the backyard, Agent A takes a few moments to practice deep breathing exercises, filling her lungs with fresh air.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a fitness enthusiast, is beginning his day early in the home gym, which has ample natural light and a fresh environment. Agent B is at the kitchen table organizing newly bought groceries, while Agent C is asleep upstairs.",
    "actions": [
      {
        "description": "Agent A starts his workout with stretching and deep breaths, taking in the clean air from the purifier.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the equipment before using, making sure it's in good working order.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the room temperature for optimal comfort during the workout.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After noticing the first aid kit, Agent A reviews its contents to ensure it's well-stocked.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A hydrates regularly throughout his exercise routine.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a balanced post-workout meal with ingredients from the grocery bags.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Post-workout, Agent A sets up a rest area with proper cushions and lighting for a short nap.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes and cleans the gym equipment and area to avoid any hazards.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a break and walk around the garden for fresh air and sunlight.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a recent college graduate, enters the kitchen where their roommates, Agent B and Agent C, also reside. The scene is set in the morning, with A getting ready for the day and B already seated and working at the dining table. Agent A demonstrates attentiveness to the physical space and tasks that need attention for mutual benefit.",
    "actions": [
      {
        "description": "Agent A decides to tighten the screws on the wobbly bar stool to prevent potential accidents.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After exercising on the yoga mat, Agent A creates a nutritious smoothie using the blender and the fruit from the bowl.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Checking on Agent B, Agent A gently suggests taking a break and offers to make them a fresh cup of something warm.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens another window to let more fresh air into the kitchen and living area.",
        "values": [
          0.0,
          0.3,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Considering their groceries list, Agent A adds items that would contribute to balanced meals for the upcoming week.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to wait for Agent C to surface before fixing the stool, realizing it could be a good opportunity to teach them some basic home repair skills.",
        "values": [
          0.0,
          -0.3,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Realizing Agent B might be unaware of their tense posture, Agent A offers to share a quick stretching routine for relaxation.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fetches their water bottle again, noting that staying hydrated is important, especially after planning to work out.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "While preparing for their day, Agent A checks the first aid kit to ensure it is fully stocked.",
        "values": [
          0.0,
          -0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a clean, well-organized kitchen, 'Agent A', a nutrition enthusiast, is preparing a post-exercise smoothie, with 'Agent B' working at the dining table, and 'Agent C' on the couch, all within an orderly household that prides cleanliness and preparedness.",
    "actions": [
      {
        "description": "'Agent A' blends a nutritious smoothie using fresh ingredients.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' sterilizes the kitchen surface and cutting boards.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' prepares a meal plan for wholesome meals.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' refills a water bottle for the upcoming workout.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' restocks the first-aid kit.",
        "values": [
          0.0,
          -0.4,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' secures loose cables to prevent tripping.",
        "values": [
          0.0,
          -0.5,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' locks doors before exercising.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' organizes supplements, checking dates.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' installs a new smoke detector.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a young adult, returns home after work, thirsty and looking to prepare a light snack carefully not to wake his roommate, Agent B. He moves to the kitchen where he avoids noise, makes a snack, and ensures the home is secured.",
    "actions": [
      {
        "description": "Agent A fills a pot with water to boil eggs for protein.",
        "values": [
          0.0,
          0.7,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cuts fresh vegetables and prepares a salad.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts on slippers to be quiet.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up cooking area to maintain order.",
        "values": [
          0.0,
          -0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the alarm for morning exercise.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks all doors before bed.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A switches off unnecessary lights.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans balanced meals for the next day.",
        "values": [
          0.0,
          0.6,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews a checklist for the next day for peace of mind.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is preparing for her morning fitness routine in a room optimized for exercise and hydration, while Agent B is making breakfast and Agent C sets up his study area. Agent D, on the balcony, ensures Agent A stays hydrated and cools down after her workout.",
    "actions": [
      {
        "description": "Agent A engages in a blend of stretching and cardiovascular exercises.",
        "values": [
          0.0,
          0.8,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A hydrates before and after her workout.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A keeps track of her workout duration to avoid overexertion.",
        "values": [
          0.0,
          0.5,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully navigates the cluttered space to prevent accidents.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the room is well-aerated before exercising.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meets Agent D on the balcony to maintain their social connection.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a meal reminder for balanced nutrition.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cools down post-exercise to regulate heart rate.",
        "values": [
          0.0,
          0.3,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a spacious kitchen, Agent A prepares a traditional meal, maintaining a nutritious balance and ensuring proper food handling. Agent B is absorbed in learning the functionalities of a new fire extinguisher and its location is reviewed by both. Agent C steps in to return a dish, appreciating the home atmosphere.",
    "actions": [
      {
        "description": "Agent A tastes the food to ensure it is flavorful and adjusts the seasoning accordingly.",
        "values": [
          0.0,
          0.4,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table with placemats and cutlery, placing a pitcher of water for everyone.",
        "values": [
          0.0,
          0.5,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the location of the fire extinguisher and ensures the escape routes are unobstructed.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A exercises by stretching in the kitchen while waiting for the food to cook.",
        "values": [
          0.0,
          0.6,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a short, brisk walk around the backyard to invigorate before the meal.",
        "values": [
          0.0,
          0.7,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join him in the backyard for a breath of fresh air before they eat.",
        "values": [
          0.0,
          0.3,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores the leftover food properly in airtight containers to prevent spoilage.",
        "values": [
          0.0,
          -0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the kitchen meticulously to avoid any hazards or bacteria growth.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the pantry and checks the expiration dates on goods to maintain quality.",
        "values": [
          0.0,
          -0.5,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "The setting is a renovated kitchen with ample natural lighting streaming through a window. Agent A is a nutrition enthusiast returning from a jog and is looking at fresh produce. Agent B is at the dining table with water and fruit, and Agent C is reading a recipe book. Natural light and the morning news create a calming atmosphere.",
    "actions": [
      {
        "description": "Agent A starts stretching on her yoga mat in the living room.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the lock on the back door for security.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a smoke detector in the kitchen.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the medicine cabinet, checking expiration dates.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the first aid kit for missing items.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks that kitchen windows are closed and locked.",
        "values": [
          0.0,
          -0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A maps out an evacuation plan and shares it with housemates.",
        "values": [
          0.0,
          -0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads a book on balanced diets to enhance her knowledge.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A has just gotten home from work. Agent B, the child, is focused on school tasks at the kitchen table, while Agent C, the spouse, cooks and listens to a podcast. Fresh air flows in through an open kitchen window. Agent A joins Agent B for some relaxation exercises in the living room, considering it a quality time.",
    "actions": [
      {
        "description": "Agent A preps a fruit salad for dinner.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks and maintains smoke detectors.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in yoga with Agent B.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A updates the emergency contact list.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ventilates the living area.",
        "values": [
          0.0,
          0.4,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a post-dinner walk.",
        "values": [
          0.0,
          0.8,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A clears trip hazards.",
        "values": [
          0.0,
          -0.5,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is in the kitchen preparing dinner, with Agent B in the living room and Agent C entering the home warmly greeted by Agent A.",
    "actions": [
      {
        "description": "Agent A adjusts the flame to a lower setting to let the stew simmer without risk of spilling over or burning.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a nonslip mat under the cutting board to prevent it from sliding.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wipes up a spill on the kitchen floor immediately to avoid slipping.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns on the exhaust fan to keep the kitchen well-ventilated.",
        "values": [
          0.0,
          -0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A systematically organizes the unused vegetables and seals them for proper storage.",
        "values": [
          0.0,
          -0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the batteries in the smoke detector as they cook.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to multitask by initiating a stretching routine next to the kitchen countertop as they wait for the stew to cook.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A disinfects the kitchen surfaces after meal prep to maintain cleanliness.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the locked front door after letting Agent C inside.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is busy preparing breakfast, showing attentiveness to healthy meal prep and neatness. Agent B, visibly tired, has not tidied up after their morning exercise, leaving room for Agent A to provide guidance. Agent C practices good hygiene in the background. The environment is one of morning routine, conscious living, and security.",
    "actions": [
      {
        "description": "Agent A decides to cook a veggie-packed omelet using the available ingredients.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pours a glass of water from the filter, ensuring they stay hydrated.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A instructs Agent B to move the wet cycling clothes to the laundry area.",
        "values": [
          0.0,
          -0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns on the radio to listen to a morning health segment while cooking.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully chops the fruits and vegetables, using a cutting board to avoid scratching the countertop.",
        "values": [
          0.0,
          0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table, placing coasters to protect the wood from potential heat and moisture damage.",
        "values": [
          0.0,
          0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a warm herbal tea for Agent C, taking into account their dislike for coffee.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks the back door, which Agent B forgot to secure after their early morning cycle.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects a variety of nuts and seeds to add a nutritious crunch to the breakfast.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a family home's kitchen, Agent A has returned from cycling, Agent B is making a smoothie, and Agent C is packing a backpack. Agent A is considering post-activity choices.",
    "actions": [
      {
        "description": "Agent A prepares a nutritious post-ride meal.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A learns a new smoothie recipe from Agent B.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the bicycle for maintenance.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A washes cycling gear immediately.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans the next cycling route.",
        "values": [
          0.0,
          0.6,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stretches and cools down outside.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a power nap alarm.",
        "values": [
          0.0,
          0.5,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the weather for afternoon plans.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a middle-aged man who has just returned home. The kitchen is lively with Agent B cooking and Agent C studying at the dining table. Agent A greets the family and assists Agent B with food preparation.",
    "actions": [
      {
        "description": "Agent A helps in chopping the carrots.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to initiate a quick family game.",
        "values": [
          0.0,
          0.6,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to read the manual of the new smoke detector and installs it.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A advises Agent C on better sitting posture.",
        "values": [
          0.0,
          0.1,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A exercises with light stretches.",
        "values": [
          0.0,
          0.5,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows to let in fresh air.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks all doors and windows are locked.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares to create an emergency exit plan.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A spends time meditating.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a home chef preparing an elaborate meal, Agent B is assembling kitchen furniture, and Agent C is researching dessert recipes. Each agent is engaged in their task while interacting lightly with others in a secure home environment.",
    "actions": [
      {
        "description": "Agent A begins to chop vegetables with careful attention to knife handling.",
        "values": [
          0.0,
          0.6,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks expiration dates on ingredients before using them.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up spills immediately to prevent slipping.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a thermometer to check meat temperature.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer for regular food checks.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pauses to stretch legs and back.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to drink water.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows for better ventilation.",
        "values": [
          0.0,
          0.5,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores knives in a block after use.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is in the kitchen of the suburban family home preparing a homemade meal while Agent B is at the kitchen table and Agent C sets the table. The sun and a gentle breeze flow through the open window as Agent A starts to cook.",
    "actions": [
      {
        "description": "Agent A checks the handles of the pots and pans to ensure they are turned inward.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reminds Agent B to drink water, noticing that the teenager has been seated for a while without a drink.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows to allow for additional ventilation.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A swaps out the regular frying pan for a non-stick pan to reduce the need for cooking oils.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent C a light chore to wash fresh produce.",
        "values": [
          0.0,
          0.2,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a food thermometer to ensure the meat is cooked to the appropriate temperature.",
        "values": [
          0.0,
          -0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns off electronic devices not in use to conserve resources.",
        "values": [
          0.0,
          0.6,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a lid on the pan to lower the cooking temperature and prevent splatter.",
        "values": [
          0.0,
          -0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "'Agent A' is a health-conscious individual who has just returned home from a long day of work. 'Agent B' is entertained with a tablet in the living room, and 'Agent C' is sorting through mail at the dining table. The house is secured with working smoke detectors and properly locked doors and windows.",
    "actions": [
      {
        "description": "'Agent A' decides to prepare a meal using fresh vegetables and lean protein.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' starts washing fruits and makes a nutrient-packed smoothie.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' opts to take a quick nap on the couch to recover from work exhaustion.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' puts on running shoes and performs stretching exercises in the living room.",
        "values": [
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' takes a moment to walk outside, tending to the small herb garden near the kitchen window for fresh air.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' installs a new lock on the front door for added home security.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' organizes and securely stores away personal belongings that are scattered around the house.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' checks the smoke detectors to make sure they are functioning correctly.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' examines the expiration dates on items in the first-aid kit and replaces outdated supplies.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a 28-year-old marathon runner, is preparing a nutrient-packed meal. Agent B is securing important documents, and Agent C is checking a weather radio and reviewing a checklist. The kitchen is tidy and prepared for meal prep with a well-maintained workspace.",
    "actions": [
      {
        "description": "Agent A reviews a recipe for portion sizes.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stretches before a run.",
        "values": [
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs detectors in the kitchen.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up after meal prep.",
        "values": [
          0.0,
          0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes prepared meals in the fridge.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a shopping list for next week.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to drink water.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks all locks before bed.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules their workouts for the week.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is in the kitchen, arranging fruits and vegetables while ensuring the availability of fresh water. A workout mat and running shoes indicate an upcoming exercise routine. Agent B is engaged with a smartphone, and Agent C reads a newspaper. Fresh air circulates through the partly opened door.",
    "actions": [
      {
        "description": "Blends a nutritious smoothie.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Refills the water pitcher.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Begins a series of stretching exercises.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Goes for a jog in the neighborhood.",
        "values": [
          0.0,
          0.9,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Opens the windows to let in more air.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Locks the front door upon return.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Cleans and organizes the kitchen.",
        "values": [
          0.0,
          0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Checks the smoke detectors.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Prepares a grocery list focusing on replenishing food.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is about to begin a workout session in the newly set up home gym, mulling over which exercise to start first. Agent B is nearby, engaging in a different activity, while Agent C is still asleep.",
    "actions": [
      {
        "description": "Agent A begins with a warm-up routine on the treadmill.",
        "values": [
          0.0,
          0.7,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A follows up with weightlifting starting with dumbbells to work on arm strength.",
        "values": [
          0.0,
          0.8,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a short break to hydrate and catch their breath.",
        "values": [
          0.0,
          0.6,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the secure placement of weights on the bench press before continuing to exercise.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A lays out the yoga mat and starts a cooldown session with yoga stretches.",
        "values": [
          0.0,
          -0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully puts away the equipment after finishing the workout.",
        "values": [
          0.0,
          -0.5,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A spends a few minutes meditating for mental clarity after the physical exercise.",
        "values": [
          0.0,
          -0.4,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a healthy breakfast, including a protein shake, eggs, and whole-grain toast.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows in the gym to let in fresh air.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a home chef, prepares for a family lunch, with fresh produce ready for meal prep and a new blender for assistance. Agent B, their teenage child, is present in the kitchen, while Agent C is nearby in the living room. A clear workspace, potted herbs, and an unopened blender set the stage for lunch preparation.",
    "actions": [
      {
        "description": "Agent A carefully washes and chops the fresh produce for the meal.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the new blender after reading the instruction manual.",
        "values": [
          0.0,
          -0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A instructs Agent B to properly set the table.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a new soup recipe using the blender.",
        "values": [
          0.0,
          0.8,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects and waters the potted herbs by the window.",
        "values": [
          0.0,
          0.4,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to ventilate the kitchen while cooking.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector batteries before cooking.",
        "values": [
          0.0,
          -0.5,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A maintains a clean workspace during meal prep.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gets help from Agent C with heavy dishes.",
        "values": [
          0.0,
          -0.4,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a fitness enthusiast in her early thirties, sits in her home office, which also serves as a workout space. It's late afternoon, she contemplates her skipped meal and nightly routine. Agent B, her nephew, is lounging in the living room, while Agent C, her partner, returns home and places items on a designated hygiene shelf.",
    "actions": [
      {
        "description": "Agent A takes her water bottle and drinks a significant amount for hydration.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts preparing a balanced dinner with various food groups.",
        "values": [
          0.0,
          1.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reminds Agent B to place his shoes on the rack.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C for an evening walk in the park.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B discuss keeping the floor free from clutter.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens all windows for full circulation of air.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a reminder for a 20-minute nap to rest.",
        "values": [
          0.0,
          0.5,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A clears work equipment from the floor.",
        "values": [
          0.0,
          -0.5,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A does a brief yoga session to refresh.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is organizing the kitchen during a cleaning day in the apartment he shares with Agents B and C. A finds the water filter needing replacement and notices several foods to be resealed.",
    "actions": [
      {
        "description": "Agent A buys a new water filter and replaces the old one.",
        "values": [
          0.0,
          0.4,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reseals all opened food containers with airtight lids.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discards expired food items.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a shared rotating cleaning schedule.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A distributes cleaning tasks equally between roommates.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A exercises practical waste separation.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places fresh silica gel packets in closets.",
        "values": [
          0.0,
          0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a smoke detector in the kitchen.",
        "values": [
          0.0,
          0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a professional inspection of the apartment’s electrical wiring.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a middle-aged individual who starts the day with a passion for gardening. Surrounded by plants in the backyard and equipped with a watering can, he attends to his vegetable garden. Agent B is indoors perusing a home improvement catalog, while Agent C is finishing a workout routine. The tranquil morning atmosphere sets the stage for productive individual routines.",
    "actions": [
      {
        "description": "Agent A turns on the sprinkler system to water the garden.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A performs stretches before starting his gardening work to avoid strain.",
        "values": [
          0.0,
          0.5,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a healthy breakfast for himself after gardening.",
        "values": [
          0.0,
          1.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a brisk walk around the neighborhood after completing his morning gardening.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the home's smoke detectors to ensure they are functioning correctly.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wears a hat and applies sunscreen before heading outside to garden.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the shed to secure all the tools and gardening equipment properly.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A subscribes to a health magazine that focuses on natural living and outdoor activities.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a weekly meal plan emphasizing nutritional balance.",
        "values": [
          0.0,
          1.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a parent and running enthusiast, observes the rainy weather, affecting the usual morning jog. Inside, Agents B and C focus on a healthy breakfast and meal planning, with A considering indoor active and preparatory home tasks.",
    "actions": [
      {
        "description": "Agent A decides to replace the usual outdoor run with an indoor high-intensity interval training session.",
        "values": [
          0.0,
          0.8,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to join Agent B in making a nutritious breakfast.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects a complex recipe from the family collection that requires creativity and physical involvement.",
        "values": [
          0.0,
          0.6,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C to reorganize the pantry.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to take a study break and join for stretching exercises.",
        "values": [
          0.0,
          0.5,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the house's security system.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures all windows and doors.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a check of smoke alarms and carbon monoxide detectors.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A clears the hallway and staircases from any clutter.",
        "values": [
          0.0,
          -0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is sitting at the kitchen table organizing a meal-prep plan while Agent B focuses on homework and Agent C cleans their bicycle. The kitchen is filled with sunlight and fresh air, with a scent of citrus in the background.",
    "actions": [
      {
        "description": "Fills a large pitcher with water and places it on the table alongside glasses.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Checks the smoke detectors in the house to ensure they are functional.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Goes for a brisk walk outside to get fresh air and stretch their legs.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Washes hands thoroughly before starting to prepare food.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Takes a moment to stretch and do some light exercises in the living room.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Tidies up the kitchen to eliminate any clutter that could be a tripping hazard.",
        "values": [
          0.0,
          0.1,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Uses the weekend to plan nutritious meals for the upcoming week.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Brings in a fan to circulate air and maintain a comfortable temperature.",
        "values": [
          0.0,
          0.3,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Subscribes to an online class for healthy cooking techniques.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a dietitian, has returned home from running and begins to prepare a nutritious breakfast while Agent B is working on a science project. Natural light fills the well-maintained kitchen, which has a variety of fresh produce and orderly spaces.",
    "actions": [
      {
        "description": "Agent A clears space at the kitchen table for meal prep.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A hydrates with filtered water for the morning.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chops vegetables for a healthy omelette.",
        "values": [
          0.0,
          0.5,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures the blender lid before use.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A performs post-run stretching.",
        "values": [
          0.0,
          0.8,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the room is aired with fresh air.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A declutters the kitchen.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects ripe fruit for bowls.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a spacious kitchen filled with natural light, Agent A, a fitness enthusiast, stands by the countertop looking over a collection of fresh vegetables and lean proteins to prepare a nutritious meal. Agent B, his teen daughter, is at the dining table, studying for her exams. Agent C, A's spouse, enters from the garden carrying a basket of home-grown herbs. The air is subtly fragrant with the scent of those herbs blended with a hint of bergamot from an open window. Agent A begins to pre-wash the vegetables at the sink as Agent C meticulously locks the back door after bringing in the basket, checking twice to ensure it's secure.",
    "actions": [
      {
        "description": "Agent A methodically chops the vegetables, maintaining a clean workspace.",
        "values": [
          0.0,
          0.5,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks that the smoke detector in the kitchen is functional before starting to cook.",
        "values": [
          0.0,
          0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A washes his hands thoroughly with soap and warm water after handling raw proteins.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A regularly sips water from a bottle with a marked hydration tracker while cooking.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A confirms that the first aid kit is within reach and fully stocked.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores the leftover vegetables and proteins in proper containers, labeling them with dates for future use.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B review her study materials while they eat, fostering a supportive environment.",
        "values": [
          0.0,
          0.3,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a quick family stretching session in the living room after dinner to promote a healthy routine.",
        "values": [
          0.0,
          0.9,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures that all kitchen appliances are turned off and the kitchen is clean before leaving the room.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a suburban family home, Agent A is attempting a new pasta recipe in the kitchen, while Agent B is finalizing a home repair, and Agent C manages household paperwork. The setting hints at a well-ordered and attentive environment, pointing to the likelihood of subsequent actions by Agent A that will center around the careful preparation and enjoyment of the meal while also focusing on minimizing risks of accidents.",
    "actions": [
      {
        "description": "Agent A decides to taste-test the pasta to ensure it is cooked al dente rather than relying on a timer.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a fan in the kitchen to circulate air while cooking.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully organizes the kitchen tools and ingredients to create an efficient cooking flow.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pauses to rehydrate with a glass of water during the cooking process.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer to remind themself to check the food at regular intervals.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the food preparation process for any steps that may pose a risk of injury or accident and adjusts accordingly.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up spills on the kitchen floor immediately to prevent any slips.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A dons oven mitts before handling hot pans to protect hands from burns.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks that the stove and all appliances are switched off after cooking.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A carefully prepares a nutritious salad in the kitchen, staying hydrated and contemplating a snack from the fruit basket. The environment is organized with attention to meal prep hygiene and emergency preparation. Agent A's family members are supportive of their actions.",
    "actions": [
      {
        "description": "Agent A uses a knife guard while slicing vegetables to protect their fingers.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A packs some of the prepared salad in a container.",
        "values": [
          0.0,
          0.8,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wipes down the kitchen countertop immediately after chopping.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A does stretching exercises in the living room.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A refills their water bottle from the filter.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks expiry dates on food packages.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the stove and appliances are unplugged.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a brisk walk around the garden.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the kitchen to clear any obstacles.",
        "values": [
          0.0,
          -0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a single parent, wakes up early on a Saturday morning. The house is secure, and a nutritious breakfast awaits Agent B and Agent C. Running gear is ready for a morning jog after completing household chores, and an open first-aid kit needs to be restocked.",
    "actions": [
      {
        "description": "Agent A prepares a nutritious breakfast for when their children wake up.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks and locks all doors and windows.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a shopping list for the first-aid kit.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts on running gear and stretches pre-jog.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carries a water bottle during the jog.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A maintains a moderate jogging pace.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a timer for jogging/walking intervals.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks the door and checks security post-jog.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In a family home, Agent A prepares a grocery list, mindful of the day's activities. Agent B checks household supplies and fixes loose fixtures, while Agent C assembles a puzzle in a tidy kitchen space.",
    "actions": [
      {
        "description": "Agent A heads to the backyard to pick some fresh vegetables from the garden.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes time to stretch and do a few pre-game exercises.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A packs a water bottle and a homemade sandwich for the day's activities.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews and replenishes the family's first aid kit.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer for a power nap before the soccer game.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans an efficient route to the store incorporating physical activity.",
        "values": [
          0.0,
          0.9,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the pantry for ease of access to supplies.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the phone is fully charged before leaving for emergencies.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "Agent A is preparing a recovery smoothie after a morning jog. Agent B is organizing the living room, and Agent C is assembling new shelves. A gentle breeze is coming through the open door, suggesting further interaction with the outdoor environment.",
    "actions": [
      {
        "description": "Agent A puts on gloves and begins to pull weeds out from the vegetable garden.",
        "values": [
          0.0,
          0.5,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After preparation in the kitchen, Agent A secures the tall ladder to clean out the gutters around the roof.",
        "values": [
          0.0,
          0.3,
          -0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully examines the fruits in the garden to select the ripe ones for harvesting.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to rehydrate with a glass of water after outdoor tasks.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Feeling physically taxed, Agent A decides to take a nap to restore vigor before resuming any more work.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cooks a nutritious meal with the freshly picked produce for dinner.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs fire and carbon monoxide detectors throughout the house.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Before bedtime, Agent A checks all the doors and windows to ensure they are secured.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews and updates the home's first-aid kit, replenishing any used or outdated supplies.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety"
    ],
    "scenario": "In the kitchen, Agent A is preparing a nutritious meal with vegetables and proteins while Agent B secures sharp utensils. Agent C arranges the dining table while Agent D enjoys a glass of milk. Fresh air from the garden fills the room.",
    "actions": [
      {
        "description": "Agent A thoroughly washes the vegetables.",
        "values": [
          0.0,
          0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cuts the vegetables uniformly.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks for a fire extinguisher.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to bake the chicken.",
        "values": [
          0.0,
          0.5,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stays hydrated while cooking.",
        "values": [
          0.0,
          0.8,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A monitors the cooking process.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer to take stretching breaks.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores leftover food in airtight containers.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages family to share the meal together.",
        "values": [
          0.0,
          -0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  }
]