[
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A has returned home from a run, Agent B is preparing breakfast, and Agent C is on the couch with headphones. Family exercise and board games indicate a home that values shared activities and well-being.",
    "actions": [
      {
        "description": "Agent A joins Agent B for breakfast prep, playfully tossing strawberries.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent C to a push-up competition with a playful wager.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A brings breakfast over to Agent C and starts a conversation about interests.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A clears the table for a quick card game post-breakfast.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family park walk for the weekend.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family dance-off with upbeat music.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers to teach Agent C new exercises in a joint workout.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B plan a healthy meal plan for the week.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family movie night with healthy snacks.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A joins roommates Agent B and Agent C on a lively Saturday morning to make a communal breakfast, share in chores, and discuss plans for the day, fostering the household's well-being and social connection.",
    "actions": [
      {
        "description": "Offer to set the table for breakfast, arranging the plates and utensils meticulously.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Propose a group workout session for the roommates later in the day.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Engage in a conversation discussing personal goals with Agent B and Agent C.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Suggest organizing the apartment to improve the common living space.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Volunteer to assist Agent C with the heavy lifting during cleaning.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Decide to prepare a healthy fruit salad for everyone.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Take on the duty of opening all the windows for more ventilation while they eat.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Plan a route for an afternoon group walk in a nearby park.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Offer to share an interesting article on nutrition with the roommates.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a university student, comes home for the weekend and joins Agent B and Agent C, their siblings, and Agent D, their parent, in a family-oriented environment. Despite feeling worn out, Agent A engages in family activities and fosters a sense of camaraderie while also focusing on maintaining good health practices.",
    "actions": [
      {
        "description": "Agent A asks Agent B and Agent C to join them for a brief evening walk after dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to help clear the table and wash dishes.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to take a stretching break.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes making a healthy family smoothie.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A plans a balanced meal session with the family.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers homework help for a study session with Agent B.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family game night.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares stress management techniques.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family gardening day.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A enters the kitchen where the family is preparing for dinner, and the home is filled with the smell of healthy food, the sound of children talking, and the cozy evening ambiance.",
    "actions": [
      {
        "description": "Agent A helps Agent B in serving the dinner to the children.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent B a massage after dinner as they relax together.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a spontaneous family dance party in the living room.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family walk outside after dinner.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A helps the children with their physical school projects.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts a family game with light activity.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a healthy snack for everyone to enjoy later.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a tent in the backyard for a family night under the stars.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A demonstrates a new yoga pose to Agent C.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student and avid runner, has just finished a morning run and is making a fruit smoothie in the kitchen. Agent B, a roommate, is cooking breakfast while Agent C, another roommate, cares for a tomato plant at the dining table.",
    "actions": [
      {
        "description": "Agent A offers to take over the breakfast preparation from Agent B to allow them a moment to rest.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to join them for breakfast on the balcony to enjoy the morning sun together.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to initiate a conversation about plans for the upcoming weekend to strengthen their shared bond and coordination.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to do the grocery shopping for the week for all roommates, considering their preferences and dietary needs.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to lead a quick morning stretching session in the living room for everyone.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C by praising their gardening skills and expressing a genuine interest in learning more about it.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen after breakfast without being asked, showing consideration for their roommates.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a communal activity later in the day, such as a movie night or game evening.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A shares their new smoothie recipe with the roommates and offers to make them one as well.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a sunlit kitchen, Agent A and Agent B prepare a pancake breakfast, with fresh fruit and water emphasizing conscious choices for well-being; a teasing exchange of strawberries shows their bond. Agent C approaches the house for a shared meal, reinforcing the sense of connection.",
    "actions": [
      {
        "description": "Agent A suggests to Agent B that they create a new pancake recipe together, combining their favorite ingredients.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "After breakfast, Agent A initiates a board game that involves strategic thinking and physical movement, engaging both of them and Agent C in lively interaction.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join them in a morning jog around the neighborhood, fostering their shared sense of well-being.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Following the meal, Agent A takes the initiative to clean up the kitchen with Agent B, turning the task into a playful competition to see who can tidy up faster.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to share an interesting podcast with Agent B that discusses the benefits of a balanced meal and outdoor exercise.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to Agent B and Agent C to plant a new herb in the garden, highlighting the connection between nature and nourishment.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family photo in the garden following the meal, capturing this moment of togetherness.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A leads a stretch exercise in the living room for everyone to join in after eating.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B decide to prepare a meal kit for Agent C to take home, showing care through their actions.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen making a healthy meal post-exercise, while Agent B works at the table. The home is filled with familial warmth and interaction.",
    "actions": [
      {
        "description": "Agent A invites Agent B to join for a meal, fostering camaraderie.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A plates generous portions, mindful of nutritional replenishment.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shows concern and interest in Agent B’s challenging day.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A brings portions of the meal to Agent C and D, extending care.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A ensures everyone's hydration throughout the meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk to enjoy together time and fresh air.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A listens and interacts with Agent D’s school stories.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up the kitchen, allowing others to relax post meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a post-dinner group game for shared fun.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are siblings preparing a meal together in a well-organized kitchen with a family recipe and engaged in playful banter.",
    "actions": [
      {
        "description": "Agent A initiates a game where they compete to see who can come up with a new dish the fastest.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that they switch tasks to learn from each other's techniques.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes they invite Agent C to join for lunch and get feedback.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to set up the dining table with care, adding a personal touch for each setting.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A starts a playful food fight with Agent B with the leftover slices of pepper.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of their cooking process and the final meal, to document their shared experience.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to take on the challenge of crafting a more complex dish.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A diligently cleans up the kitchen alongside Agent B after cooking, making it an efficiency game.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A opens a conversation about healthy eating habits and how they can maintain them together.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, in his mid-twenties, arrives home to find Agent B cooking dinner and Agent C reading in the living room. The atmosphere is inviting, with the dinner preparation in full swing, embodying the chance for Agent A to recover from his day and to deepen family connections.",
    "actions": [
      {
        "description": "Agent A helps Agent B finish cooking the meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets the dinner table with care.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent C with schoolwork.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories from his day and listens to others'.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A plays a board game with the family.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A skips dinner due to exhaustion.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          -0.5,
          0.0
        ]
      },
      {
        "description": "Agent A retreats to his room, avoiding interaction.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          -0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes a brisk walk after dinner.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A gives up his portion of food if needed.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a smoothie in the kitchen and is joined by her roommate, Agent B, early in the morning. They express a mutual interest in starting the day with a joint workout session and enjoy each other's company.",
    "actions": [
      {
        "description": "Invite Agent B to join in crafting a hearty breakfast post-workout to replenish.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Suggest a joint stretching session with Agent B before heading to the gym.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Discuss with Agent B plans to cycle to a nearby park for an outdoor exercise next weekend.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Offer Agent B a portion of her smoothie to try a new healthy recipe.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Decide to walk to the gym instead of driving to enjoy the early morning air.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Plan to shop for fresh ingredients with Agent B later for a nutritious meal.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Share with Agent B some tips and tricks on maintaining an active routine.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Propose to Agent B to make fresh smoothies again tomorrow as a new morning ritual.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is feeling revitalized after a morning yoga session. Agent B is preparing a fruit salad and Agent C is setting up for painting. They plan to spend a self-care day together sharing stories and creative pursuits.",
    "actions": [
      {
        "description": "Agent A starts preparing a nutritious green smoothie for everyone.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about a recent lecture.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk in the park.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a midday nap session.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A plans a group meditation session.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A curates a personal playlist of music.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A offers to give Agent C supportive feedback.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a shared lunch.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A introduces a fitness challenge.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen preparing a meal with an assortment of fresh ingredients. Agent B is selecting workout music, while Agent C observes Agent A and reminisces about past shared experiences.",
    "actions": [
      {
        "description": "Agent A prepares two plates of food with care.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers a plate to Agent C for dinner.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent B and Agent C in the meal's final touches.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A talks to Agent C about a group project.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts a dance-off with Agent C.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A packs some meal for a friend who's absent.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A playfully does the dishes with Agent C.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A plans a vacation with everyone.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A plans a future \"cook-off\" event.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is prepping a nutritious brunch in a shared apartment with Agent B and Agent C. The setting is relaxed, and there is anticipation for the meal.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to participate in the brunch preparation, assigning them simple tasks.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the table nicely, putting effort into the presentation of the meal.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows wider to let in more natural light and fresh air.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about everyone's plans for the rest of the day.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to teach Agent C a cooking technique used in the brunch recipe.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make a double batch of food so that Agent C can have leftovers for study sessions.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a short group exercise routine after eating to energize everyone for the day.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A plans a quick grocery run to replenish fresh ingredients for the next meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for feedback on the taste and presentation of the meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a meal, Agent B chats in the kitchen while Agent C sets the table.",
    "actions": [
      {
        "description": "Agent A taste-tests and adjusts the seasoning of the meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A explains the recipe to Agent B, sharing cooking tips.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites everyone to help themselves to the prepared meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A leads a toast before eating.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A actively engages in conversation with Agent B.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a board game after the meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C clean up the kitchen together.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A saves leftovers for Agent B.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers to send the recipe to Agent B.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, is preparing for a marathon and is in his room with running gear. Agent B, his roommate, enters the room as they discuss running strategies. The room has an invigorating breeze from an open window and they are expecting Agent C for dinner.",
    "actions": [
      {
        "description": "Agent A chooses to replace his current running shoes with a more supportive pair for the upcoming training session.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A decides to plan a new scenic running route and invites Agent B to join him for the run.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a meal prep station and starts preparing a nutritious meal for the group.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A extends an invitation to Agent C to stay over the night for an early morning running session.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B engage in a deep conversation about their personal strategies for the marathon.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a stretching session in the living room and asks Agent B to join in for collective motivation.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small celebration party post-marathon to appreciate his friends' support.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a short nap to Agent B before their dinner prep to be refreshed and alert while cooking.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A offers to assemble a care package for Agent B who has been feeling under the weather recently.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, is in the kitchen with Agent B, their parent, who is preparing a vegetable stir-fry. Agent C, a sibling, is sitting at the dining table doing homework. Agent A decides to chop vegetables and help with dinner while conversing.",
    "actions": [
      {
        "description": "Agent A decides to prepare a fresh salad to accompany the stir-fry that Agent B is cooking.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests going for a family walk after dinner to enjoy the local park.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a cooking tips exchange with Agent B to learn more about cooking.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A brings Agent C a glass of water, noticing they have been studying for a long time without a break.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent C to a quick card game as a break from homework.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to plan the week's meals together to ensure they are making healthier food choices.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the dining area and sets the table to create a pleasant mealtime atmosphere.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to let in more fresh air while cooking.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to join them in the kitchen to cook together.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a young adult after a long day of work at home. Agent B, their partner, is reading in the living room, and Agent C, their friend, is busy with art in the workout room. The house exudes a cozy atmosphere with gentle lighting and the smell of stew signaling dinner time.",
    "actions": [
      {
        "description": "Agent A invites Agent B and C to join them for dinner and starts a conversation about everyone's day.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table with everyone's favorite cutlery and folds napkins into creative shapes.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a group walk around the neighborhood after dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the kitchen and loads the dishwasher, humming a tune.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites B and C for a board game, fostering a friendly competition.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "During dessert, Agent A shares an amusing work incident with B and C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make a round of refreshing beverages for everyone.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests Agent B take a break from reading and join C’s art for relaxation.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a group stretching session before bedtime.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A spends the day at home, walks into the kitchen where Agent B is cooking, and Agent C is building a miniature greenhouse in the living room. The environment is serene with a gentle breeze and warm sunlight entering the house.",
    "actions": [
      {
        "description": "Agent A assists Agent C with the delicate parts of the greenhouse kit.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A dances with Agent B during a short cooking break.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A discusses what plants to grow inside the greenhouse with Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with complex sections of the recipe.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A gardens outside to add fresh herbs to the meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a taste-test of the dish with Agent B.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing a board game as a family activity.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A hugs Agent B, showing appreciation.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A reminisces fond memories with Agent C through a photo album.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a dedicated homeowner, is in the backyard tending to the garden, while Agent B is cooking in the kitchen. Agent C provides refreshments to Agent A. The house is prepared for an evening gathering, with a focus on shared activities and hospitality.",
    "actions": [
      {
        "description": "Agent A prepares a refreshing fruit salad to add to the dinner spread.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites a neighbor to join the dinner.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a cozy seating area for guests.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes a brisk shower to reenergize.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A ensures all guests are engaged and feel included.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares personal stories with friends.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A personally thanks Agent C for their help.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group photo to capture the night.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy kitchen environment, a teenage girl, Agent A, prepares dinner with her family around, capturing the essence of familial togetherness and care for well-being.",
    "actions": [
      {
        "description": "Agent A carefully arranges the dishes she has prepared on the dining table, keeping in mind each family member's taste.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A brightens the mood by initiating a guessing game on the secret ingredient in her recipe.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes the time to teach Agent D a simple recipe, nurturing his cooking skills.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "During dinner, Agent A stimulates health-conscious dialogue, suggesting lifestyle changes for physical betterment.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family walk post-dinner for collective enjoyment and exercise.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent D engage in an arm-wrestling duel, embracing competitive spirits lightheartedly.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A energizes the evening with an impromptu dance party, raising spirits and family interaction.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "After eating, Agent A instigates a playful race to clean the kitchen with her brother, combining chores and fun.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Observing Agent C's fatigue, Agent A kindly offers to take over his nightly chore, demonstrating thoughtfulness.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is preparing dinner in the kitchen with ingredients laid out on countertops, Agent B watches from the threshold, and Agent C is at the island with a laptop. They are all ready to engage in an evening that includes a shared meal and activities that promote togetherness while preparing food.",
    "actions": [
      {
        "description": "Agent A serves the dinner and invites Agent B and Agent C to join at the table.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Suggests a family game after dinner.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Clean up the kitchen together while dancing.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A reaches out to touch Agent B's hand across the table.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Packs up leftover food to deliver to a neighbor.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Offers to help Agent C with homework.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Initiates a conversation about everyone's day.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Decides to make dessert with Agent C's assistance.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Playfully flicks water at Agent B while washing dishes.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a college student, awake early and reviewing maps for a planned hiking trip, while roommates Agent B is preparing breakfast and Agent C is waking up. The home environment is filled with the morning's activities and the scent of coffee.",
    "actions": [
      {
        "description": "Agent A helps with cooking breakfast, providing a fulfilling meal for the hike.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A packs extra food and water bottles for the trip.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A greets Agent C good morning and invites them to eat together.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the trail’s difficulty level with everyone.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A takes a vote to decide on the trail, considering all preferences.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to carry the heavier backpack.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug to start the day positively.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures all devices are charged for the day.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to share concerns about the hike.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult and avid runner, prepares for a morning run as Agent B, the spouse, sips tea, and Agent C, the child, makes breakfast. Agent A's morning routine sets the tone for a day of balancing personal health and family connection. Agent D, the family dog, also takes part in the home's morning activities.",
    "actions": [
      {
        "description": "Agent A invites Agent B for a morning run, offering to slow the pace for a shared experience.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to accompany Agent C to school by foot, engaging in conversation along the way.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a wholesome and hearty breakfast for the entire family post-exercise.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent C a high-five and a gentle hug expressing pride over Agent C's effort in breakfast preparation.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family hike for the weekend, integrating enthusiasm for outdoor activities with family bonding.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C some basic stretching routines, showing care for Agent C's physical state.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sits down to listen to Agent B's ideas about a healthy meal plan, valuing their input.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A postpones the morning run to comfort Agent C, who seems to be having a challenging morning.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B, two siblings in their 20s, along with Agent C, a close friend, are engaged in meal-prep activities in their apartment’s kitchen, creating a space of warmth and comradery as they cook, chat, and share a collective purpose.",
    "actions": [
      {
        "description": "Agent A enthusiastically instructs Agent B on the nutritional benefits of the dish.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a soup tasting session.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C about their week.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a workout routine.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows for fresh air.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with a recipe step.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A shares a humorous event.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A discusses life goals with Agents B and C.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a special dish for Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B have returned home after work. Agent A shows signs of wanting to engage in active behavior, while Agent B's posture suggests openness to interaction.",
    "actions": [
      {
        "description": "Agent A suggests to Agent B to go for a brisk walk together around the neighborhood.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to cook a nutritious dinner for both.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts cleaning up the living space, motivating Agent B to join.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a workout session and challenges Agent B.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A opens up about a personal dilemma to Agent B.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shares old photos and memories with Agent B.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes making a shared grocery list with Agent B.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A grabs a deck of cards and invites Agent B for a game.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A discusses weekend plans with Agent B to create a joint itinerary.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A arrives home and interacts with Agent B, who's reading on the couch, and Agent C, who is making a salad in the kitchen. A jigsaw puzzle awaits on the coffee table, and fresh fruits are in sight for a potential shared activity.",
    "actions": [
      {
        "description": "Agent A joins Agent B on the couch to help with the jigsaw puzzle.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A opens up about a challenging experience at work while engaging with Agent B.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A heads to the kitchen to assist Agent C with the salad preparation.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A impulsively decides to make a smoothie with the fruits from the bowl for everyone.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the living room to create a more inviting space for interaction.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a blanket from another room to drape over Agent B's legs for comfort.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates planning a weekend getaway trip with Agent B and Agent C.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to join the puzzle activity so the three can spend quality time together.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the balcony or garden to get some fresh herbs and involves Agent C in a little gardening activity.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "'Agent A' is preparing a meal in the kitchen, moving with vigor and expertise. 'Agent B' enters the scene, and they share a cozy moment of connection amid the bustling kitchen environment.",
    "actions": [
      {
        "description": "'Agent A' pauses their meal prep to reciprocate 'Agent B's hug with warmth.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "'Agent A' asks 'Agent B' about their day while cooking.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "'Agent A' makes 'Agent B's favorite dish as a surprise.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "'Agent A' playfully feeds 'Agent B' a piece of vegetable.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "'Agent A' takes a break to dance with 'Agent B' in the kitchen.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "'Agent A' invites 'Agent B' to taste the sauce and give feedback.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "'Agent A' teaches 'Agent B' a new cooking technique.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "'Agent A' sets aside a dish to take to a neighbor.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "'Agent A' sits with 'Agent B' to enjoy the meal and discuss future plans.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A prepares a colorful fruit platter for a family gathering. Agent B softly strums the guitar while Agent C reads on the living room rug in a warm, breezy setting.",
    "actions": [
      {
        "description": "Agent A invites Agent C to creatively arrange the fruit platter.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A opens the window wider to let in more air and chats with Agent C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers to play a guitar duet with Agent B.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for song requests to play together.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to read aloud for a storytelling session.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes a quick jog around the backyard.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to play a board game.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates space for a small dance area.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories of healthy cooking over a campfire.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "A college student, Agent A, is hosting a weekend brunch in their spacious kitchen, while their roommate Agent B is lounging with a guitar and their visiting friend, Agent C, plays with a deck of cards. The environment is filled with the aroma of cooking, sunlight, and a warm breeze.",
    "actions": [
      {
        "description": "Agent A chops additional vegetables to add variety to the salad.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game of charades while waiting for the food to cook.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers a taste test of the brunch to Agent B.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to play a lively tune on the guitar.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A delegates tasks by asking Agent C to set the table.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A decides to prepare a fresh smoothie with the fruits.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk outside after brunch.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to play a card game after they eat.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the living room to make more space.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student living with roommates, is in the common area after finishing a workout session. Agent B is preparing a meal in the kitchen, and Agent C is working on a laptop, occasionally watching the cooking process. The aroma of the meal and the relaxed atmosphere set the stage for future interactions.",
    "actions": [
      {
        "description": "Agent A offers to help Agent B with meal preparations.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to set up the dining space.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent C in conversation about their respective days.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes a quick shower after the workout session.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares an interesting story from their workout.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to let in fresh air.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A grabs a bottle of water to rehydrate and offers water to others.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a game or activity after eating.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A selects a playlist of upbeat music during the meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a fitness enthusiast getting ready for his workout as Agent B makes a smoothie and their child, Agent C, joins the morning routine. Agent A engages with Agent C, who shows interest in developing healthier habits.",
    "actions": [
      {
        "description": "Agent A invites Agent C to join in his workout, showing basic exercise moves.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A blends extra smoothie to share with Agent C, explaining the benefits of each ingredient.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows wide to let in morning air and sunlight while exercising.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a space on the living room floor with extra yoga mats for Agent C to join.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C set a shared goal for a running distance for the week.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sits down with Agent C after the workout to plan a weekly meal plan emphasizing wholesome nutrition.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C about the importance of staying hydrated throughout the day.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent C to a plank-holding competition.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A demonstrates correct exercise postures and breathing techniques to Agent C.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a homemade meal in the kitchen, with Agent B working on a laptop and Agent C doing homework at the dining table. A calm and homely atmosphere is set by cooking aromas and soft music, with sunlight streaming through the windows.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to help her prepare the meal by washing vegetables.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside her cooking to help Agent C with a difficult homework question.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts a spontaneous dance with Agent B in the kitchen as a favorite song comes on.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests turning off all electronic devices at the dinner table to have a conversation about everyone's day.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to share a story from school today while setting the table together.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A puts an extra serving of vegetables on Agent C's plate to ensure a nutritious meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A organizes a short family walk outside to enjoy the fresh air.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family game night after dinner to promote family bonding.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B decide to prepare a weekend meal plan together to balance their responsibilities and family time.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a surprise breakfast for Agent B, who's still asleep. The kitchen is bathed in morning sunlight, and a variety of breakfast foods are laid out on the counter. A table is beautifully set for two, complete with a carafe of orange juice and a bouquet of flowers.",
    "actions": [
      {
        "description": "Agent A gently wakes up Agent B with the aroma of freshly brewed coffee.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A writes a heartfelt note and places it on Agent B’s plate before they come to the table.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to skip their usual morning workout to spend more time with Agent B during breakfast.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A carries the plates of breakfast to bed, transforming the meal into a breakfast-in-bed experience for Agent B.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A attentively listens to Agent B's description of a dream they had, ensuring a feeling of being heard and understood.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes the initiative to clean up the kitchen after the breakfast to maintain a pleasant living space for both.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A chooses not to check work emails during breakfast to provide undivided attention to Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a morning walk after breakfast, to enjoy the fresh air together and start the day with activity.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A ignores a personal phone call during breakfast to stay in the moment with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a suburban home kitchen, Agent A, a home cook and fitness enthusiast, prepares a family meal using fresh ingredients, including herbs from Agent B's garden. Agent B, who loves gardening, joins in the cooking, while Agent C, the visiting cousin, engages from the dining area. The environment is filled with natural light and open spaces.",
    "actions": [
      {
        "description": "Agent A decides to include fresh herbs from Agent B's garden in the meal preparation.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that they all partake in a light stretching routine after the meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A offers to teach Agent C a simple and nutritious recipe.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A turns on some music to create a lively atmosphere as they cook.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group activity to clean up the kitchen after the meal.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows to let in additional natural light and fresh air.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the dining table with care.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a toast expressing gratitude for the quality time spent together.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about everyone's recent experiences.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen making a nutritious breakfast smoothie while Agent B sets the table and Agent C lets in the morning air. They share a smile and eye contact, starting the day together.",
    "actions": [
      {
        "description": "Agent A turns on lively music to create a rhythmical ambiance.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A playfully tosses a strawberry to Agent C.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A talks with Agent B about their day.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A gets Agent C involved in breakfast preparation.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A walks Agent B to school, enjoying the morning.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A places a caring note in Agent B's lunchbox.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A plans the day with Agent C, considering everyone's wishes.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A enjoys breakfast and expresses gratitude with the family.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares a warm hug with Agent C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a parent in a cozy weekend morning kitchen scene, involving breakfast preparations with Agent B and study engagement with Agent C.",
    "actions": [
      {
        "description": "Agent A gently adjusts Agent C's sitting posture.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with dicing fruit.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A removes Agent C's headphones to chat about study topics.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a book for Agent C's studies and discusses it.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family yoga session.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests Agent B take a break and enjoy the morning view.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows for fresh air and light.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family walk around the neighborhood.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A starts a family planning meeting for the upcoming week.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a fitness enthusiast, wakes up early and quietly navigates the shared space with roommate Agent B, who is asleep on the couch. Agent A finds Agent C in the kitchen, making a morning smoothie. A sense of quiet camaraderie is present as they exchange non-verbal cues of acknowledgement.",
    "actions": [
      {
        "description": "Agent A prepares a second smoothie and leaves it in the fridge with a note for Agent B.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A opts not to turn on the music while stretching to not wake Agent B.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join them for the morning run.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A leaves a motivational quote on the whiteboard in the kitchen for Agent C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A chooses a peaceful running trail to appreciate nature.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows for fresh air without making noise.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A smiles at Agent C, offering a quiet gesture of companionship.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A rests their hand on Agent C’s shoulder as a sign of support.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A places extra sneakers near the door for Agent B.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a suburban home on Sunday, Agent A is cooking brunch in the kitchen, Agent B is reading at the island, and Agent C is setting the table. The atmosphere is warm and lively with an open window letting in sunlight and a breeze.",
    "actions": [
      {
        "description": "Agent A makes a fruit salad with everyone's favorite fruits.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A entertains by flipping pancakes in the air.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A opens the window wider for more fresh air and sunlight.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A changes the music to a more lively beat.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a post-brunch walk to the park.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A involves B and C in meal preparation.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A starts a game of charades with everyone.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A waits to share the food tasting experience.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plans to share food with the neighbor.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A enters the kitchen to find Agent B making breakfast. The atmosphere is lively with cooking sounds and morning light.",
    "actions": [
      {
        "description": "Agent A sets the table with utensils and plates.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A pours two glasses of water for hydration.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A helps flip pancakes at the stove.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A opens the window to let in fresh air.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about the day's plans.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shares a new coffee blend with Agent B.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A slices fruit for breakfast.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a walk outside after eating.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, after a long day, arrives home where Agent B is cooking and Agent C is setting up a cozy ambiance. They interact warmly with the environment and each other.",
    "actions": [
      {
        "description": "Agent A helps Agent B by chopping vegetables for the meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a group photo with Agent B and Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes the group for a brisk walk after dinner.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C rearrange the furniture.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A looks for a board game to play.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A turns off the television to encourage conversation.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers to wash the dishes, allowing Agent B to relax.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares a story about their day with Agents B and C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A keeps everyone hydrated by refilling water glasses.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a complex meal in the kitchen while teaching Agent B. Agent C is setting up the dining area for a family dinner. The house is filled with the aroma of the dishes being prepared, contributing to the family's anticipation of the meal.",
    "actions": [
      {
        "description": "Agent A sets aside a portion of the dish he is preparing, knowing Agent B enjoys this particular flavor.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to help him knead dough for the bread, offering guidance and praising her efforts.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A carves out time to teach Agent B how to properly garnish a dish for visual appeal.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a taste-testing game with Agent B, using blindfolds to educate her palate.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A openly shares a cooking failure with Agent B, turning it into a learning moment.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk post-dinner to encourage digestion and family bonding.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A skips his own meal to ensure there is enough food for his family.",
        "values": [
          0.0,
          -1.0,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A stays up late preparing food for Agent B's school event, despite needing to wake up early the next day.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent B in planning the next week's meals, taking her preferences into account.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a culinary enthusiast, is in the kitchen preparing a salad for a family dinner. Agent B, their partner, and Agent C, their adolescent child, join Agent A in the kitchen. Agent B opens the window to let in the breeze and starts to wash berries while Agent C places a board game on the kitchen table.",
    "actions": [
      {
        "description": "Agent A suggests a spontaneous dance-off to some upbeat music while they cook.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a light stretching session in the living room after dinner.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about everyone's dreams and aspirations.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a walk in the nearby park after the meal.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to choose their favorite board game to play as a family.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a taste test game with the ingredients.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes turns sharing heartfelt stories from their past.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a quick cleaning spree after the meal.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A plans a detailed menu for the next week.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a home kitchen, Agent A is enthusiastically cooking a meal, engaging in conversation with lounging friend Agent B and teasing family member Agent C. The environment is lively, and the strong aromas complement the warm and friendly interaction among them.",
    "actions": [
      {
        "description": "Agent A meticulously plates the prepared dishes with garnishes.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to join meal preparation.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table to facilitate conversation.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a toast to celebrate their friendship.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A orchestrates a guessing game for ingredients.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a storytelling session during dinner.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking turns cooking.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A offers to clean up after the meal.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A crafts handmade thank-you notes.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, smells pancakes and wakes up to join Agents B and C in a shared breakfast in their cozy apartment, considering a walk in the park afterwards.",
    "actions": [
      {
        "description": "Agent A assists with breakfast preparation in the kitchen.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A turns on music to liven up the breakfast atmosphere.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about everyone's week.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a group cleaning session.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A makes fresh juice for everyone.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A brings a board game to the table for after breakfast.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites friends for a walk to energize.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers to plan task allocation for the week.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A checks on Agent C’s wellbeing.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B, are preparing breakfast in the kitchen. Agent C is drawing a family portrait in the living room. There's a heartwarming and gentle ambiance, with nutritious food being cooked and a bright weekend morning light bathing the house.",
    "actions": [
      {
        "description": "Agent A crouches down beside Agent C to attentively examine the drawing, offering genuine praise and asking about each detail.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a break from cooking and sits with Agent C on the floor, adding a few touches to the family portrait.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes a picture of Agent C's drawing to save it as a keepsake and share it with distant family members.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help set up the dining table, asking for their preferred choice of napkins to involve them in the decision-making process.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a spontaneous game of tag around the house with Agent C, carefully ensuring that the activity is safe but thrilling for them.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A includes a note in Agent C's lunchbox with words of encouragement, knowing they will find it the following school day.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A pretends to mishear the ingredients Agent B asks for, turning it into a playful quiz for Agent C to correct them.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A grabs a spare apron, encouraging Agent C to join them in the final stages of meal preparation.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a cushion fort in the living room using blankets, promising an adventure tale after breakfast.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B, both in their twenties, are in their new apartment surrounded by boxes after moving. The kitchen emanates a pleasing coffee aroma, and Agent A prepares a meal amid the unpacked items, while Agent B is busy with furniture assembly.",
    "actions": [
      {
        "description": "Agent A prepares a nutritious meal for both of them, keeping in mind their preferences.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A creates a relaxed and casual eating space on the floor, offering an indoor picnic.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A does stretching exercises to break up the unpacking routine.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a spontaneous dance to uplift the mood.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk outside for a change of scenery and some exercise.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to cook at home rather than order takeaway for dinner.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A chooses a podcast to make the work environment more lively.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A stays up late to finish arranging kitchen wares.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shares a photo album, revisiting memories together.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In the sunlit kitchen, Agent A prepares a homemade dinner. Agent B interacts with a family photo album, and Agent C is within conversation distance. Fresh vegetables await preparation, and an open door lets in a breeze.",
    "actions": [
      {
        "description": "Agent A invites Agent B to chop vegetables, facilitating a collaborative cooking experience.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table with care, creating a welcoming atmosphere.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group storytelling session with fond memories.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A tosses a kitchen towel to Agent C for dinner prep involvement.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A steps outside for a breath of fresh air before returning to cooking.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a group walk after dinner for exercise and quality time.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A selects a playlist of everyone's favorite songs during cooking and dining.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A brings the photo album to the table to share memories during the meal.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to choose a preferred dish from the menu.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is preparing brunch with Agent B and Agent C in a sunlit kitchen with fresh coffee aroma and gentle music, engaging in a collaborative and warm family tradition.",
    "actions": [
      {
        "description": "Agent A makes a smoothie suggested by Agent C and gives a fun tutorial.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk to the farmer's market after brunch.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game to choose the next family movie based on creative dish ideas.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B on the table setting and expresses appreciation.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A surprises Agent B by preparing a special dish they wanted to try.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A discusses and affirms Agent C's smoothie flavor preferences.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A turns cleaning up into a fun activity with music and dance.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal cooking-related childhood story.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a gratitude sharing moment during the meal.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is hosting Agent B for an informal visit, with Agent C also present in a cozy and nostalgia-filled living room. They discuss past adventures and consider future activities while enjoying the comfort of the shared space and the invigoration of fresh air.",
    "actions": [
      {
        "description": "Agent A decides to look at an old photo album with Agent B and Agent C for a trip down memory lane.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A offers to blend up fresh smoothies in the kitchen for a revitalizing beverage as they continue talking.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes taking a leisurely walk outside to take in the fresh air and some light physical activity.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A modifies the lighting by adjusting the window blinds for a brighter, uplifting room atmosphere.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A reorganizes the living room by stowing away the puzzle, opening space for engagement.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A introduces Agent B to the homegrown herb garden, sharing a piece of his daily life.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Through a friendly debate about future hiking trails, Agent A incites excitement for collective adventures.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes care of Agent C's comfort by providing a blanket, maintaining a warm and welcoming spot.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets a mellow mood by playing soft music, subtly enhancing the warm ambiance of the gathering.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, is home for the weekend to spend time with his family. Agent B, his mother, is baking bread in the kitchen, and Agent C, his father, is busy fixing a leak in the backyard. There's an air of casual warmth and familial activity in the house.",
    "actions": [
      {
        "description": "Agent A decides to help Agent B by kneading the dough for the next batch of bread.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to sit with Agent B in the kitchen, engaging her in a conversation about her new baking hobby.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers to take over Agent C's task of fixing the tap to give his father a rest.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts a playful water fight with Agent C while helping in the yard, using the garden hose.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game night to bond and share laughs after dinner.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A, seeking to relive childhood memories, persuades the family to go through old photo albums together.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a collaborative family project to repaint and redecorate his younger sibling’s room.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join him for an early morning jog the next day to catch up and share alone time.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A stays up late chatting with Agent C in the living room, sharing experiences from college and childhood.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, physically drained from an afternoon of gardening, is in a house filled with the enriching aroma of a nutritious smoothie crafted by their spouse, Agent B. Agent C, relaxed and immersed in reading, and Agent D, who is sketching out a treehouse, are also present.",
    "actions": [
      {
        "description": "Agent A takes a refreshing shower.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A gives feedback on Agent B's smoothie.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A engages with Agent C about their book.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A helps in setting the dinner table.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk in the evening.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the treehouse plans with Agent D.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a meeting to plan the treehouse building.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a healthy family snack.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family exercise routine for the next day.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a home setting, Agent A prepares a healthy meal, Agent B hydrates after exercise and engages in light-hearted conversations about a communal event, and Agent C stirs a pot while reminiscing, creating a backdrop of familial warmth.",
    "actions": [
      {
        "description": "Agent A offers to make post-workout smoothies.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B for a neighborhood bike ride.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B plan a balanced weekly menu.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A hugs Agent C, showing gratitude.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests an evening walk with the family.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A creates a family exercise routine.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B clean the kitchen with a dance-off.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows for better airflow.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B plan a training schedule.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult, comes home from work to find Agent B, a college student and sibling, has prepared dinner. The scent of fresh pasta fills their shared apartment. Agent C, a neighbor, briefly stops by to return a borrowed cookbook, highlighting shared culinary interests among them.",
    "actions": [
      {
        "description": "Agent A starts cooking a dish to add to the dinner, using fresh ingredients.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A extends an invitation to Agent C for dinner to discuss the cookbook.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shares old memories with Agent B and Agent C using a photo album.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sends messages to friends to set up a cooking and tasting event.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with the cleanup after dinner to have more interaction.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a communal dinner in the future with contributions from each person.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C for a morning jog for an active start to the next day.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a movie night considering everyone's favorite films.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A plans a joint deep-cleaning day with the apartment's occupants.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, after a day of remote work, joins Agent B, their spouse, in the kitchen where a meal is being prepared and Agent C, their child, is setting the table. The house is filled with the smells of cooking, and the family is engaging in light-hearted conversation and activities.",
    "actions": [
      {
        "description": "Agent A washes their hands and helps Agent B chop vegetables for the meal.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A playfully tosses a lettuce leaf at Agent C, sparking a light-hearted food fight.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a selection of spices and discusses flavor combinations with Agents B and C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers a warm hug to Agent B from behind while they are cooking.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a speaker and plays a family-favorite playlist.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C have a quick dance-off.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A tells Agent C about their day, sharing successes and amusing mishaps.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes a few playful photos of the meal preparation.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a teamwork activity for timing meal components.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A begins the day by cooking a homemade breakfast while Agent B is asleep and Agent C is writing at the dining table.",
    "actions": [
      {
        "description": "Agent A meticulously dices vegetables for the omelette, considering the pieces' size for consistent cooking.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A exchanges morning pleasantries with Agent C, showing interest in their written reflections.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A makes additional portions of breakfast to pleasantly surprise Agent B.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A converses with Agent C to plan joint activities for the day.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A wakes Agent B softly to foster a positive start to their day.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets the breakfast table, arranging it invitingly.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C on a morning walk to enjoy fresh air and discuss plans.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A leaves a positive note for Agent B by their breakfast plate.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A shares a recipe and cooking advice with an eager Agent C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a teen athlete, arrives home with groceries and starts to prep a balanced dinner, engaging with Agent B, who is doing a puzzle, and Agent C, who is getting the kitchen ready. The home is filled with a sense of comfort, and the evening air breezes through an open window.",
    "actions": [
      {
        "description": "Agent A starts preparing a hearty meal using the groceries bought.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A decides to create a variety of dishes involving Agent B.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a kitchen dance party while cooking.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk post-dinner.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a comfortable dining space for the family.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to leave leftovers while serving.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A decides on an early bedtime for rest.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites B to an evening workout or stretching.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A encourages conversation during dinner.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, is in the kitchen preparing a nutritious meal. Agent B, her sibling, is observing, and Agent C, a parent, is nearby in the living room. The scene is set for a peaceful family evening centered around a homemade dinner.",
    "actions": [
      {
        "description": "Agent A invites Agent B to help with peeling vegetables for the stew.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for suggestions on how to garnish the dishes.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A serves everyone at the table, ensuring each person gets their preferred portion.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk after dinner to aid digestion.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plays soothing music during the meal for a relaxing atmosphere.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about how everyone's day was.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen with Agent B, making a game out of it.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers to plan future meals together with family input.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes leftovers in labeled containers for future lunches.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a nutritionist, joins Agent C in the kitchen where a smoothie is being prepared, and they share a moment together. Agent B is working in the living room.",
    "actions": [
      {
        "description": "Agent A decides to prepare a nutritious brunch for the family.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A plans to accompany Agent C on a morning jog.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C taste-test a new recipe together.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C prepare a meal plan.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family stretching session.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A collaborates with Agent B on a healthy living infographic.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes a short nap.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A starts a gardening project with Agent C.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A engages the family in a conversation over brunch.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A finishes work and is preparing dinner while Agent B works on handicrafts and Agent C stretches after a workout. The family shares space and enjoys a pleasant evening.",
    "actions": [
      {
        "description": "Agent A invites Agent C to help set the table.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to share insights about their handicrafts.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to open the windows to allow fresh air to circulate.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family walk.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family dance party.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "While cleaning up, Agent A makes it a playful game.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family meditation session.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to review Agent C’s workout routine.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A provides a massage for Agent B.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is preparing for a workout in their home gym where Agent B is stretching on a yoga mat. The siblings are engaging in a morning filled with physical activity and conversation, while Agent C is making pancakes in the kitchen below.",
    "actions": [
      {
        "description": "Agent A decides to cook a nutritious post-workout meal to share with Agent B.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join in on a new high-intensity interval training (HIIT) routine.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes turns with Agent B using the treadmill, discussing future plans during rests.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B cooperate to create a fun, family-friendly obstacle course in the backyard.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to a push-up contest, spurring a friendly competition.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B plan a grocery list focused on fresh, wholesome ingredients.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B a relaxation technique learned from a fitness magazine.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "After their workout, Agent A and Agent B prepare a fresh fruit smoothie.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B spend time organizing the gym equipment, enhancing their shared space.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a college student who recently moved back in with their parents, Agent B and Agent C, during a college break. The family is gathered in the kitchen with a spread of ingredients laid out. Agent A walks in hungry and desiring to join the cooking after an evening run.",
    "actions": [
      {
        "description": "Agent A decides to help chop vegetables for the salad.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table, placing utensils and napkins for everyone.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make smoothies using the ripe fruit on the counter.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A tells a funny story about one of their recent workouts to lighten the mood.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent C a gentle, encouraging nudge when they struggle with the recipe.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invents a new salad dressing, experimenting with flavors.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a short dance break with Agent B and Agent C to energize.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A fetches water bottles for everyone to stay hydrated through the cooking.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a quick game of charades while waiting for the dinner to cook.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, is in the kitchen of their shared apartment preparing a meal. Agent B, Agent A's roommate, is on the kitchen stool sipping a glass of chilled water while scrolling through their phone. Agent C, another roommate, is at the dining table, doodling in a notebook, and occasionally glancing towards the kitchen with a yawn.",
    "actions": [
      {
        "description": "Agent A puts extra effort into making a nutritious meal that includes a variety of ingredients to cater to everyone's tastes.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent B in conversation about their respective days, asking questions and listening attentively.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to assist with preparing the meal to create a collaborative atmosphere.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A notices Agent C looking tired and offers some of their freshly made smoothie for a quick refreshment.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A decides to set the dinner table with care, placing each item thoughtfully to make the shared meal more pleasant.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a game where each roommate shares an amusing or interesting fact while they dine.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A starts cleaning up the kitchen immediately after the meal to provide a tidy space for everyone to enjoy post-dinner relaxation.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a short group exercise session after dinner as a way to spend time together and re-energize.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a photo album and reminisces about past fun times, inviting Agents B and C to join in on the memory sharing.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A prepares a nutritious breakfast and spends a peaceful yet engaging morning with family members Agent B and Agent C, fostering a caring and active atmosphere at home.",
    "actions": [
      {
        "description": "Agent A wakes up Agent B with a gentle kiss and the enticing smell of coffee.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sits down to help Agent C plan their school project, giving focused attention and advice.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A playfully challenges Agent C to a race to get ready for school, adding joy to the morning routine.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a discussion about everyone's plans for the rest of the day, promoting a sense of unity.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family walk after dinner to talk more and enjoy the evening together.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal story from the past, drawing connections between family members.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a spontaneous game of charades after breakfast to energize the morning.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A hugs Agent B, expressing affection before they both start their busy workdays.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to make a new breakfast recipe requiring multiple steps, demonstrating care in meal preparation.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a nutritious lunch in a cozy, sunlit kitchen, sharing the space with Agent B, who is working on a crossword puzzle at the table, and Agent C, who is composing music on the couch in the adjacent living room.",
    "actions": [
      {
        "description": "Agent A adds an extra pinch of spice to the dish, aiming to tailor the flavor to Agent B’s preference.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A turns off the stove to join Agent B at the table, helping solve the more challenging crossword clues.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A starts a lively conversation with Agent C from the kitchen, discussing the new melody and suggesting a family jam session after lunch.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A leans over to share a quick hug with Agent B, expressing affection without words.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to choose the afternoon’s playlist and connects the phone to the speakers, filling the home with music.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside a plate of cut fruit for Agent C, acknowledging a shared enjoyment of healthy snacks.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A intentionally leaves the leftovers accessible, allowing Agent C to practice cooking by preparing their own plate later.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent C to a light-hearted cooking competition for dinner, promising a reward for creativity and effort.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to take a break from the puzzle to stretch and take a short walk together around the garden.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a recent college graduate and cook, is preparing a balanced meal in the kitchen with the windows open for fresh air. Agent B is lounging on the sofa while Agent C adjusts natural light for photography in the home.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to join him in the kitchen to learn a new cooking technique.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers some meal prep tasks to Agent B.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside a portion of the meal for Agent C to photograph.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A recommends a weekly meal-prep event with roommates.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about nutrition and wellness.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A compiles a shared shopping list with roommates.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plans to cook extra to share with a neighbor.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk to the farmers' market after the meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a kitchen cleanup race post-meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agents A, B, and C are siblings enjoying a Saturday morning together. Agent A is preparing breakfast, Agent B hydrates after a run, and Agent C is playing guitar. A warm and cooperative environment is fostered as they engage in activities throughout the morning.",
    "actions": [
      {
        "description": "Agent A serves the breakfast.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sits down to enjoy the meal and talks about plans.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join in a yoga session.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a jam session.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a group meditation.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a dance-off.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a board game.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B with a project.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult, has finished a home-cooked meal with their roommate Agent B. As a cozy evening settles in their apartment, they engage in activities that strengthen their bond and take care of their comfort.",
    "actions": [
      {
        "description": "Agent A helps clean up after dinner and washes the dishes.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a brisk walk outside for fresh air with Agent B.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game of charades they used to play in college.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to cook a nutritious breakfast for both in the morning.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A brings a blanket to Agent B, noting the chill in the room.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A chooses a record to play that signifies a poignant moment from their shared past.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A cracks open a window to let in some cool, fresh evening air.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A engages in deep conversation about future aspirations with Agent B.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to rearrange the living room for a mini indoor workout session together.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, is cooking dinner for the family as Agent B watches and Agent C sets the table. The kitchen is adorned with the pleasant evening light and is filled with the blend of music and cooking sounds.",
    "actions": [
      {
        "description": "Agent A puts extra effort into making a dish that Agent B loves, recalling the steps from memory.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help spice the dish, turning it into a mini cooking lesson.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to bake a dessert despite the additional time and effort.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A lets Agent C taste the sauce and asks for their opinion, attempting to include them in the cooking process.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A suggests a walk with Agent B to discuss the highlights of the day.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen hastily to have more time to spend in conversation with the family.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories about the origin of the recipes while cooking, engaging Agent B and C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "During dinner, Agent A encourages everyone to share one good thing that happened to them that day.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A becomes overly invested in cooking and neglects to ask if others would prefer a different menu.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          -0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In the kitchen, Agent A prepares a nutritious breakfast, Agent B enters and is welcomed warmly, and Agent C brings in laundry, adding to the homely ambiance with the windows letting in fresh air.",
    "actions": [
      {
        "description": "Agent A begins the day with stretches to a fitness channel, including Agent B.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A requests Agent C's help with making juice while planning the day.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A uses leftovers creatively for breakfast to reduce waste.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a fun cleanup game post-meal with Agents B and C.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts a herb garden on the windowsill with Agents B and C’s opinions.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk to the park after eating.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A serves breakfast, ensuring face-to-face seating for conversation.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A attentively asks Agent B to share any troubling thoughts.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A plans to share extra breakfast with a neighbor for companionship.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, is at home during his break. With warm sunlight filling the kitchen, he joins his brother, Agent B, who is preparing ingredients for a new breakfast recipe, and his cousin, Agent C, who reads the newspaper. The morning is peaceful, with the anticipation of a later jog lingering in the air.",
    "actions": [
      {
        "description": "Agent A helps Agent B with prepping breakfast, guiding him on chopping vegetables.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A has a conversation with Agent C about a newspaper article.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B during breakfast preparation.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a garnish competition with Agent B.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares orange juice with Agent C and discusses daily plans.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B for a challenging jog.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows for fresh air.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A leaves the last toast for Agent B.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A leads a stretching session with Agent B.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen, preparing a meal with a variety of fresh ingredients, while Agent B and Agent C play cards at the dining table, immersed in laughter and friendly conversation.",
    "actions": [
      {
        "description": "Agent A portions out part of the prepared meal onto a separate plate for Agent B.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A joins the card game momentarily to tease Agent B.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets the dining table with extra care, placing favorite condiments for Agent B and C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A laughs at a joke made by Agent C, showing appreciation.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk together after the meal to enjoy the evening.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers a taste test of the meal to Agent B and C.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up a spill made by Agent B without fuss.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts a group conversation about upcoming weekend plans.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A reminds Agent C to drink water, noting Agent C’s neglected hydration.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In the kitchen, Agent A takes out ingredients and begins to cook. Agent B watches and Agent C is drawn by the activity. The environment is relaxed and familial. Agent D arrives from exercising, sharing a thank-you letter from a neighbor.",
    "actions": [
      {
        "description": "Agent A encourages Agent B and Agent C to try preparing various dishes.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a mini competition for the most artistic garnish.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a walk with everyone after dinner.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A decides to dine outdoors to enjoy the breeze.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A starts a dialogue on memorable cooking stories.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent D in the tasting process.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C a coordination-improving exercise.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A turns off the music to listen to nature.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A takes on cleaning duty solo.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          -0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy, well-lit kitchen, Agent A is prepping a colorful array of vegetables for a family dinner, joined by Agent B and Agent C, setting a stage for sharing and cooperative cooking.",
    "actions": [
      {
        "description": "Agent A decides to let Agent B guide them through the new recipe, showing trust and willingness to learn.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A tasks Agent C with selecting the music playlist to set the mood for their cooking activity.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to improvise with what is available, showing resourcefulness.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game where they all guess the spices by smell.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to join in the cooking rather than observing.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A plans the meal to include a surprise dessert.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Despite being tired, Agent A persists to ensure the ingredients are well-prepped.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A insists on serving everyone else first.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that they clean up together after dinner.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home, during the early hours of a weekend, Agent A is preparing for a morning workout in the spacious living room. Agent B is at the kitchen table with a jigsaw puzzle, and Agent C arranges ingredients for breakfast. The environment is vibrant and active.",
    "actions": [
      {
        "description": "Agent A offers encouragement to Agent B as they struggle with a piece of the jigsaw puzzle.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join the workout, suggesting they could both benefit from the shared activity.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to cut the workout short to help Agent C with preparing a breakfast for all.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a playful challenge against Agent B, seeing who can complete a set of physical tasks faster.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a replenishing drink for Agent C, acknowledging their effort in making breakfast.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a system of quick exercises for all household members to join during the day.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the workout area, ensuring the space is orderly and safe.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A brings Agent B's favorite music playlist to lift the mood during their tasks.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A observes Agent B’s technique on the puzzle and gives gentle feedback.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a family kitchen, Agent A finds a healthy recipe in a cookbook as lunchtime nears. Agents B and C are engaged in meal preparation tasks, and Agent D is playing piano. Agent A plans to make a surprise meal.",
    "actions": [
      {
        "description": "Agent A decides to cook a nutritious meal for the family, using the recipe he found in the cookbook.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A starts a lively conversation about food and health with Agent B and Agent C, discussing the preparation of the meal.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A includes Agent D in the meal preparation, asking him to set the table to involve him in the family activity.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A opts to make extra portions of food to ensure everyone has enough to eat and even some leftovers.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a quick grocery run to purchase missing ingredients needed for the new recipe.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to let in fresh air while cooking, refreshing the kitchen environment.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A encourages the family to have a picnic in the backyard to enjoy the meal together in the open air.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A skips contributing to the meal prep altogether, choosing to sit back and let Agent B and Agent C handle it alone.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          -0.7,
          0.0
        ]
      },
      {
        "description": "Agent A intentionally makes a spicy version of the meal knowing that some family members prefer milder flavors.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          -0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a fitness enthusiast, is preparing a post-workout meal while engaging with his visiting cousin, Agent B, and significant other, Agent C, who is practicing yoga. The setting is a calm and sunlit kitchen in their home conducive to engaging interactions.",
    "actions": [
      {
        "description": "Agent A offers to prepare a special nutrient-rich smoothie for Agent B and Agent C.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent B about the benefits of different protein sources.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C on the patio for a yoga cooldown session.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites both Agent B and Agent C to join him in meal planning for the upcoming week.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to a friendly plank competition to see who can hold it longer.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A decides to schedule a group hiking trip the next morning to enjoy nature and promote active relaxation.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to share her yoga knowledge, expressing interest in incorporating it into his daily routine.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small celebration for Agent B's recent graduation, including a healthy homemade cake and some close friends.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests an impromptu dance session in the living room with upbeat music to rejuvenate everyone.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, after a rejuvenating run, returns home to find Agent B making a smoothie and Agent C looking at a photo album. The atmosphere is light-hearted, the house is airy and welcoming, offering choices for activity or relaxation.",
    "actions": [
      {
        "description": "Agent A decides to join Agent B in making the smoothie, playfully tossing pieces of fruit into the blender.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes a quick shower to refresh after the run, then prepares a nutritious breakfast for themselves and Agent B.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A opts to forego the breakfast preparation and instead sits with Agent C to look at photos, laughing and sharing stories.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows throughout the house to increase the circulation of fresh air.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A grabs a glass of water to rehydrate after the run.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to join in a yoga session to further promote their physical wellbeing.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to take a nap on the couch, drained from the run, ignoring both the smoothie-making and the shared memories with Agent C.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          -0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to challenge Agent B to a playful smoothie-making competition to see who can create the tastier beverage.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A goes outside to the garden to meditate, seeking tranquility after their exercise.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are siblings preparing for dinner with their father, Agent C. The home environment is cozy, dinner is nearly ready, and fresh air is coming through the open windows as Agent A rests post-jog and Agent B studies.",
    "actions": [
      {
        "description": "Agent A puts the book down, stretches, and offers to help set the table.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent B a break to jointly engage in plating the dinner.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B for a light walk outside for fresh air.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares a funny story at the dinner table to lighten the mood.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a post-dinner board game with the family.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A leads a group cleanup after dinner to contribute to a comfortable home.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A fondly recalls a family trip to inspire a lively chat.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up Agent B's study area during dinner as a considerate act.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a light workout for the next morning, including everyone.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A arrives home to the comforting smells of dinner cooking and the sight of their family engaged in various activities. They are greeted by Agent B, who's cooking, and engage with Agent C, who is reading on the couch.",
    "actions": [
      {
        "description": "Agent A helps chop vegetables.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A asks about Agent C's novel.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets the dining table.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A tastes the meal from the pot.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation during dinner.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests an evening walk.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories from a photo album.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A plans a weekend family outing.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a college student preparing for a vigorous workout in a communal living space, while Agent B makes a nutrient-rich smoothie and Agent C lounges on the sofa.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to join in on the exercise session for a group workout.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A blends a smoothie with the ingredients suggested by Agent B and shares it with the others.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "After the workout, Agent A encourages a cooldown period where they all share their goals and challenges faced during the week.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agents B and C to have a weekly meal prep day to cook nutritious foods together.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to rearrange the furniture to create more space for group activities.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A demonstrates a new exercise technique they learned to Agent B and Agent C.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B plan a small indoor herb garden to have fresh herbs for cooking.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A decides to lead a relaxation session after workouts, incorporating mindfulness techniques.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A, intrigued by Agent C's book, asks if they could explain some of the concepts over a homemade dinner.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a late breakfast in the kitchen while her roommates, Agents B and C, are setting up a board game in the living room amidst a heatwave. The windows are open to let in a breeze, and Agent A has taken steps to ensure everyone stays cool and hydrated.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to join her for breakfast.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to join the board game.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows and adjusts fans.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a group exercise session.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A distributes frozen water bottles.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares memories of past summer activities.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a game of charades.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a weekly breakfast tradition.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A plans a movie night.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is cooking a complex recipe in the kitchen; Agent B is engrossed in a book in the living room; Agent C is setting the dining table, all residing in a shared apartment. The inviting fragrance of spices and a warm breeze set a cozy atmosphere.",
    "actions": [
      {
        "description": "Agent A decides to double the recipe quantities to ensure abundant food for unexpected guests.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to join her in the kitchen to cook as a team.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests enjoying the meal in the garden to appreciate the view.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A harvests fresh herbs from the garden for the meal.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A plays some music to enhance the cooking and dining experience.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a post-dinner game for everyone to play.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shares a special drink for the communal occasion.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a weekly cooking night for culinary exploration.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A teaches a traditional cooking technique to her roommates.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is making breakfast in the kitchen while Agent B, their spouse, comes down the stairs, and their teenager Agent C is already at the table. The scent of coffee and pancakes is in the air, and a warm exchange of comfortable glances is shared between Agents A and B.",
    "actions": [
      {
        "description": "Agent A pours a glass of water for Agent B.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a short stretching exercise in the kitchen.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decoratively arranges the pancakes.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent B.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to a morning walk.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent B a gentle kiss.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a special pancake for Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal anecdote with Agent C.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a suburban kitchen, Agent A completes making a meal, with the table being set by Agent B. Agent C is watching, an open window lets in a breeze.",
    "actions": [
      {
        "description": "Agent A invites Agent C to help set the table.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Initiates a light workout routine with the family after the meal.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Organizes a family picnic in the backyard.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Goes on a quick market run with Agent C for fresh fruit.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Starts a playful food presentation competition.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Suggests a no-digital device evening, playing board games instead.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Arranges a family stretching session before a movie night.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Encourages Agent C to share their favorite moment of the day while clearing dishes.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Suggests a family stroll around the neighborhood after dinner.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a surprise Sunday brunch for their family while Agent B is asleep, Agent C, a newborn, is in the crib, and Agent D is playing quietly. The kitchen is imbued with a homey and warm atmosphere as the fragrance of cooking fills the room. Agent A is arranging the food and looking forward to the family coming together to share the meal.",
    "actions": [
      {
        "description": "Agent A gently wakes up Agent B with a warm hug and kiss, inviting them to brunch.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent D to help set the table, teaching them the placements.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A hums a lullaby to Agent C while cooking.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages with Agent D’s dinosaur stories.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A opens the kitchen door for more sunlight and air.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A joyfully gives Agent D their favorite pancake.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A shares the role of feeding Agent C with Agent B.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A captures a family moment with a selfie.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A plays with Agent D and their toys post-brunch.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, after exercising, is preparing a meal in a kitchen filled with fresh produce, with Agent B studying and Agent C ready to go jogging.",
    "actions": [
      {
        "description": "Agent A offers to make a smoothie for Agent C in anticipation of her post-jog needs.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A provides a glass of water for Agent B and shows interest in his studies without disrupting him.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to share the meal she is preparing.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests all housemates take a break for a brief walk together.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A turns on light music for the communal meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages a group clean-up post-meal.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to Agent C that they plan a hiking trip with friends.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with a tough study topic by relating it to an everyday concept.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A preps a surprise breakfast, setting up the dining area while Agent B observes with a smile and Agent C is still asleep. The morning is cozy with the smell of pancakes.",
    "actions": [
      {
        "description": "Carefully arranges the table with place settings for the family.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Plays Agent C's favorite morning playlist to wake them up gently.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Leaves a handwritten note by Agent B's computer.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Cuts fresh fruit into fun shapes for the breakfast.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Checks on Agent C and offers help to get ready for the day.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Invites Agent B to cook the last few pancakes together.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Cleans up a spill in the kitchen immediately.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Takes a moment to stretch and do jumping jacks.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Monitors the food to ensure it's cooked perfectly.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, is in the kitchen arranging ingredients for a late-night smoothie bowl. Agents B and C are nearby, engaged in a card game, while the cozy room is insulated from the city's noises, and the windows are shut.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to join her in preparing the smoothie bowls.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to open the window for some fresh air while preparing her meal.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside a portion of the smoothie ingredients to offer to Agents B and C.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A engages in conversation with Agents B and C about personal matters.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes breaks to play cards with Agents B and C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A declines the invitation to join the card game.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          -0.8,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agents B and C her recipe.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A prepares additional food for Agents B and C.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a quick game as a break.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen, rhythmically chopping vegetables for family dinner with Agent B peeling oranges and Agent C entering sleepily after a nap. Background talks and kitchen sounds create a welcoming atmosphere.",
    "actions": [
      {
        "description": "Agent A carefully plates the food, arranging the portions and garnishing appealingly.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A fills up water bottles for everyone at the dinner table.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a playful food tasting competition with Agents B and C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A turns on some gentle background music to enhance the dining atmosphere.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to express gratitude for the meal and family.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a post-dinner walk to the park.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A puts on Agent C's favorite album to discuss music tastes.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A makes a point to ask Agent B about their day, giving full attention.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A proposes Agent C help with dinner cleanup.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult, has just finished a morning run and enters the family home where Agent B, their spouse, is making breakfast and Agent C, their child, is setting the table. The family seems closely connected and serious about a healthy lifestyle, with an open window letting in fresh air and sunlight.",
    "actions": [
      {
        "description": "Agent A helps Agent B by slicing fresh fruit to complement the breakfast.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts an impromptu dance with Agent C to cool down from the run.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A embraces Agent B, expressing gratitude for the breakfast.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to take Agent C for endurance running, sharing their experience.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes a nap to recover for the rest of the day's activities.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares a post-run stretching routine with Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a deep conversation with Agent B and C during breakfast.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A stands by the window soaking in sunlight before joining breakfast.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the dishes after eating as a gesture of gratitude.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A stands in the kitchen baking bread, with teenage Agent B assembling a fresh salad from garden greens, and Agent C arranging the dining area. They anticipate sharing the meal and discussing their day in a nurturing home atmosphere.",
    "actions": [
      {
        "description": "Agent A fetches a pitcher of mint-infused water from the garden.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares a lighthearted cooking challenge story during dinner.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A plays family-favorite music to accompany the meal.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A attentively adjusts Agent B's chair before they sit down to eat.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A reminds the family to savor their meal and take their time.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a post-dinner neighborhood walk.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a meaningful conversation with Agent C.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to learn a new baking technique.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family moment to express daily gratitude.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A prepares a colorful salad in the kitchen. Agent B is lounging nearby, while Agent C has just returned from jogging. An atmosphere of collaboration is encouraged as Agent A invites the roommates to participate in meal preparation.",
    "actions": [
      {
        "description": "Agent A invites Agent B to chop vegetables for the salad.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent C to make a smoothie.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a sizable portion of food intending to share it.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a weekly meal-prep plan.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about their days.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A offers to teach Agent C some cooking techniques.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A turns on music to enliven the atmosphere.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A fetches extra chairs for Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A plans an indoor picnic.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is unwinding after finishing a school project, Agent B is preparing a meal in the kitchen, and Agent C is lounging on the sofa looking bored. The home offers a cozy and refreshing environment conducive to family interactions.",
    "actions": [
      {
        "description": "Agent A decides to challenge Agent C to a friendly competition of push-ups.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a kitchen cleanup, helping Agent B.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests charades for family bonding.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A does stretches on the balcony with Agent C.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent C on the sofa.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make smoothies for everyone.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help set the dining table.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A opens a window for fresh air.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C relaxation yoga poses.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a fitness enthusiast, is preparing for her morning run while her roommate, Agent B, a nature photographer, is reviewing her work. They live in a warm, shared apartment where their different interests intersect through mutual respect and support.",
    "actions": [
      {
        "description": "Agent A invites Agent B to join her for a hike to combine photography and fitness interests.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B organize her wildlife photographs into a digital album.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes planning a healthy meal prep session together for the week ahead.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to join Agent B on an upcoming photography trip that involves a moderate trek.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A unexpectedly orders a book on wildlife photography to appreciate Agent B’s work.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests rearranging the living room to showcase their fitness and nature interests.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plans a surprise picnic with nutritious snacks for Agent B's birthday.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A compiles a playlist of energizing music for their workouts.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A collaborates with Agent B on a wall collage of race bibs and photographs.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A has just finished a morning run and hydrates in the kitchen. Agent B is lounging with a phone, Agent C is preparing for yoga, and Agent D is making pancakes. The home is filled with the smell of breakfast and a sense of contentment.",
    "actions": [
      {
        "description": "Agent A joins Agent C on the yoga mat for a cool-down session.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join the breakfast table and pours them a glass of orange juice.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A whips up a protein smoothie for everyone after the workout.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A takes quick breaths of fresh air from the open window before breakfast.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent D on the breakfast preparation.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent D set up the table with cutlery and plates.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A fetches the newspaper and reads out news snippets to the group.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a debate with Agents B and C about a news topic.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A appreciates the togetherness of the morning and expresses gratitude.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "The setting is a Sunday morning in a family home where Agent A sets up for a yoga session. Agent B reminisces over a photo album in the kitchen where Agent C prepares fresh juice. The family is engaging in a shared activity that bolsters their physical health and nurtures their emotional connections.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to join in the morning yoga session.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A carefully explains and demonstrates a new yoga posture that could be beneficial for Agent B's back discomfort.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment during yoga to appreciate the effort that Agent C has put into making the juice, praising the drink's nutrition and taste.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A starts a playful, light-hearted competition with Agent C to see who can hold a balance pose longer.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "After yoga, Agent A proposes making a collaborative family meal.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A gathers everyone to prepare a fruit platter and exchange stories about their week.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a brisk walk around the garden with the family.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside personal tasks to spend more time with Agent B and Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "During brunch, Agent A initiates a conversation about everyone's goals for the upcoming week.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a homemade pizza in the kitchen for a leisurely weekend dinner with Agent B, her old college roommate, and Agent C, her partner. The atmosphere is cozy, with conversation and laughter, a salad and a pitcher of water on the countertop, and an open space for post-dinner activities.",
    "actions": [
      {
        "description": "Agent A personally plates the pizza pieces onto each person’s plate.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites others to join her in preparing a surprise dessert.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing charades after dinner.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A plays soft music during dinner.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A leads a toast to celebrate the friendship.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to let fresh air in.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a photo album to share memories.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses planning a future trip.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A insists on no phones at the dinner table.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, is preparing dinner in a family kitchen environment while Agent B scans a recipe book for dessert ideas and Agent C enters with a board game, suggesting a family night ahead.",
    "actions": [
      {
        "description": "Agent A invites Agent B to join in prepping the main dish by teaching them a culinary skill.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A tucks the napping dog in with a cozy blanket.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A agrees to play a board game after dinner with Agent C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shares a funny anecdote with Agent B and Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A stretches and opens windows to let fresh air in.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A plans to deliver a portion of the meal to an elderly neighbor.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B choose a dessert recipe.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A corrects Agent C's knife technique for safety.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A pours water for everyone and the dog.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A has returned home after a morning run. They immediately participate in household life by sharing a homemade smoothie with Agent B and joining Agent C with a jigsaw puzzle. The agents exhibit a blend of individual pursuits and shared enjoyment of each other's company.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C for an indoor workout session.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a communal meal planning session with healthy recipes.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes an afternoon nap to recover from the morning exercise.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A decides to join Agent C in completing the jigsaw puzzle.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a group walk in the park nearby.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A undertakes the task of deep cleaning the kitchen, unasked.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a friendly cooking competition for dinner.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A brings in houseplants to purify the apartment air.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen, finalizing a homemade pizza while Agent B, having just returned from an evening jog, smells the cooking meal appreciatively. Agent C sets the table next door. The atmosphere is homey and full of anticipation for the meal they're about to share.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to join in garnishing the pizza with fresh herbs from the garden.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A engages all present in a conversation about their day's activities while they eat.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A decides to collaborate with Agents B and C to clean up the kitchen.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a walk together after dinner to enjoy the evening air.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers to teach Agent B a new stretching routine after seeing them jog.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A and Agents B and C plan a meal-prep session for the upcoming week's dinners.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game night, picking board games that encourage teamwork and laughter.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A begins to organize a small indoor herb garden with the help of Agents B and C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "While eating, Agent A narrates an interesting podcast episode they heard, inviting opinions.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A sets up his home exercise equipment in the living room on a calm Saturday morning, while Agent B is preparing a nutritious juice in the kitchen with the windows open. Agent C lounges on the couch with headphones and phone in hand. The environment is filled with sounds of exercise and blending from the kitchen.",
    "actions": [
      {
        "description": "Agent A joins Agent B in the kitchen for juice.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to exercise together.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A plays uplifting music in the living room.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family hike for more fresh air and activity.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A engages in conversation with Agent B about the week ahead.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C make a workout playlist.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A guides Agent B through stretching routines.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plans a healthy family lunch post activities.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A supports Agent C in setting fitness goals.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a teenager trying to cook a family meal for the first time. Agent B, who is not feeling well, is on the couch watching a cooking show and occasionally checking on Agent A’s progress. Agent C is working in the home office. The kitchen is busy with meal preparation.",
    "actions": [
      {
        "description": "Agent A checks on Agent B about adding a special ingredient to their meal.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to partake in taste-testing.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the kitchen to maintain hygiene.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a cozy dining area in the living room.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A samples the food for proper taste and temperature.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A makes an easy-to-digest dish for Agent B.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sits with Agent B while they eat.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the cooking process.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A picks fresh ingredients from the garden.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, returns home for the weekend, greets his sibling Agent B, who is struggling to cook in the kitchen, and Agent C, their parent, who is looking through family photos. The atmosphere is filled with homely scents and background sounds.",
    "actions": [
      {
        "description": "Agent A offers to retrieve the spice from the top shelf for Agent B.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sits beside Agent C to look at the photo albums and reminisce about old times.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with the meal preparation, suggesting improvements to the recipe.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes the family dog out for a brisk walk to enjoy the fresh air and stretch their legs.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen alongside Agent B without being asked, making the task lighter for both.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a spontaneous game night to enjoy some family time.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to make breakfast for the family the next morning, as a show of gratitude for their support.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A brings their laundry down to do together with Agent B, seeing it as an opportunity to chat and bond.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join in a workout session, to motivate each other.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a warm kitchen, Agent A and Agent B are cooking dinner as Agent C sets the table. There's a sense of collaboration, and the aroma of food fills the room.",
    "actions": [
      {
        "description": "Agent A starts a playful food plating competition to see who can make the prettiest dish.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A offers to show Agent B a new cooking technique they recently learned.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A tastes Agent B’s smoothie and offers a compliment on the flavor.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A flicks water at Agent B while washing vegetables, causing a laugh.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to bring the dinner outside to enjoy the meal in the fresh air.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join in the cooking, stirring or tasting to feel included.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a camera to record the dinner preparation as a memory.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests swapping some ingredients for healthier alternatives at home.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to try a dash of a new spice they found.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a keen amateur chef, returns from his jog and begins preparing dinner in his cozy home, where Agent B is reading and Agent C listens to music. The house fills with the smell of dinner, setting a serene environment as evening approaches.",
    "actions": [
      {
        "description": "Agent A invites Agent C to help set the table, fostering a family bond.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to play some soft background music for enjoyment and relaxation.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A lights candles to create a pleasant dining ambiance.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A thanks Agent B for choosing a book that enhances the evening's ambiance, expressing gratitude.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a post-dinner walk to enjoy the night and aid digestion.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares a new recipe idea, involving the family in his interests.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C engage in a spontaneous dance, sharing a fun moment.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A pours water for everyone, mindful of hydration after his jog.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a weekly family meal for everyone to cook and connect.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, who has just come home from work, finds Agent B cooking and Agent C struggling with homework. A warm atmosphere and a sense of family togetherness fill the home.",
    "actions": [
      {
        "description": "Agent A helps with cooking, bonding through collaboration.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent C a comforting hug to ease the homework stress.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages the family to hydrate while spending time together.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C with homework, patiently explaining the solution.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories from their day, engaging both Agent B and Agent C in conversation.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a short walk with Agent C for a break and fresh air.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A turns laundry folding into a playful competition with the family.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family meal outdoors to enjoy the evening light.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a post-dinner board game to strengthen family ties.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy kitchen filled with the aroma of coffee, Agent A is determined to cook a special breakfast, with Agent B setting the table and Agent C watching, still waking up. The shared culinary activities set the tone for a morning filled with enthusiasm and a sense of closeness.",
    "actions": [
      {
        "description": "Agent A invites Agent C to assist with the fruit salad, invigorating their morning and engaging them in the activity.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B a cooking technique, fostering a shared learning experience.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A tries an intricate plating design to showcase his culinary skills.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A creatively adapts a new dish from spare ingredients, displaying skill and versatility.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A keeps the mood light by laughing off a small kitchen mishap.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A captures a group photo, preserving the memory of their shared effort.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A leads a scent-based spice guessing game, adding an element of playful interaction.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A moves breakfast to the patio to appreciate the fresh air and alter the ambiance.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A ensures everyone is served before sitting down to eat, prioritizing their comfort.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "College student Agent A comes home to roommates Agent B and Agent C preparing dinner. Agent A joins in to help, chats, and plans activities that foster good rapport among them.",
    "actions": [
      {
        "description": "Agent A helps Agent B by chopping the remaining vegetables for the stir-fry.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets out plates on the dining table, arranging them carefully around the candles.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A pours glasses of water for everyone, ensuring hydration.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about how each person's day went, fostering a shared experience.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes a group photo of the roommates with the meal once it's served to capture the shared moment.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers to clear the table after dinner, showing appreciation for the communal meal.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a quick board game after dinner to extend quality time with his roommates.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking turns in cooking on different days as a new tradition among the roommates.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A recommends a schedule for communal grocery shopping to maintain a stocked pantry.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy kitchen, Agent A prepares a meal with Agent B and converses with Agent C. There's a sense of camaraderie and bonding.",
    "actions": [
      {
        "description": "Agent A offers to make Agent B's favorite dessert as a surprise.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C open a tight jar, demonstrating physical effort.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family board game night after dinner.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to wash the dishes to alleviate Agent C's workload.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A provides cooking tips to Agent B to improve their culinary skills.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table, placing a small personalized note beside each plate.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug with Agent B and Agent C before they eat.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares anecdotes about their day, fostering conversation.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to skip dessert to maintain their dietary balance.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is enjoying a quiet Sunday at home with his family. The living room is cozy, with a puzzle waiting to be finished, and his children, Agents C and D, are engaged in their creative activities. Agent B, his spouse, lounges on the couch, watching the family and occasionally reading a book. A sense of calm and quiet activity fills the air.",
    "actions": [
      {
        "description": "Agent A joins in building the block tower with Agent D.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A ensures family hydration with water distribution.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a drawing activity involving the family.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A turns stretching into a game with Agent D.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to let in more air and sunlight.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a family stretching session.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent B a shoulder rub while talking.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a puzzle competition.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A guides a family relaxation session.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a suburban home, Agent A, who has a keen interest in making nutritious meals and maintaining a fitness routine, is in the kitchen prepping various veggies and fruits for a salad and a protein shake. Agent B, Agent A's parent, is at the kitchen island looking at mail and a fitness magazine. Agent C, the younger sibling, bounces a basketball in the living room, watching Agent A work.",
    "actions": [
      {
        "description": "Agent A decides to prepare a large, colorful salad using the vegetables on the counter and offers to share it with Agent B and Agent C.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join in a quick outdoor basketball game after they finish their snack.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A opts to make a double batch of the homemade protein shake and shares it with Agent B, discussing the benefits of each ingredient.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to join in a family yoga session in the living room after noticing Agent B's interest in the fitness magazine.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family hike for the upcoming weekend while sharing a meal with Agents B and C.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests creating a weekly meal plan with Agents B and C to ensure a balanced diet for the family.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to clean up the kitchen by themselves, allowing Agents B and C to relax after their meal.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C how to make the homemade protein shake, turning a routine task into a shared activity.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a nap after their shared meal and activities, emphasizing the importance of rest.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A prepares a nutritious meal with Agent B, using the cooking process as an opportunity for bonding and education. The environment is casual, with underlying threads of care and knowledge exchange, setting a tone for both physical and emotional nourishment.",
    "actions": [
      {
        "description": "Agent A starts chopping vegetables and invites Agent B to join in, turning it into a light competition.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table, intentionally placing the seats close to facilitate easy conversation during the meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "While the food is cooking, Agent A shares a funny anecdote from their day at work, eliciting laughter from Agent B.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to a quick physical activity break, including stretches and jumping jacks, while the food simmers.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "During dinner, Agent A asks open-ended questions about Agent B's day, encouraging them to talk about their feelings regarding a school project.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "After eating, Agent A suggests they both clean up together, promoting teamwork and shared responsibility.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A plans a brisk, post-dinner walk with Agent B to aid digestion and get some fresh air.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "As they wash the dishes, Agent A initiates a heart-to-heart conversation about future educational plans with Agent B.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to watch a documentary after dinner that’s related to Agent B’s current school subject to further learning in an informal environment.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A returns home and finds family members engaged in various activities, from cooking to setting up exercise equipment. Though they are apart, the shared goal of a family meal and the warm atmosphere suggest a deep familial bond.",
    "actions": [
      {
        "description": "Agent A assists in the kitchen with the cooking.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A helps install an air purifier.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A makes a nutritious smoothie for the family.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A leads a family stretch and breathing exercise.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a \"clean-up challenge\" in the living room.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes a short nap.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent D in conversation.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a group meditation session.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk outside.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "In a sunny suburban home, Agent A is making breakfast, Agent B is arranging flowers on the dining table, and Agent C is on the couch with a book. The morning is filled with routine and familial closeness.",
    "actions": [
      {
        "description": "Agent A flips pancakes on the skillet, ensuring they are cooked to perfection for the family's enjoyment.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the dining table thoughtfully, placing everyone's favorite breakfast items nearest to their usual seats.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about everyone's plans for the day.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk after breakfast to enjoy the weather and some physical activity together.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a new exotic fruit from the market, encouraging the family to try something new together.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes playing board games later in the day to spend quality time together.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to sit next to Agent C, engaging in a light, playful discussion about the book they are reading.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A gently nudges Agent C to help with the dishes, using this as an opportunity to teach and bond.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A notices Agent B seems quiet and asks if everything is alright, showing concern.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a fitness trainer, finishes a workout with Agent B, her neighbor and friend, in her home gym. Agent C, her nephew, is in the kitchen making a smoothie. The scene sets a tone for physical restoration and social bonding.",
    "actions": [
      {
        "description": "Prepares a high-protein smoothie for herself and offers one to Agent B.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Opens the windows wider to let in fresh morning air.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Sits with Agent B to discuss progress and set new fitness goals.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Invites Agent C to join in a cool-down stretching routine.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Takes a power nap to recover from her workout.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Tidies up the gym area, restoring the equipment.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Texts a friend for a future workout session.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Plans a nutritious meal for the day.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Helps Agent C with the smoothie and chats about his day.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy"
    ],
    "scenario": "At home, Agent A has prepared a nutritious dinner. Agent B, engrossed in reading, and Agent C, setting the table, are called to enjoy the meal. The environment is set for a family evening with opportunities for engagement and shared activities.",
    "actions": [
      {
        "description": "Agent A calls the family to the table to eat dinner together.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to describe the book they're reading while sharing dessert.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A turns off the TV to create a quiet environment for conversation during dinner.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a board game after dinner for some family fun.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to take a short walk outside after dinner to enjoy the fresh air.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A lets Agent B choose the topic of discussion at dinner to engage them in the conversation.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen post-dinner, ensuring everything is tidy and in order.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sends Agent B to prepare for bed early to ensure they get plenty of rest before school the next day.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to stay up late to prepare lunch for Agent B’s school day, compromising their own sleep.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  }
]