[
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a group project with classmates Agent B and Agent C at their home. Agent A has made their extensive collection of reference books available to the group, and Agent B has brought homemade snacks for everyone.",
    "actions": [
      {
        "description": "Agent A organizes a ten-minute break for all to stretch and re-energize after every hour of concentrated work.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A decides to equally divide the remaining snacks to ensure that everyone has enough to last the rest of the session.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A offers to make a quick run to a nearby store to grab some fresh fruits and water for the group.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A encourages Agent C to focus more on the project by assigning them a section that plays to their strengths.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A, noticing dwindling attention, initiates a quick quiz game to revive the team's focus.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A proposes the group meditates for five minutes to clear their minds before diving back into work.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A confronts Agent C regarding their lack of participation and discusses how they can more effectively contribute.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers assistance to Agent B with a complex part of the project, recognizing that they have been working diligently.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a college student and keen hiker, has joined the household's meal planning committee to improve eating habits. Returning from the hike, Agent A finds roommates Agent B reviewing cookbooks and Agent C sorting garden vegetables for the week’s meals. Agent D is watching a documentary on sustainability. Everyone prepares to discuss and decide on the week's meal planning in the well-ventilated household.",
    "actions": [
      {
        "description": "Agent A starts making a big pot of herbal tea for everyone, using mint leaves from Agent C's garden.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A drafts a meal plan for the week that includes a balance of proteins, vegetables, and grains, considering everyone’s preferences.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A encourages Agent D to share insights from the documentary that could be incorporated into more sustainable meal prep routines.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A volunteers to do the grocery run for the ingredients needed, ensuring it includes fresh produce options rather than processed foods.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a rotating cooking schedule so that each roommate has an equal chance to cook and share their favorite recipes.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A organizes a meeting to vote on the final meal plan, making sure everyone's voice is heard.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes a fitness challenge for the week, where each roommate encourages the other to stay active.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent B to combine their recipe ideas to create new, healthy dishes.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A offers to wake up earlier and prepare breakfast for the household for the next day.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is organizing the pantry in the family household. Agent B enters the kitchen to prepare a meal, considering a recipe that needs some of Agent A's ingredients, and noticing shared items that everyone in the household bought collectively. Both agents have returned from work and are engaging in their respective evening tasks.",
    "actions": [
      {
        "description": "Offers personal ingredients to Agent B for use in the recipe.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Cooks a meal together using shared items.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Creates a chart for tracking shared ingredients.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Consolidates older items and suggests a household meal plan.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Continues organizing the pantry without interaction.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Purposefully ignores Agent B's need for ingredients.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          -0.8
        ]
      },
      {
        "description": "Proposes a schedule for taking turns using pantry ingredients.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Suggests creating a schedule for meal preparation.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Leaves the kitchen to offer Agent B space for cooking.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is preparing breakfast with Agents B and C around, discussing the day's plans including a hike and volunteering at the community center. A situation arises involving the last piece of toast.",
    "actions": [
      {
        "description": "Agent A offers the last piece of toast to Agent C.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests splitting the last piece of toast equally.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A forgoes their own portion so Agent C can have it.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A reminds everyone to drink water before leaving.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A proposes alternating future occurrences of last shared food items.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A insists on everyone having a fruit before the hike.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A ensures snacks and water are packed for everyone and for the community center.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A encourages shared cleaning responsibilities.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A plans to make extra breakfast portions in the future.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a nutritious meal in the kitchen, planning to serve it evenly among themselves and their friends, Agent B and Agent C, who are studying in the dining area. There is an atmosphere of cooperation and sharing resources in the household.",
    "actions": [
      {
        "description": "Agent A decides to proportion the cooked meal evenly among all three of them, including themselves.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A invites both Agent B and Agent C to partake in cooking, making it a group activity.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "After serving the meal, Agent A makes sure to ask both Agent B and Agent C if they need any additional items.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A notices they are running low on vegetables and decides to quickly go to the store.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Seeing that Agent B struggled with the cooking, Agent A takes extra time to explain some techniques.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A creates a cooking schedule for the week, giving each person an equal chance.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A bakes extra desserts to share with neighbours.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A offers to clean up the kitchen after the meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Noticing that Agent C is tired, Agent A suggests they take a break and offers to help.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is in the family kitchen preparing a balanced breakfast for their younger siblings, Agents B and C, while their parents are away. The kitchen is set up for the day's start with fresh ingredients and a coffee station, as Agent A cooks both twins' favorite breakfasts and plans for healthy snacks and inclusive weekend activities.",
    "actions": [
      {
        "description": "Agent A begins to prepare the omelets, carefully using ingredients to create a nutritious meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A mixes batter for pancakes, maintaining the healthfulness of the meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the breakfast table, considering aesthetics and accessibility.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A wakes the siblings, ensuring they start the day on a positive note.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A serves equal portions, upholding impartiality.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A cleans up the cooking space, maintaining order and readiness.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages siblings to customize their pancakes, allowing for personal choice.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A packs extra food for school, promoting sustenance throughout the day.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A leaves a note for siblings to share their food, fostering a sense of community.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is a parent preparing lunch in a suburban home's kitchen deep into the weekend afternoon. Agent B, their teenage child, is seated at the dining table, engrossed in a voluminous textbook. Agent C, a partner, is tending to the garden visible through the open window, wearing gloves and a wide-brimmed hat to shield from the sun.",
    "actions": [
      {
        "description": "Agent A decides to include a balanced variety of proteins and vegetables from the garden in the lunch menu.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A turns on a fan to circulate air and invites Agent C inside to join the meal and rest from the heat.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A proposes a rotational cooking schedule for the household to equally share meal preparation tasks.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A arranges for the family to have an early dinner to ensure everyone gets to bed on time and enjoys ample rest.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a short family walk after lunch to foster light exercise.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A opens more windows to allow fresh air to flow through the dining and kitchen areas.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A deliberately avoids cooking heavily fried foods, opting for healthier cooking methods.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A asks Agent B for input on the lunch menu, respecting their preferences, and integrating it into the meal plan.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a nutritious brunch in the family kitchen when their neighbor, Agent B, arrives with a basket of fresh fruits. Agent C is strategizing a community project in the living room, and Agent D, a visiting cousin, is engrossed in video games and snacks. The day is beautiful and sunny.",
    "actions": [
      {
        "description": "Agent A invites Agent D to help prepare the brunch.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A creates a fruit salad with Agent B's fruits, sharing the task and product among everyone.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers a portion of the brunch to Agent B as appreciation.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A redistributes the day’s tasks, including brunch prep, for Agent C’s community work time.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A opens the windows to let fresh air in during meal prep.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A plans a post-brunch walk with all present.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A serves Agent D fewer snacks for better habits.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A prepares a pitcher of water with fruit slices for hydration.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A sets a schedule for regular household tasks.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A wakes up early and heads to the kitchen to prepare a nutritious breakfast and suggests clearing the dining table cluttered with personal items.",
    "actions": [
      {
        "description": "Agent A offers to prepare a large batch of breakfast for everyone.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a schedule for shared use of common areas.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A reviews their study materials while exercising.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites roommates for a brainstorming session on dividing chores.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A decides to create a shared shopping list on the fridge.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A arranges the kitchen so that healthy snacks are easily accessible.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to help Agent C integrate their routine into the shared schedule.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A expresses the intent to mediate conflicts.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A encourages a short group workout for the household's benefit.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a competitive distance runner, lives with two roommates, Agent B and Agent C. With a shared fridge and individually labeled grocery sections, Agent A balances their need for a nutritious breakfast and long run with the established household food management system.",
    "actions": [
      {
        "description": "Agent A prepares a careful portion of breakfast using only items from their allocated section.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to skip breakfast to preserve the food supply for later but does take a protein bar from their section.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A talks with Agent B and C to propose a communal meal plan.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to purchase additional groceries to replenish what they consume.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A ignores the labels and helps themselves to a large breakfast, including items from other sections.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          -0.7
        ]
      },
      {
        "description": "Agent A uses the food from their section to prepare breakfast, but also leaves a note offering to share future food deliveries.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A purchases a separate mini-fridge for their increased dietary needs.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A works out an agreement with Agent C to exchange some of their labeled items.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A skips their run out of concern for their dietary needs not being met with the available food.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A prepares breakfast and offers extra pancakes to Agent B; Agent B works on his school project at the dining table; Agent C manages work alongside overseeing the children. The shared kitchen and dining room are bustling with individual tasks.",
    "actions": [
      {
        "description": "Agent A decides to cook extra pancakes for Agent B.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A sets up a meal preparation schedule on the refrigerator.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A reminds Agent B about cleaning up the dining table.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A discusses planning a family hiking trip with Agent C.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A takes out the trash without being asked.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A skips her morning jog.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B with his project.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agent C to join a quick exercise session.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A delivers a cup of coffee to Agent C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a home garden setting, Agent A organizes repotting plants with siblings Agent B and Agent C, aiming to ensure each plant has room to grow and encouraging shared responsibility and equitable use of resources.",
    "actions": [
      {
        "description": "Agent A divides the soil equally among the pots.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A gives Agent B the gardening tools first.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to plant the herbs in a communal area.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A proposes a schedule for watering the plants.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests a family meeting for garden planning.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A allots the largest pot to Agent C's favorite plant.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A uses leftover materials to make garden decorations.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A researches composting for plant nutrition.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A volunteers to wake up earlier to water the plants.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is organizing the garage at his family home with Agent B and Agent C. The garage is cluttered and stuffy with closed windows.",
    "actions": [
      {
        "description": "Agent A delegates tasks and assigns areas of the garage to clean up, ensuring everyone has a space to work and engage.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A opens the windows to let in fresh air and reduce the stuffiness of the garage.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A suggests a break for some light exercise to refresh everyone.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A starts a sorting game with incentives to make the task enjoyable.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A leads by example, working diligently and encouraging others.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A plans a nutritious snack break for everyone to recharge.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites opinions on how to best use the organized space.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes a schedule to maintain the clean state of the garage.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, after completing an early morning run, returns to a shared apartment where roommates Agent B is preparing breakfast and Agent C is setting up a chore schedule. Agent A contemplates various actions that contribute to well-being and equitable living.",
    "actions": [
      {
        "description": "Agent A decides to take a quick shower to refresh themselves after the run.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B with breakfast preparations.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A proposes to revise the chore schedule to a more equitable system for all roommates.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a collective grocery shopping trip where everyone buys their own necessities but takes turns carrying the heavier bags.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A chooses to make a large batch of pasta for dinner to share with the roommates, considering everyone’s dietary preferences.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A decides to hold a meeting to discuss rotating cleaning responsibilities in shared areas.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A starts drafting a budget plan to cut down on unnecessary expenses for all roommates.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A refrains from addressing Agent C’s tendency to use Agent A's food without asking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.6
        ]
      },
      {
        "description": "Agent A goes to their room to rest instead of participating in a shared activity.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          -0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is a teenager who prioritizes their morning jog but also bears the responsibility of household chores. As the family shares in the upkeep of their home and values health, Agent A faces a decision that balances personal fitness with household duties as they prepare for their run.",
    "actions": [
      {
        "description": "Agent A takes out the recycling first, delaying their morning run.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A goes for their run and plans to complete the chore afterwards.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          -0.3
        ]
      },
      {
        "description": "Agent A invites Agent C for a morning run to share the activity.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A participates in making breakfast after their run.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A involves a neighboring friend in their morning run.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A serves the fresh bread, putting off their run to ensure a warm breakfast for the family.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent C to start exercising in the morning.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A extends their run to include errands for the household.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A tries a new workout in the garden, inviting the family to join.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, responsible for cooking, ensures extra food is prepared for the guest, Agent C and dedicates part of the dining experience to equitable treatment and healthy practices. Agent B, busy with work, participates nonchalantly.",
    "actions": [
      {
        "description": "Agent A makes a larger meal portion to accommodate Agent C, and invites Agent C to assist in cooking.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A ensures food is divided equally among everyone, potentially taking a smaller share.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A proposes a swap in the cooking roster for Agent B's sake.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A reserves part of the meal for Agent C before they start eating.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A initiates a post-dinner physical game for everyone.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A suggests Agent B take the leftovers for lunch the next day.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A volunteers for cleanup duty to balance Agent B's workload.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A opens the windows for fresh air and encourages a walk.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, begins her day in a family kitchen where she sees her sibling Agent B struggling to reach cereal on a high shelf, amidst their parent, Agent C, who is planning weekly meals. The morning scene sets a stage where Agent A's actions can unfold, focusing on preparation for a day filled with online classes and activities.",
    "actions": [
      {
        "description": "Agent A offers help to Agent B with the cereal box.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests reorganizing lower shelves for easier access.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A pours herself cereal, focusing on her classes.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          -0.8
        ]
      },
      {
        "description": "Agent A gives Agent B the first fruit choice.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A skips breakfast to save time.",
        "values": [
          0.0,
          -0.9,
          0.0,
          0.0,
          0.0,
          -0.3
        ]
      },
      {
        "description": "Agent A shares breakfast time with Agent B.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A prepares a quick nutritious breakfast to go.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses kitchen responsibilities with Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A disregards Agent B’s difficulty.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          -0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a middle-aged parent, is in the kitchen where her children, Agent B and Agent C, argue over a fruit platter. Agent B and Agent C await Agent A's decision on resolving their dispute.",
    "actions": [
      {
        "description": "Agent A divides the remaining strawberries equally.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A goes to store for more strawberries.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A creates a future snack schedule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A involves children in snack preparation.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests fruit swapping.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A encourages cleaning together.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A plans a menu with the children.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A lets children resolve the argument.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A sets a snack-picking rotation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a suburban home one early Saturday morning, Agent A is preparing a healthy breakfast in the kitchen. Agent B works intensely at the dining table while Agent C is getting ready for a morning jog. A bowl of fruit for a smoothie is set out for everyone to share.",
    "actions": [
      {
        "description": "Agent A blends the smoothie but ensures to set aside a portion for Agent B and Agent C.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A cleans up the kitchen after preparation, making the space usable for the next person.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A offers Agent B a glass of water, noting the intense focus and potential neglect of hydration.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to join Agent C on the jog, encouraging a shared fitness activity.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A prepares and leaves a packed smoothie in the fridge for Agent C.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A resists the urge to wake Agent B for breakfast, understanding the need for rest during work.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A politely asks Agent B if there's anything specific they would like for breakfast.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A sets an extra place at the table for Agent C's return.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A allocates a separate area of the fridge for each person for meal storage.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a nutritionist, enters her shared apartment kitchen where Agent B, a teacher, is meal planning, and Agent C, a student, is working on a community project. The kitchen has fresh produce and the morning brings fresh air through an open window.",
    "actions": [
      {
        "description": "Agent A makes fruit smoothies for everyone using the fresh produce.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A opens all windows in the apartment to let in more fresh air.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A creates a rotating cleaning schedule, ensuring all household tasks are evenly distributed.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to join in group exercise in the park.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A organizes a meal sharing arrangement with her roommates, taking turns preparing meals.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A sets up a reminder system for staying hydrated for the household.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A shares healthy cooking tips with Agent B for a balanced diet.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests creating a community garden to Agent C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes to redistribute the pantry space equally.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a suburban family home, the kitchen bustles with activity as Agents B and C, the younger siblings, prepare dinner. Agent A observes the scene and the partially set dining table with an open space on the activity calendar indicating it's their turn for meal duty.",
    "actions": [
      {
        "description": "Agent A collects and distributes napkins equally among the table settings.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A refills the water jug to ensure everyone at the table has enough to drink.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A offers to complete a sibling's cooking task, noticing they appear tired.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to forgo their exercise to aid in preparing the meal on time.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A starts preparing meals for the next day, optimizing the use of time and resources.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A opts to learn by observing Agent B and C's cooking, not interrupting their process.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A ensures the dining setup is evenly spaced and arranged for all.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "After the meal, Agent A suggests a family walk to the park for digestion and bonding.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is organizing a dinner to bond with his new flatmates, Agent B and Agent C. They are all contributing to the meal preparation, and Agent A suggests a rotation of cooking responsibilities for the future.",
    "actions": [
      {
        "description": "Agent A checks with Agent B and Agent C to ensure the food meets everyone's tastes and needs.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A sets a specific time for dinner to maintain structured mealtimes.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A prepares a vegetarian option for Agent C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a rotating schedule for buying groceries.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A volunteers for cleanup after dinner.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A invites flatmates for a jog after dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers his homemade dessert to the agents.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A initiates a conversation about cleaning schedule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A encourages sharing cooking tips.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a cozy suburban home, Agent A, a college student, has just returned home for the summer break. The kitchen buzzes with activity as Agent B, Agent A's older sibling, prepares a vegetable stir-fry. Agent C, their cousin, is setting the dinner table. Each place setting receives the same number of utensils and the same sized plate. The scent of cooking food fills the air, and soft music plays in the background.",
    "actions": [
      {
        "description": "Agent A offers to slice the vegetables to expedite the cooking process.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to organize the pantry, checking dates on all items to reduce waste.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a house meeting to discuss chores distribution.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A voluntarily cleans the kitchen after the meal is prepared, despite not having cooked.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A chooses to use leftovers to prepare the next day's lunch.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A starts a conversation about how to better recycle and manage waste.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A resolves to research new and nutritious recipes for the household.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A observes his siblings in the kitchen and living room, reflecting on the need for a balanced nutritional meal and equitable house chore distribution.",
    "actions": [
      {
        "description": "Agent A cleans up the kitchen after noticing the mess left behind.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A prepares a meal for the family, taking the time to balance the nutrition.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A organizes a schedule for the week, allocating house chores among the siblings.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to share the cookies with Agents B and C equally.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A takes time to teach Agent B how to better follow the recipe steps.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A fixes a broken latch on the window to ensure fresh air circulation.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A mediates a small dispute between Agent B and Agent C over the use of the television.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A voluntarily gives up some personal rest time to help Agent C with homework.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a family walk after dinner for some collective exercise.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a health-conscious college student, heads into the shared kitchen after a morning jog, aiming to prepare breakfast in a messy common area with takeout boxes and dirty dishes from the last night's meal. Agent B is scrolling through their phone, and Agent C is still asleep.",
    "actions": [
      {
        "description": "Agent A cleans and organizes the kitchen before cooking.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A creates a meal plan for the week.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A puts on music to enhance their mood while cleaning and cooking.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help with breakfast preparation.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A prepares breakfast to share.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A leaves a note about extra food for housemates.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A starts a group conversation about groceries.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A eats their portion and leaves the kitchen dirty.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          0.0,
          -0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, along with two roommates, adheres to a strict schedule to ensure study time and chores are completed without disruption. The apartment has a small kitchen with a designated area for communal work. Agent B is spread out on the table with a project, while Agent C has finished breakfast and is cleaning up. Agent A needs to study and is reviewing the situation, considering the balance of shared living.",
    "actions": [
      {
        "description": "Agent A politely reminds Agent B of the schedule and asks if they can clear space on the table for studying.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to help Agent B clear the table and find another spot for the art project.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to postpone their study session to accommodate Agent B's creative process.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests rearranging the schedule to create a better balance between shared and personal time.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A chooses to study in their room, respecting Agent B's need for space.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A eats a quick breakfast made by Agent C before starting the study session.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A prepares a snack for both Agent B and themselves to enjoy during their respective tasks.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A confronts Agent B about respecting the shared schedule and insists on following it strictly.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A holds a brief meeting with both Agent B and Agent C to reinforce the importance of the shared schedule.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is a teenager preparing for a significant exam and is in their room planning a study schedule. Agent B makes a smoothie in the kitchen. Agent C tends to their shared vegetable garden outside. All agents are conscious about nutrition and sharing responsibilities in the household.",
    "actions": [
      {
        "description": "Agent A creates a meal plan for the week with nutritious options.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A engages in a quick aerobic exercise to re-energize.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cooks lunch with Agents B and C, sharing tasks.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a dinner choice rotation schedule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A takes a short nap to refresh for studying.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A teaches Agent B study techniques.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A equitably divides the pantry snacks.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A helps Agent C in the garden, sharing turns.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A organizes a family game night, ensuring turns.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is in the kitchen preparing dinner for the household. Roommates Agent B and Agent C are present, with each contributing to the meal or working within the space. The atmosphere is cordial, and Agent A is attentive to everyone's dietary needs, ensuring an inclusive meal is made.",
    "actions": [
      {
        "description": "Agent A allocates equal portions of the meal to ensure everyone has enough to eat.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A offers to do the dishes since Agent C helped with the cooking and Agent B had a busy day.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a schedule for cooking duties, rotating evenly among all roommates.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A decides to save some food for their neighbor, who is elderly and lives alone.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A volunteers to make a grocery run for the household to restock supplies.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A organizes a meeting to discuss and balance the household budget with roommates.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A starts a collaborative playlist, where each member can add their favorite cooking songs.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers to teach Agent C a more efficient chopping technique observed from a culinary class.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a teenage student, collaborates and engages with family members Agent B and Agent C in the kitchen during a weekend afternoon. They juggle between educational responsibilities and imply an eagerness to participate in household activities like cooking and community event preparations.",
    "actions": [
      {
        "description": "Agent A offers to help Agent B with cooking, suggesting they could prepare part of the meal together.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes allocating cooking responsibilities for the upcoming week, ensuring everyone contributes and learns equally.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A takes the initiative to organize the family's meal prep schedule for the coming month.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to research and incorporate new healthy recipes into the weekly meal plan.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A chooses to study at a later time to assist Agent C with finishing the community event poster.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A gently reminds family members about equitable usage of the common space and respecting each other's project time.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A sets a kitchen timer, effectively managing both study and cooking time, while encouraging the family to do the same.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A cleans up the clutter at the kitchen table to create a more conducive environment for everyone's tasks.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A enforces a rule that whoever cooks does not have to do the dishes, balancing the workload within the household.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a household kitchen, 'Agent A' prepares a nutritious breakfast with consideration for their roommates 'Agent B' and 'Agent C's dietary preferences. As they ready themselves to eat, 'Agent A' ensures an inclusive atmosphere through offering and managing the food, taking into account shared resources and individual needs.",
    "actions": [
      {
        "description": "'Agent A' serves equal breakfast portions to both 'Agent B' and 'Agent C'.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "'Agent A' invites 'Agent C' to join for breakfast after their jog.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "'Agent A' packs up a portion of the breakfast for 'Agent C' to take for post-jog nourishment.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "'Agent A' keeps the leftover ingredients for future meals.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "'Agent A' places spicy sauce on the side for individual preference.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "'Agent A' eats the smaller breakfast portion seeing 'Agent B' needs more.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "'Agent A' proposes a shared meal plan for equitable grocery management.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "'Agent A' brews coffee to the shared taste of the house.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a sunlit kitchen, Agent A, a young adult, is preparing a weekend family brunch. Agent B and Agent C, his housemates, are lounging in the adjoining dining area. A meal plan comprises a balanced menu on the refrigerator door, and a variety of fruits and vegetables are spread across the counter. Agent A serves everyone an equal share and attends to Agent B's dietary restrictions.",
    "actions": [
      {
        "description": "Agent A serves the family brunch, carefully ensuring everyone gets an equal share of the food.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a quick but inclusive workout session for the household.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers a portion of their own meal to Agent B.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests purchasing a water filter to encourage more tap water consumption.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent C for an afternoon walk in the park.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A commits to researching new recipes that cater to everyone's dietary needs.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A organizes a meeting for inclusive meal planning.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A proposes a cooking challenge to spark Agent C's interest.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, alongside classmates Agent B and Agent C, prepares a group study session at home with equitable study schedule and maintenance of a conducive learning environment including proper sustenance, lighting, and rest.",
    "actions": [
      {
        "description": "Agent A suggests allocating an equal amount of time for each study subject.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A shares his notes with Agent B and Agent C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A volunteers to make dinner for the group.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes a group exercise break.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A opens the windows to let in fresh air.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes equitable snack arrangements.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A spends extra time explaining a concept to Agent C.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A rotates the study moderator role.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A rearranges the lighting at night.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is in the apartment kitchen with roommates. Agent B is studying and Agent C returns from a run. It's lunchtime, and resources like food and a quiet study space need to be managed.",
    "actions": [
      {
        "description": "Agent A decides to prepare a nutritious meal for themselves and offers to cook enough for everyone.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a study break to Agent B and proposes a group exercise session for all roommates to re-energize.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A splits the available groceries equitably among the roommates when deciding what to cook.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A takes a nap to recover from a lack of sleep the night before.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A opts to study alone, ignoring their roommate's need for a quiet environment.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          -0.8
        ]
      },
      {
        "description": "Agent A allows Agent C to shower first since they have just returned from a run.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A uses the last of certain ingredients without asking, to prepare a personal favorite dish.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          -0.9
        ]
      },
      {
        "description": "Agent A organizes a rotation schedule for household chores to establish a balanced responsibility-sharing system.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A plans a jogging route that accommodates Agent C's desired distance and Agent B's study schedule.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is hosting a dinner party, making sure the table is well-prepared, with plenty of options for friends Agent B and Agent C. Agent A is attentive to everyone's needs, including hydration and air quality, and is considerate about sharing resources and recognizing contributions.",
    "actions": [
      {
        "description": "Agent A offers advice on healthy food options.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A insists on serving the pie Agent C brought.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A divides the remaining dishes equally for leftovers.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A refills everyone's water glass.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A encourages a group activity involving physical movement.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A opens the windows to let in fresh air.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A suggests a weekly meal-prep group session.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A cleans up and sorts waste for recycling.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers extra food to a neighbor.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is engaged in meal prep within the shared apartment kitchen. With the counter laden with a variety of food items, Agents B and C become part of this dynamic as they seek snacks and handle household bills. Multiple interests and responsibilities cross paths in a shared living space, demonstrating a balance of individual and communal needs.",
    "actions": [
      {
        "description": "Agent A offers to prepare a specific dish for Agent B's post-training meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A equally divides the communal meal into portions for all housemates.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A cooks at a time that doesn't interrupt Agent B's quick snack needs.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A creates a night-time quiet policy in the kitchen.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A batch-prepares meals to reduce kitchen traffic for the week.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A uses headphones to focus while respecting the shared space.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A labels food items for clarity on sharability.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A and her roommates, Agents B and C, have transformed their shared living space into a temporary gym. They are following a strict fitness challenge, much to the discomfort of their neighbor, Agent D, who has complained about the noise.",
    "actions": [
      {
        "description": "Agent A writes an apology note to Agent D and includes an offer to discuss a compromise on workout times.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A investigates workout equipment that would minimize noise.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A calls for a house meeting to discuss the neighbor's complaint.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes to rotate high-impact exercises with quieter ones.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A elects to take intensive workouts to a nearby park.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A engages in meal planning for adequate sustenance.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A forgoes exercises to personally visit Agent D.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A creates a community fitness challenge.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A schedules specific times for the living room to be used for workouts and when it is a quiet area.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is a teenager preparing a meal in the family kitchen. The countertops are cluttered with various vegetables and cooking utensils. Agent B, their sibling, is doing schoolwork at the table, and Agent C, their cousin, is lounging on the couch. Agent A faces the decision of making a quick meal for themselves or a larger meal for everyone.",
    "actions": [
      {
        "description": "Agent A decides to make a large, nutritious meal that everyone can share.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A chooses to double the recipe to ensure there is enough food for unexpected guests.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A organizes the kitchen to create a more efficient cooking environment.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to join in the meal preparation, fostering a collaborative atmosphere.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A carefully portions out the servings to ensure everyone gets an equal share.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A opts to leave the leftovers for Agent B, who has an exam the next day and might need more sustenance.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to prioritize their own meal, quickly making only enough for themselves.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          -0.4
        ]
      },
      {
        "description": "Agent A disregards cleaning up after cooking, expecting Agents B and C to handle it.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.0,
          -0.7
        ]
      },
      {
        "description": "Agent A initiates a meal planning discussion to better accommodate everyone's dietary needs in the future.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a home, Agent A notices the full compost bin and wilted plants, while other family members are busy with their tasks. Agent A remembers their responsibility and the importance of shared household chores.",
    "actions": [
      {
        "description": "Agent A takes compost out to the bin and replaces liner with a fresh one.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A waters the plants, checking each for moisture.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A chooses to ignore chores, opting to do something else.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          -0.7
        ]
      },
      {
        "description": "Agent A decides to involve Agent C in chores.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A leaves a note for Agent D regarding chores.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A prepares a healthy snack for Agent B.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A assists Agent B with a school project.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A talks with Agent D to revise the chore plan.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a healthy meal in a shared house kitchen, considering the culinary needs and skills of housemates Agents B and C.",
    "actions": [
      {
        "description": "Agent A decides to make a big pot of vegetable stew, enough to share with Agent B and Agent C.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers to teach Agent C a basic cooking technique while preparing the meal.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A begins a meal prep session, organizing ingredients for all three housemates who plan to cook later.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a cleaning roster for the week, ensuring everyone contributes equally to the shared space.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A leaves detailed notes on the counter about the shelf life and nutritional content of the shared ingredients.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a house meeting to discuss equitable use of the kitchen and ingredients.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A creates individual spaces in the refrigerator and pantry for each person's ingredients to avoid confusion.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A spends some extra time making a cooking tutorial video for Agent C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A voluntarily takes on a significant portion of the kitchen cleaning for the day, acknowledging that Agent B has a busy schedule.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "After completing a home workout in the living room, Agent A enters the kitchen to hydrate. He finds a bowl with three apples on the table—two fresh, one bruised—and considers his choice, given his children, Agents B and C, are also present and may want apples.",
    "actions": [
      {
        "description": "Agent A chooses the bruised apple, leaving the fresher ones for his children.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A takes a fresh apple after exercising, not considering the bruised one.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          -0.6
        ]
      },
      {
        "description": "Agent A divides the good apples, shares with the children, and eats the bruised one himself.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A asks his children for permission to take a fresh apple due to his nutritional needs.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A shops for more fresh fruit to ensure everyone has enough.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A disregards the bruised apple and takes a good one for himself.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          -0.8
        ]
      },
      {
        "description": "Agent A prepares a smoothie using the bruised apple and other ingredients.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A consumes the bruised apple and insists his children have the fresh ones.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A selects the best apple for himself without addressing the bruised one.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          -0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A sits at the kitchen table with fresh produce and cooking ingredients, joined by roommates and a neighbor as they prepare a meal and plan meals for the week.",
    "actions": [
      {
        "description": "Agent A volunteers to do the meal planning for the week using the cookbook.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A offers to wash and prepare the vegetables for the meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A suggests a system for rotating cooking duties.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A allocates some of the cooked food to an elderly neighbor.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A commits to waking up early for a run.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes opening windows while cooking for a fresh environment.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A selects recipes that use minimal electricity or gas.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A advocates for using leftovers creatively.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A chooses to eat smaller portions to ensure everyone gets an equal share.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "A suburban household is preparing for a neighborhood communal dinner; the teenager, Agent A, is gardening, parent Agent C is cooking, and the younger sibling, Agent B, is finishing schoolwork. They aim to balance personal responsibilities with their commitment to contribute equally to the communal effort.",
    "actions": [
      {
        "description": "Agent A selects vegetables to contribute to the communal dinner.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A aids Agent C in meal preparation to efficiently balance the workload.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A chooses the most ripe vegetables for picking.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A keeps a small portion of fresh vegetables for their household's meal.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A plans a rotating assistance schedule with Agent B for kitchen help.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A saves seeds from the harvest for future planting.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers encouragement and help to Agent B with their school assignment.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A takes a short rest.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent B to learn and assist in harvesting.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, returns from a jog and enters a kitchen where roommates are going about their morning routines. The household maintains a shared cleaning schedule and a stocked fridge with a communal agreement on ingredient contributions.",
    "actions": [
      {
        "description": "Agent A prepares a homemade breakfast using shared ingredients, ensuring to replace what he uses.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to blend a larger batch of the smoothie for all roommates.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes alternating cleaning days with Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A opens windows to let in fresh air.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C for a walk to take a break from work.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits down to plan a balanced weekly menu.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A updates roommates on supplies that need restocking.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A does his cleaning duty efficiently without overexerting.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a meeting to discuss the cleaning schedule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A plans a get-together at home and prepares for an afternoon of activities and shared meal with Agent B and C. Agent A sets the living room with board games and a cooking space and drafts a schedule for a balanced share of fun and meal preparations.",
    "actions": [
      {
        "description": "Agent A thoroughly washes the fruits and vegetables for cooking.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A organizes a brief team stretching session.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A insists on preparing a well-portioned meal.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A encourages Agent B and Agent C to choose a board game.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A rotates the roles within the cooking process.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A opens windows to let in fresh air.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A proposes a voting system for movie selection.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A suggests taking turns sharing personal stories.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A diligently monitors the cooking time.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is planning a weekend workout routine and showing a chore schedule to Agent B who is studying. Agent C is interested in their efficient sharing of responsibilities.",
    "actions": [
      {
        "description": "Agent A arranges a meeting to discuss a joint exercise strategy respecting individual schedules.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A volunteers to take an extra chore off Agent B's list for exam week.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests aligned break times for shared healthy snacks and hydration.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a weekly meeting to adjust the responsibility schedule.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to wake up earlier for her morning run to avoid disturbing Agent B.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A uses the blender for smoothies after workouts for everyone.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A modifies her workout plan to include quieter exercises.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A invites Agent C to join the workout sessions and chores.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A compiles a list of nutritious recipes to share with Agents B and C.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is preparing a meal plan for the upcoming week in a shared apartment with others. They're discussing grocery shopping and cooking schedules in a cooperative manner.",
    "actions": [
      {
        "description": "Agent A proposes to create a combined grocery list with Agent B and Agent C.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to cook the first meal of the week for everyone.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests setting up a rotating cooking schedule.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A volunteers to track expenses and evenly split the costs.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A recommends devising a menu based on all three agents’ dietary needs.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A checks the recipes he knows for scalable options.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to start a health challenge with his roommates.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A sets aside a portion of his personal groceries for shared use.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers to share his textbooks on nutrition.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a nutritionist, is in the kitchen preparing a variety of healthy meals. Agent B is budgeting at the dining table, while Agent C works on a school project. The household is filled with cooking sounds and smells, with a breeze coming through the window.",
    "actions": [
      {
        "description": "Agent A allocates portions of the cooked meals into containers labeling them based on dietary needs.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A organizes a family meeting to discuss and agree on the next week's meals.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers help with budgeting or the school project to Agent B and Agent C.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A takes a short break from cooking to do some stretching exercises.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C for a walk outside to refresh.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A cleans up the kitchen space after cooking.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A cooks extra food to donate to a local shelter.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A discusses household chores with Agent B and Agent C, for equal participation.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A researches new recipes for diverse tastes of the household.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is at home preparing for dinner, with ingredients ready. Agent B is distracted by television and a smartphone, while Agent C is doing homework but is also distracted. Agent A values a well-prepared meal and collective responsibilities.",
    "actions": [
      {
        "description": "Agent A asks Agent B and Agent C to help prepare the meal.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A cooks alone to ensure timely meal preparation.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          -0.5
        ]
      },
      {
        "description": "Agent A distributes kitchen tasks to Agent B and Agent C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A initiates a post-dinner cleanup competition with supervision.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A prepares a considerate and elaborate dinner.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A incorporates Agent B and C in meal planning for the week.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A consults with Agents B and C on the dinner menu.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A disregards the clutter and focuses on dinner efficiency.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          -0.3
        ]
      },
      {
        "description": "Agent A makes extra food to share with neighbors.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a cozy, sunlit kitchen, Agent A is preparing a stew, with Agent B working at the table, and Agent C searching for a recipe. They are all within shared space, filled with the aroma of cooking and a garden waiting outside.",
    "actions": [
      {
        "description": "Agent A invites Agent B and C to help with meal preparation, offering them specific tasks.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A portions out the stew equitably to ensure no one goes hungry.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A calls a meeting to discuss a weekly meal plan with everyone's input.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A makes an extra batch of stew for future convenience.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers to teach Agent C how to sauté vegetables.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A suggests Agent C pick an ingredient from their garden for the stew.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a cleanup schedule for post-meal tidiness.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A sets aside some stew before adding a spicy ingredient for Agent C.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes taking turns selecting music while cooking.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is in the kitchen preparing a nutritious breakfast with fruits, vegetables, and lean proteins. The environment is homely with fresh air and a whiteboard promoting organized and shared household responsibilities.",
    "actions": [
      {
        "description": "Agent A invites Agent B to help cook the meal, teaching them the value of preparing a wholesome meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A prepares the table setting, placing the same number of food options in front of each seat.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A creates a meal prep schedule that includes everyone in the house, ensuring shared responsibilities.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A leads a morning workout session in the backyard for the household members.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A plans an equal amount of ingredients for each person, considering dietary restrictions.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A decides to open additional windows to let more fresh air into the home.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A schedules a restful 20-minute nap to recharge after breakfast.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          -0.3
        ]
      },
      {
        "description": "Agent A distributes the chores evenly, rotating on a weekly basis.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A ensures that the conversation involves everyone equally during mealtime.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a university student living with roommates, stands in the kitchen of their shared apartment, examining the contents of the refrigerator while considering what to make for breakfast in a way that does not overuse communal supplies and respects his roommates' dietary preferences.",
    "actions": [
      {
        "description": "Agent A decides to make a large batch of pancakes, enough to share with his roommates.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A sets aside some of the freshly made food in a container for Agent D, who is still busy preparing a shake.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A carefully chooses ingredients for the meal, balancing use of communal items and his own.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A coordinates with Agents B and C to schedule cooking times, so they don’t crowd the kitchen.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "After eating, Agent A cleans the kitchen and the utensils used, to maintain a pleasant living space.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A labels the leftover pancakes with a note for anyone to take some if they want.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A notices that the communal milk is almost out and adds it to the shopping list, planning to replace it.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A apologizes to Agent C for using the last two eggs assuming they were for communal use and offers him some of his pancakes.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a university student, is in the kitchen preparing a weekly meal plan, while Agent B is tired from basketball practice, and Agent C struggles with homework and snacks.",
    "actions": [
      {
        "description": "Agent A cooks a large, nutritious meal to last several days, ensuring everyone has access to healthy food.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A creates a rotating chore schedule that includes meal prep and clean-up tasks, displaying it on the fridge.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A sits with Agent C to collaboratively prepare a healthy snack, incorporating a mini-lesson on good nutrition.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent B to join in meal planning to incorporate their preferences and encourage their involvement.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A cleans up the kitchen immediately after meal prep to maintain a hygienic environment.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A decides to walk to the grocery store rather than drive to incorporate exercise into the routine.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A allocates portions of the meal equally to ensure everyone gets the same amount.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A sets aside time in the evening for all siblings to partake in light exercise together.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A safeguards some ingredients, knowing one of the siblings is allergic.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, along with Agent B and Agent C, is engaged in food preparation in their shared kitchen. They utilize a whiteboard for equitable distribution of household responsibilities and discuss the optimization of ingredient usage.",
    "actions": [
      {
        "description": "Divide the chili into equal portions for all roommates, including Agent A.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Offer to wash the dishes used by all for meal prepping as today's contribution to household chores.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Update the whiteboard to reflect what ingredients are available and what everyone has contributed.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Invite Agents B and C to a weekly meal planning session to discuss the rotation of cooking responsibilities.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Propose a cleaning roster for the kitchen that equally distributes the workload among all roommates.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Write down a shared shopping list, including household necessities and preferred food items of all roommates.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Offer to make an extra-large batch of chili next time if others agree to contribute ingredients.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Suggest an exercise routine to the roommates that can be done together in the living room for daily activity.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Check if any roommates need help with their meal prep and assist them.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a vegetable-rich meal in the kitchen, Agent B relaxes and browses a tablet, Agent C sorts laundry, and Agent D brings home more groceries.",
    "actions": [
      {
        "description": "Agent A prepares a substantial meal considering all dietary preferences.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A sets aside food for a sick neighbor.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A invites others to help cook.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A uses a new quick and healthy recipe.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A clears out old groceries.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A doesn't make a dish that Agent B dislikes.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A reorganizes kitchen for easier access.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A donates extra food to a shelter.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A arranges a meeting to discuss equitable food budgeting and shopping.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a freelance graphic designer, breaks from work and enters the kitchen where Agents B and C debate over the last slice of pizza.",
    "actions": [
      {
        "description": "Agent A proposes they split the pizza three ways.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A decides to forfeit his share of the pizza.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A chooses to make a new dish and share.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to go out and buy more pizza.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A makes a joke to lighten the mood.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A grabs a fruit for himself to eat.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A offers a game for the pizza.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A takes the pizza for himself.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          -0.7
        ]
      },
      {
        "description": "Agent A suggests drawing lots for the pizza.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a shared household kitchen, Agent A ponders whether to eat the last slice of cake or leave it for someone else, considering the household's unspoken rule for equal sharing.",
    "actions": [
      {
        "description": "Agent A decides to ask Agent C if they had any cake yet.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A leaves a note for Agent B asking about the cake.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A divides the cake in half to share with Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A opts to save the piece of cake for Agent B.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A chooses to eat some fruit instead of the cake.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests making a quick snack with Agent C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A just takes the last piece of cake.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          -0.8
        ]
      },
      {
        "description": "Agent A considers Agent C’s fatigue and offers them the cake.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A wakes Agent B to ask about the cake.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          -0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a high school student, comes home and enters the kitchen where Agent B is hydrating after a workout and Agent C is preparing dinner, ensuring even portion distribution. Agent A contemplates their lack of physical activity for the day.",
    "actions": [
      {
        "description": "Agent A decides to go for a quick run outside before dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A encourages Agent B to join them for a cool-down stretching session.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A discusses with Agent C to learn the recipe of the nutritious meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A helps set the table, ensuring an equal setting for all family members.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes to open more windows in the dining area for better air circulation.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers to serve the meal to ensure equal portion distribution.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A opts for an indoor workout to not delay family dinner time.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A chooses a smaller portion for dinner to conserve more food for others.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests implementing a family exercise routine.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is prepping for the week with a meal planning session, Agent B is studying at the dining table, and Agent C declares the intention to create a new recipe.",
    "actions": [
      {
        "description": "Agent A allocates a section of the fridge for each roommate's meal prep containers.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a discussion about dividing house chores including meal cleanup.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests creating a schedule for kitchen usage to prepare meals.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A volunteers to share meal prep tips with Agent C.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to organize a joint shopping trip to purchase ingredients.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes cooking a meal together once a week.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A creates a communal fund for shared essentials.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A carefully listens to Agent C's recipe ideas before offering feedback.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A shares his portion of a rare ingredient with Agent C for the new dish.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a kitchen, Agent A finds pantry items running low and recalls the shared responsibility for household duties. Agent A is also conscious of preparing a balanced breakfast for the family.",
    "actions": [
      {
        "description": "Agent A prepares breakfast with even distribution of ingredients.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A writes a considerate grocery list.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A forgoes their breakfast for others.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A makes a large batch of smoothies for all.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a grocery schedule with input from others.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes starting a kitchen garden.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A goes for a jog for daily exercise.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A opens windows for fresh air.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A uses and replaces the last of an ingredient.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A finishes a morning run and joins the family household where breakfast is being prepared. Despite the focus on nutritional food and shared meals, there’s an observable imbalance regarding workload and rest among the family members, with Agent D especially affected.",
    "actions": [
      {
        "description": "Agent A puts together a balanced breakfast plate for Agent D.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A invites Agent D on a light walk after breakfast.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes to revise with Agent D later.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A lets Agent D sleep in and saves some breakfast.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A persuades Agent B to make extra fruit salad.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A cleans the kitchen and dining area.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A opens all the windows to let in fresh air.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A encourages Agent C to share wellness tips with Agent D.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A wakes Agent D for breakfast.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a suburban home, Agent A, preparing for a marathon, pauses their exercise regimen, aware of the domestic imbalance created by Agent D's absence due to work commitments. Agent B is multitasking in the kitchen, while Agent C struggles with school projects, creating an environment where chores and preparations weigh down on every member.",
    "actions": [
      {
        "description": "Agent A offers to fold the laundry, helping to balance the domestic workload.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A helps Agent C organize school projects, promoting effective time management.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A ignores the laundry to continue their training.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          -0.8
        ]
      },
      {
        "description": "Agent A suggests a group workout, for an energizing break.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A proposes a salad dinner to maintain healthy eating.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A takes a solitary walk for mental clarity.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A introduces physical activity into Agent C's study routine.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A insists that Agent D should not do chores due to work pressure.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          -0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a bright, airy kitchen, Agent A and his roommates, Agents B and C, are gathered for their monthly meeting. Agent A presents a handwritten ledger with meticulous notes on shared expenses and chores. Agent B is slicing fruit and vegetables, while Agent C is looking through workout class flyers. A baked casserole has been prepared by Agent A for a nutritious shared meal.",
    "actions": [
      {
        "description": "Agent A proposes a rotating schedule for chores.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a joint grocery shopping trip.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A offers to audit utility usage.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A initiates setting up a restocking routine for water filters.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A encourages meal-planning for balanced diets.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A does the dishes immediately after lunch.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A voluntarily advances some money for the common fund.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A consults before deciding on an exercise class.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A creates a quiet time policy.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a responsible parent and a dedicated marathon runner, is in their kitchen with their family. Tension regarding the decision of afternoon activities is apparent.",
    "actions": [
      {
        "description": "Agent A suggests involving the entire family in deciding the afternoon activities.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers to prepare a rotating schedule for family chores.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to participate in a fun fitness challenge with the children.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A declines to assist with a task they usually do, citing a need to rest.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          -0.5
        ]
      },
      {
        "description": "Agent A chooses to unilaterally decide the afternoon’s activities.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          -0.8
        ]
      },
      {
        "description": "Agent A encourages Agent B to organize and use or return unused library books.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A promises Agent C a bike ride after breakfast.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A volunteers to clean up the breakfast dishes alone.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is in the shared kitchen of their apartment, preparing a grocery list for the week. Agent B, a roommate, is chopping vegetables for lunch. Agent C, another roommate, declares their plan to start a meal plan for healthier living.",
    "actions": [
      {
        "description": "Agent A decides to include more fresh fruits and vegetables in the grocery list to support Agent C's new meal plan.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A chooses to remove sugary snacks from the list, even though they are Agent B's favorites.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          -0.3
        ]
      },
      {
        "description": "Agent A proposes a meeting with all roommates to discuss the budget and dietary preferences openly.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A talks to Agent C about combining their grocery trips to save money and time.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A deliberately ignores Agent C's meal plan and only focuses on their own dietary needs.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          -0.8
        ]
      },
      {
        "description": "Agent A voluntarily offers to cook more often in order to ensure that the meals align with everyone's preferences.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A sticks to the budget strictly, overlooking the need for variety in their roommates' diet.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A creates a rotating meal planning schedule, so each roommate contributes to the meal planning equally.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A purchases only the cheapest items, without considering nutritional value, to stay within budget.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, preparing a nutritious meal in the kitchen, takes into account each family member's dietary requirements and preferences, ensuring an equitable share of food. Agent B looks for a snack, and Agent C takes coffee breaks between work.",
    "actions": [
      {
        "description": "Agent A creates a meal plan for the week considering every member's dietary needs.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A measures ingredients for equitable food distribution.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A teaches Agent B cooking skills during meal prep.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A makes a new dish from leftovers to minimize waste.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A schedules a kitchen cleanup with everyone's participation.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A reallocates the grocery budget for better quality food.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A joins Agent C for a coffee break to rest.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A calls a family meeting to revise the meal plan.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A cooks in large batches for future meals, saving time.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a bustling family kitchen, Agent A, a nutrition-conscious parent, is preparing a weekend meal. Agent B lounges at the kitchen table sipping on water after a morning jog. Agent C enters, excited to help with meal prep. A whiteboard notes down everyone’s preferred meals, ensuring everyone’s dietary needs and preferences are respected.",
    "actions": [
      {
        "description": "Agent A crafts a menu for the week, considering each family member's dietary preferences and nutritional needs.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A allocates cooking tasks to Agent C to engage them in meal preparation.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A discusses the meal plan with Agent B and invites suggestions.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A adjusts the recipe for Agent C's new vegetarian dish preference.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A suggests a family walk after the meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A emphasizes hydration during the meal.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A plans to portion out the meal for the next day's lunch.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A lets Agent C pick the family movie as a reward.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A includes a new vegetable into the meal from the garden.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A prepares a nutritious breakfast in a shared apartment while Agent B works on his resume and Agent C sorts bills. Agent A focuses on maintaining a healthy and equitable shared living environment.",
    "actions": [
      {
        "description": "Agent A divides the breakfast equally among all roommates.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A invites Agent C to a morning workout post-breakfast.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A proposes a cleaning schedule with equal participation.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A plans a grocery run and asks for roommates' preferences.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a monthly budget meeting for apartment expenses.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers to help Agent B with job search preparations.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A takes a nap after breakfast to recharge.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.0,
          -0.5
        ]
      },
      {
        "description": "Agent A skips his own meal to ensure B and C have enough.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A insists on rotating meal preparations among roommates.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is a teenager sitting at the kitchen table on a Saturday morning, surrounded by books and notes - today is study day. Agent B is busy preparing a nutritious breakfast. Agent C is sorting out DVDs and deciding on which to watch later while exercising on a stationary bike. The home is peaceful, with natural light and fresh air coming through the open windows.",
    "actions": [
      {
        "description": "Agent A offers to help prepare the breakfast to ensure it’s ready on time for everyone.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A decides to take a break from studying to join Agent C for a short exercise session.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A proposes to prepare a study schedule that includes regular breaks for stretching and snacking to maintain concentration.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A uses a portion of the study time to prepare healthy snacks for everyone to enjoy during the day.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A opens more windows in the study area to let in additional fresh air.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent C to study together, offering to share notes and study aids.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A organizes a rotation for use of the study space, ensuring equal access for all.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A takes a short nap during a study break, considering it will help with absorbing information.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A arrives home from work and joins Agent B, who is sorting through bills and receipts at the dining table. Agent C and Agent D are engaged in a puzzle on the couch. The smell of a cooked meal pervades the home.",
    "actions": [
      {
        "description": "Agent A takes over the dinner final preparations to allow Agent B to focus on finances.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A recommends creating a family budgeting plan for financial management.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A talks to Agent C and D about rotating daily chores for balanced workload distribution.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A engages Agents C and D in a light strength-training routine post-meal.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A uses leftover ingredients to cook an additional dish for sufficient food supply.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A opens windows to bring fresh air into the home while tackling chores.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A suggests a family walk in the neighborhood post-dinner.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          -0.3
        ]
      },
      {
        "description": "Agent A offers help with the puzzle, prioritizing dinner completion.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A takes a smaller portion of the meal to ensure enough food for everyone.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is in the kitchen of a shared flat, preparing a meal with various ingredients. Agent B is at the dining table working on their laptop. Agent C enters, looking at the food. The table is set for communal dining with four plates, and the kitchen windows are open.",
    "actions": [
      {
        "description": "Agent A cooks a nutritious meal divided equally among the housemates.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A lets roommates customize their portions of the meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A organizes a weekly meal prep schedule for each housemate to cook.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A cleans up after cooking to maintain a clean kitchen.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a grocery shopping rota with a shared list.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A invites others to join in the meal prep collaboratively.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A keeps the meal warm for Agent D, who comes home late.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a cooking lesson for the other agents.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A makes an extra portion for their next day's lunch.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          -0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, has arrived home from school and notices there are opportunities for physical activity and family engagement. The ingredients for dinner are ready, and there is room for everyone to participate in setting up and enjoying the rest of the evening together.",
    "actions": [
      {
        "description": "Agent A decides to use the yoga mat for a quick stretching session before dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A offers to help Agent C set the rest of the table, ensuring that each person has the same number of utensils and a napkin.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "After dinner, Agent A suggests a family board game where each player has an equal chance of winning.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Noticing that Agent C struggles with heavy plates, Agent A takes over to even the workload.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A takes a brisk walk in the garden post-dinner for fresh air.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "When deciding what game to play, Agent A ensures that all family members' opinions are heard before making a choice.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A proposes to organize the fridge to better track water consumption.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Before bedtime, Agent A offers to share their study notes with Agent C, who has an upcoming test.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a suburban household, Agent A is engaged in a home renovation project with Agent B and Agent C, working together to efficiently repaint the living room, ensuring the space is well ventilated and tasks are equitably shared.",
    "actions": [
      {
        "description": "Agent A offers to swap tasks with Agent B after noticing they seem tired.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A carefully cleans the brushes and equipment after use, setting a responsible example.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A prepares a nutritious meal for everyone to share after the painting session.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A enthusiastically organizes a schedule to balance work and breaks.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a voting system for choosing the next color when a disagreement arises.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A takes the initiative to set up a comfortable resting area for breaks.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A makes sure that the windows remain open for air circulation while they work.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A gently reminds Agent C to wear a face mask while sanding the walls.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A insists on cleaning the spills to prevent slips and accidents.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a stew for the family dinner. Agent B is washing vegetables, and Agent C is chopping herbs. They discuss sustainable living and consider incorporating new recipes for health and environmental benefits.",
    "actions": [
      {
        "description": "Agent A decides to include more vegetables in the stew and reduce the amount of meat to plant-based proportions.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A uses water-saving techniques while finishing up cooking, like using the water from rinsed vegetables to water the plants.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests that the family should start implementing a meal plan to minimize food waste.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to teach Agent B how to cook the stew, promoting shared learning and skill development.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a rotating cooking schedule for the family, allowing each member to prepare a meal equally.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A saves a portion of the stew to share with a neighbor who is known to sometimes skip meals due to economic hardship.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A sits down to calculate the nutritional content of the stew to ensure it meets the dietary needs of the family.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A sets aside time after dinner to discuss the family's dietary preferences and environmental concerns.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A celebrates the completed dish with the family, emphasizing the importance of their collective effort.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is a college student living with two roommates, engaging in a joint cleaning effort at their shared house. With the fresh breeze flowing through open windows, he discovers a box of quality snacks that they had all contributed to but forgotten.",
    "actions": [
      {
        "description": "Agent A continues vigorous cleaning efforts in the kitchen.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A revitalizes by performing a set of push-ups during a cleaning break.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A involves roommates in the decision-making process for the found snacks.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A encourages democratic decision through a vote on snack consumption.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A offers to prepare a nutritious lunch for the house.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A prioritizes cleaning over eating lunch.",
        "values": [
          0.0,
          -1.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a cleaning schedule to distribute chores equitably.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A reminds the house to maintain cleanliness through a group message.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A allocates some snacks for donation.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In the bustling kitchen of a suburban home, Agent A and their housemates, Agent B and Agent C, begin their evening routine. Agent A notes the need for a rejuvenating meal and suggests that they make dinner together using the fresh produce they've contributed to purchasing. The tasks are divided equitably among the housemates.",
    "actions": [
      {
        "description": "Agent A voluntarily takes on the task of preparing the vegetables.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests rotating cooking days among the housemates.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to wash the dishes offering Agents B and C rest.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A opens the windows while cooking to let in fresh air.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A carefully measures out the portions for an equal share of the meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A initiates brainstorming for meal ideas.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A reads a nutritional article for the benefit of the household.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A declines to prepare a separate dish for themselves.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A commits to picking up groceries considering everyone's preferences.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, arrives home and sees Agent B preparing dinner and Agent C setting the table. Fresh air fills the kitchen from an open window, and a harvest basket of apples sits on the windowsill. Agent A spots the chore schedule and thinks about the post-dinner activity for the family.",
    "actions": [
      {
        "description": "Agent A suggests taking turns sharing highlights from their day during dinner.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to help Agent B with the final dinner preparations.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A chooses a family-favorite board game as the post-dinner activity.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to take the family dog for a walk after dinner.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A opts to clean up the dishes alone after dinner.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes creating a meal planning and preparation schedule for the week.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A takes a quick rest before dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          -0.4
        ]
      },
      {
        "description": "Agent A debates whether to further open or close the windows before dinner.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a home setting, Agent A notices overripe bananas and a bag of unused flour and considers their use. Agent B is engrossed in reading, unaware of the groceries situation. Agent C arrives at the door with a basket of fresh tomatoes as a friendly gesture. Agent A contemplates the meal preparations and household responsibilities they share with Agent B and how to respond to Agent C's offer.",
    "actions": [
      {
        "description": "Agent A decides to use the bananas and other available ingredients to bake banana bread, utilizing the resources at hand.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A sets aside a significant portion of the bread for Agent B, ensuring they have an equal share.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A invites Agent C to join them for a meal as a way of returning the friendly gesture.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes creating a roster to equally distribute household chores, including grocery shopping, between themselves and Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A cleans the refrigerator, throwing away expired items and making a list for necessary groceries based on balanced meal planning.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A prepares a nutritious meal for themselves and Agent B, using the tomatoes brought by Agent C.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A offers to teach Agent B how to bake bread, so they can alternate this task in the future.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A sits with Agent B to plan a weekly menu, considering balanced meals and minimizing food waste.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a university student, is in a household kitchen preparing a nutritious meal while their younger sibling Agent B studies at the dining table. Roommates Agent C is quietly working out in the living room, and Agent D returns home to stock the pantry with groceries. A potential conflict about the communal use of food is on the horizon among the house members.",
    "actions": [
      {
        "description": "Agent A calls a house meeting to address the communal food issue.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A sets up a meal prep schedule for the house.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A institutes a grocery shopping rotation.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A organizes a fridge cleanup.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A organizes a group study session with healthy snacks.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests a 'replace what you consume' rule.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A labels certain foods as personal.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A plans a weekly exercise session for the house.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A begins a discussion on quiet hours in the house.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, setting up a meal prep for the week in the kitchen, considers equitable sharing of food and household responsibilities with Agent B and Agent C present.",
    "actions": [
      {
        "description": "Divide prepped meals evenly among housemates.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Use fresh produce before it spoils, encouraging others to do the same.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Organize a rotating schedule for household tasks.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Suggest a group workout session for health and bonding.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Assign fridge shelves for personal dietary needs.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Take on an extra chore when a housemate is unwell.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Arrange a taste-test party with equal participation.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B are in the kitchen preparing a nutrient-focused meal. They discuss the importance of nutrition in their lifestyle. Agent C joins them attracted by the aroma and interested in learning about their choices. Agent D, Agent A’s brother, contemplates joining the meal instead of getting fast food. A conversation about nutrition, lifestyle choices, and environment follows.",
    "actions": [
      {
        "description": "Agent A offers Agent C a taste of the meal they have prepared.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A decides to draft a simple meal plan for Agent D.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agents B, C, and D to contribute to cutting vegetables.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A splits the final meal into equal portions.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A suggests cleaning up together.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A opens the windows to let fresh air circulate.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A ensures that Agent D’s meal plan includes accessible options for a student budget.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A leads a brief group exercise post-meal.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A uses eco-friendly containers for leftovers to avoid waste.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, has finished a morning jog and is preparing breakfast for themselves and their roommates, Agent B and Agent C. The apartment is peaceful with the ingredients of cooperation already in the air as they navigate their shared living space.",
    "actions": [
      {
        "description": "Agent A reminds Agent B about their agreement to share chores and suggests washing dishes.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A washes the dishes themselves for a pleasant environment.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A leaves the dishes untouched to respect the agreement.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A offers to swap chores with Agent B.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A asks Agent C to assist with dishes.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A discusses revising chore schedule.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A plans a rotating chore schedule.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A talks about the importance of shared tasks.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A initiates a cleanup hour.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A makes a nutritious breakfast smoothie, while roommates Agent B and Agent C prepare their own meals. They realize they are running low on shared groceries and Agent A suggests making a collaborative list and offers to shop later.",
    "actions": [
      {
        "description": "Agent A proposes creating a schedule for each roommate to evenly split cooking duties.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A volunteers to do the grocery shopping for the week using a list that everyone contributes to.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A plans to cycle to the store instead of driving to minimize environmental impact.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A decides to bulk cook a healthy meal for all roommates to eat during the week.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A takes initiative to research and share recipes that accommodate all dietary needs in the apartment.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A offers to teach Agent C some budget-friendly meal prep techniques.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A could choose cheaper and less nutritious food options to save money during the grocery run.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          0.0,
          -0.3
        ]
      },
      {
        "description": "Agent A might decide to buy only their personal food items, ignoring the collectively used products.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          -0.9
        ]
      },
      {
        "description": "Agent A could ignore Agent B's and Agent C's schedule constraints and plans the cooking duties at their convenience.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A and their siblings, Agents B and C, are home for the weekend. Agent A decides to prepare a meal using a recipe from Agent B's home economics class. All three are in the kitchen with fresh ingredients, and each has their role in the meal preparation, which promises to be inclusive and equitable.",
    "actions": [
      {
        "description": "Agent A decides to use the recipe from Agent B's home economics class.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a system of taking turns in selecting recipes.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A arranges tasks based on skill levels, assisting Agent B.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A encourages tasting during cooking.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A serves equal portions to all siblings.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A suggests rotating cooking days among siblings.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A cleans the cooking space while the meal cooks.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A establishes a snack availability rule.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A ensures thorough cleaning of dishes post-meal.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a home kitchen, Agent A, a responsible teenager, is preparing brunch. Agents B and C, their younger siblings, neglect their duty to set the table, idly watching TV.",
    "actions": [
      {
        "description": "Agent A gently reminds Agents B and C that they had a deal to help with the meal by setting the table.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a quick and simple physical activity to encourage Agents B and C to get up from the couch.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers to teach Agents B and C a new recipe, involving them in the cooking process.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A delegates the task of filling water pitchers to the siblings.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A decides to make extra portions in anticipation of their hard work and shared responsibilities.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A cracks open a window to let in the fresh air as they cook.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A, after brunch, encourages a group decision on a recreational activity that involves physical movement.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A takes initiative to create a more effective chore schedule.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A ensures that the television is turned off during meal times.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Jamie is in the family kitchen pondering what to prepare for the evening meal, with fresh ingredients laid out on the counter. Taylor is doing homework at the dining table, and Alex sits at the kitchen island, possibly reading an article. A variety of vegetables, protein, and herbs are in the fridge, and a meal plan indicates it's Taylor's favorite meal tonight. However, Alex desires a lighter alternative. Jamie deliberates on how to satisfy the meal preferences present in the kitchen.",
    "actions": [
      {
        "description": "Agent A decides to cook both the time-intensive favorite meal for Agent B and a lighter dish for Agent C.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A chooses only to cook Agent B’s favorite meal, considering the meal plan agreed upon earlier.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A opts to compromise by cooking a dish that takes less time but incorporates elements from both requested meals.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A pulls out a kitchen timer, beginning to cook Agent B’s favorite meal while setting a strict time limit to ensure there’s enough time to prepare a second dish for Agent C.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A asks for Agent B and Agent C’s opinion on postponing the favorite dish to the next day when there’s more time, offering to make something simple and quick for both tonight.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A starts to prepare the favorite meal for Agent B, while suggesting Agent C assist in preparing a side dish that aligns with their preference for a lighter meal.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A invites both Agent B and Agent C to participate in the cooking process as a way to spend quality time together and create a meal that caters to everyone’s taste.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A disregards the meal plan and chooses a new recipe that neither Agent B nor Agent C has tried before, hoping both will enjoy the spontaneity and effort.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A makes the favorite meal but uses alternative cooking methods to speed up the process, potentially affecting the taste and quality of the dish.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a young adult, is poised to prepare a meal in the shared kitchen with their roommates, Agents B and C present. The atmosphere suggests cooperation and the potential for establishing a shared meal prep routine.",
    "actions": [
      {
        "description": "Agent A prepares a large salad and sandwiches for all.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A shares cooking duty.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A considers dietary restrictions.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests exercise while cooking.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes shared meal planning.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A invites additional ingredient contributions.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A cleans the kitchen post-cooking.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A equally divides the food.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A lets others pick dishes first.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "The morning in a family kitchen as three siblings, Agent A, Agent B, and Agent C, engage in their daily routine to prepare for the day ahead.",
    "actions": [
      {
        "description": "Agent A plans portion sizes to ensure sufficient food for all, considering Agent B's extra needs.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A restocks the pantry with thoughtful choices for everyone's preferences.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A sets a rotating kitchen duties schedule for equitable task distribution.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests a morning jog routine for a positive start to the day.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A helps Agent C with sketching technique before breakfast.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A does the dishes alone to give Agent B more preparation time for their workout.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A redistributes chores noticing the unequal workload.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A takes the smallest portion to support Agent B's dietary needs.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A gathers siblings to discuss meal planning for everyone's tastes and needs.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "'Agent A', a health-conscious college student, is preparing a nutritious meal. 'Agent B', the roommate, is slicing fruits for a workout smoothie. 'Agent C', a neighbor and high school track coach, is involved in a meal-prep session discussing community health. The agents share responsibilities for meal prepping, ensuring equal access to health benefits through carefully portioned meals.",
    "actions": [
      {
        "description": "'Agent A' offers to divvy up the meal portions equally, ensuring everyone has a similar nutrient intake.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "'Agent A' proposes a rotating meal preparation schedule for the week.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "'Agent A' suggests using leftovers for a new nutritious dish.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "'Agent A' decides to limit their own smoothie size for 'Agent C' to also enjoy a full glass.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "'Agent A' chooses less expensive ingredients for the meal prep.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "'Agent A' volunteers to coach 'Agent C' through a new exercise circuit.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "'Agent A' ensures all food containers are sealed properly.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "'Agent A' reminds ‘Agent B’ to stay hydrated during workouts.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "'Agent A' commits to researching affordable, nutritious recipes.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In the late afternoon, inside a brightly lit kitchen, Agent A stands at the counter meticulously preparing vegetables for dinner. Agent B is scrubbing the kitchen floor, trying to remove a stubborn stain. Both are focused on their tasks, with a silent agreement that the household chores are shared equally between them. Agent C enters the kitchen looking exhausted after returning from a long run.",
    "actions": [
      {
        "description": "Agent A decides to cook a nutritious meal using the freshly prepared vegetables.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes setting a cleaning schedule ensuring mutual effort.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a group activity to meal prep for the week ahead.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A researches new recipes online to diversify their diet.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent C to assist in the kitchen.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to do the heavier cleaning duties next time.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A schedules a rest after dinner for everyone.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A replaces sodas in the fridge with water bottles.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A opens more windows around the house to improve airflow.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, enters the shared kitchen after classes to cook a nutritious meal. Roommates Agent B is cooking, Agent C comes in from yoga, and Agent D is working on a presentation.",
    "actions": [
      {
        "description": "Agent A decides to cook a meal not only for themselves but for all roommates.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests to Agent D to take a short break and join for dinner as a way to clear their mind.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A cleans up the kitchen after preparing and eating the meal, even though it's not their turn.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A organizes the shared food items in the fridge to make it easier for everyone to see and use what’s available.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to share the meal prepping schedule for the following week for a balanced workload among the roommates.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A makes extra dinner portions and stores them for Agent C, as they noticed they often come home late from class.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a rotation system for buying groceries to evenly distribute the effort.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A encourages Agent D to incorporate some physical exercises into their routine to help with their focus.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A invites all roommates for a shared meal at the same time to encourage togetherness.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a kitchen, Agent A prepares juice while Agent B looks up recipes and Agent C sets up a workout area. They discuss lunch.",
    "actions": [
      {
        "description": "Agent A offers the remaining juice to Agent B.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A sets aside the last of the juice for themselves after serving the others.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A invites Agent C to join them in a quick stretching routine.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A cleans up the juicing equipment.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests they all take a walk after lunch.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a schedule for meal responsibilities.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to make a larger batch of juice next time.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A resolves to use nearly expiring ingredients first.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to do a grocery run to restock.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a university student, lives in a shared house with Agent B and Agent C. Agent A wakes up early and starts preparing for a study session. Agent B is preparing a smoothie, and Agent C is asleep. The fridge is almost empty and there's a discussion pending about household chores. A study group is scheduled to meet in the house later.",
    "actions": [
      {
        "description": "Agent A creates a grocery list, considering everyone's preferences, and goes shopping.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A cooks breakfast with available ingredients to share with Agent B.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A gently wakes up Agent C to include them in planning the day.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests a chore schedule and starts a discussion.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A leaves a note for Agent C about the afternoon study group.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A rotates study area setup for equal access to resources.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A invites housemates for a morning jog before studying.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A takes a short nap to rest for the group study session.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          -0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, is home with their cousin Agent B, who is organizing an indoor soccer game, and neighbor Agent C, who is making a smoothie after a run. Agent A decides to engage in several activities around the house, contributing to their well-being and ensuring inclusive fun.",
    "actions": [
      {
        "description": "Agent A decides to join Agent B and rearrange the furniture in the living room to create more space for the soccer game.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A assists Agent C with chopping fruits and vegetables for the smoothie preparation.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A finds gym equipment in the corner and opts to do a quick workout before dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to message other friends to invite them over for an impromptu indoor soccer match.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A takes on the responsibility of cleaning up the living room after the soccer game to ensure everyone can relax comfortably.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests a rotation in the soccer game so all players have an equal amount of time playing.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A opens the windows to let in the fresh air before starting their workout routine.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a quick nap to recharge before their family returns.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is a teenager who just returned from school and is looking for a snack. Agent B, their younger sibling, struggles to grab an apple from the fridge. Agent C, their parent, has been organizing groceries and cleaning the house. The surroundings include a kitchen with fresh groceries and a living room with exercise equipment.",
    "actions": [
      {
        "description": "Agent A makes a nutritious snack for themselves and Agent B.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A talks to Agent C about dividing house chores more evenly among the family members.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A reorganizes the kitchen table to make space for everyone to sit down and eat together.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A opens the windows to let in fresh air while they engage in their after-school homework.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent B to take a break and suggests a quick outdoor activity for exercise.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A avoids making a snack for Agent B despite noticing their struggle.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.0,
          -0.8
        ]
      },
      {
        "description": "Agent A declines to help Agent C with the groceries, preferring to focus on their own needs.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          -0.9
        ]
      },
      {
        "description": "Agent A leaves the kitchen table cluttered, ignoring the shared need for a clean space.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          -0.7
        ]
      },
      {
        "description": "Agent A ignores Agent B's difficulty and fails to offer assistance to reach the apple.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          -1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, an avid home cook, is preparing a balanced Sunday meal while considering the preferences and dietary restrictions of his housemates, Agent B and Agent C. There's a chart showing the chore schedule, and it's noted that Agent A has both cooking and cleaning duties today. The kitchen is well-ventilated, and both of his housemates are engaged in their activities, seemingly unaware of the mealtime approaching.",
    "actions": [
      {
        "description": "Agent A decides to gently remind Agents B and C about the household chore chart and their upcoming turns.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A portions out the dishes evenly between all three plates, keeping in mind Agent B’s dietary restrictions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A proposes to Agent B and C to rotate the cooking responsibilities each Sunday to share the workload.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A invites Agent B and C to participate in meal preparation as a bonding exercise for future meals.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proactively opens more windows to enhance the ventilation, considering the comfort of all.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to clean up the kitchen alone after the meal to allow Agent B and C more relaxation time.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          0.0,
          -0.5
        ]
      },
      {
        "description": "Agent A creates a sign-up sheet for future meals, encouraging everyone to contribute and choose meals ahead of time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A returns from school and goes to the kitchen where Agents B and C are preparing dinner. Agent A notices the disorganized fridge.",
    "actions": [
      {
        "description": "Agent A rearranges the fridge items to make ingredients more accessible.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A takes the initiative to make a salad with a variety of veggies.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A volunteers to set the table, ensuring equality in utensils and seating.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A brings up a rotating chore schedule for equitable meal prep and cleanup.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A offers to take over chopping from Agent B who looks tired.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A suggests implementing a new healthy recipe that uses available ingredients.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A talks about making meals more environmentally responsible.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A cleans up the kitchen immediately after dinner.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In the family kitchen, preparations for dinner are underway as Agent A browses through cookbooks. Agent B is engrossed in a tablet, while Agent C is engaged in a rush of electronic communication. Neighbor Agent D arrives for the weekly workout session in a bustling scene of aromas and activity.",
    "actions": [
      {
        "description": "Agent A extends a dinner invitation to all present, despite the reduced individual shares.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A starts making an extra dish to ensure there's plenty for all attendees.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A elects to cut the workout short for sufficient rest.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A opens windows for air flow during the exercise.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks for collective help in cleaning post-dinner.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a less strenuous workout for the tired.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A organizes a vote for the choice of additional meal.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A evenly divides the dinner servings among all.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A insists on keeping the workout routine as planned.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is preparing lunch for a family gathering with assistance from Agent B, while Agent C works on homework at the kitchen table. The setting is filled with the aromas of cooking, and Agent A ensures that each sandwich has an equal share of ingredients.",
    "actions": [
      {
        "description": "Offers to teach B how to cook.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Prepares an extra sandwich for C.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Organizes a cooking competition.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Suggests making open-faced sandwiches.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Uses older vegetables first.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Swaps tasks with B.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Distributes leftovers equally.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Creates a schedule for future tasks.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Initiates a group exercise session.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a nutritionist, is preparing a weekly meal plan in the kitchen. Agent B, a sports trainer who is Agent A's roommate, is stretching in the living area. Agent C, a visitor, is observing from the dining table. The kitchen is filled with the scent of fresh vegetables and herbs, and a shared responsibilities chart is visible on the fridge.",
    "actions": [
      {
        "description": "Agent A offers to include Agent B in the weekly meal planning, asking for preferences while considering nutritional balance.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to prepare a large batch of a nutritious recipe for the week ahead.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A volunteers to take on the grocery shopping for the week, suggesting a rotating schedule with Agent B.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes to Agent C to join in on the meal prep, making it a communal activity.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A organizes a conversation about dietary preferences and needs with Agents B and C.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers to teach nutrition and cooking tips to interested Agent C.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A schedules a shared mealtime for all agents.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A creates a workout plan to complement dietary goals and invites others to join.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A rearranges the kitchen for efficiency.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A and his housemates, Agent B and Agent C, are gearing up for a weekend marathon training in their living room. The preparations include readying snacks and water and discussing an equitable training schedule.",
    "actions": [
      {
        "description": "Agent A initiates a warm-up session for everyone before starting the marathon training.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A divides the snacks equitably, ensuring all participants have enough sustenance for the day.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A proposes alternating running laps with Agents B and C to maintain stamina.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A takes charge of refilling the water bottles to keep everyone hydrated throughout the training.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests a break to assess and adjust the training schedule if needed.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent B and Agent C to take part in setting the pace for the next set of laps.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A chooses to extend his run to push his limits, even if it means getting tired sooner.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a suburb, inside a well-lit kitchen, Agent A is preparing a meal. The table seats four, yet only three place settings are prepared. Agent B enters, observes the table, and Agent C follows, carrying water. A wall clock chimes, mealtime. Agent A ensures equal food portions. The aroma of food fills the house. Agent A ponders a resolution for an absent member’s portion.",
    "actions": [
      {
        "description": "Agent A decides to save a portion of the meal for the absent family member.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A starts cleaning up the kitchen after the meal, organizing recycling.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes a new house rule for cooking turns.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A checks the cupboards and makes grocery list.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites others for a post-meal walk.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches meal planning ideas online.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers cooking lesson to Agent B.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A sits to discuss family meal scheduling.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests a chore rotation list.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In the family kitchen, Agent A observes the disorganized pantry and considers reorganizing it after his run. Agent B returns from a night shift, struggling to sleep during the day, and Agent C has difficulty finding her dietary-specific foods.",
    "actions": [
      {
        "description": "Agent A reorganizes the pantry, making healthier food choices more accessible.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A empties the garbage to maintain a clean environment.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A discusses setting shelf spaces for each roommate's dietary needs.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests a cleaning and meal-planning schedule for equitable contributions.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A installs blackout curtains in Agent B’s room to aid sleep during the day.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A sets regular jogging sessions with Agent B.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A volunteers to purchase specific foods for Agent C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A goes through recipe books for meal ideas that cater to all diets.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a common area for exercise equipment for all roommates.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is dividing the remaining slices of bread equally for a meal as Agent B fills two glasses with water. Agent C enters the kitchen, noticing the careful distribution of food. As the day begins, everyone is aware of the need to stretch their limited food supply until the next shopping trip.",
    "actions": [
      {
        "description": "Agent A suggests creating a weekly meal plan to ensure the food is distributed equally and lasts until they can afford to buy more.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A decides to initiate a conversation with Agent B and Agent C about taking turns to cook to share the responsibility.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A plans to research cost-effective, nutritious recipes that could be incorporated into their meal planning.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A proposes to start a small vegetable garden in their backyard to supplement their meals.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A offers to make a budget list for groceries that balances cost with nutritional value.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A thinks about ways to cut costs in other areas to reallocate funds to the grocery budget.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A decides to start doing at-home exercises to maintain physical health.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A considers arranging a meeting with a local food bank to see if they could qualify for assistance.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A addresses the portion sizes at meals to ensure no one in the house goes hungry.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a chef, finds Agent B and Agent C debating who should cook dinner as they are all tired from work. The household has a meal plan, which has this day as Agent A's turn off, yet the atmosphere in the kitchen is tense with fatigue and frustration.",
    "actions": [
      {
        "description": "Agent A offers to prepare a quick and nutritious dinner for everyone despite it not being their turn.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          -0.3
        ]
      },
      {
        "description": "Agent A suggests drawing straws to decide who should cook, to introduce an element of chance into the decision making.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A decides to order takeout for the household, considering everyone’s weary state.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A proposes a cooking challenge, where each person contributes one part of the meal, making it a team effort.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A sets a timer for a 10-minute break, suggesting everyone gather their thoughts and revisit the decision with clearer minds.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A neutralizes the situation by asking everyone to share their day’s experience to create an environment of understanding.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A reminds the group of their meal plan and suggests adhering to it, but offers to assist whoever is cooking.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A motivates Agent B and Agent C to cook together, turning the activity into a fun bonding session.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A takes initiative to start prepping parts of the meal, hoping to inspire Agents B and C to join in.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, finds the shared kitchen in disarray and contemplates actions that align with maintaining a comfortable living environment while ensuring that responsibilities are shared among the roommates.",
    "actions": [
      {
        "description": "Agent A cleans the entire kitchen.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A leaves a friendly reminder note on the fridge.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A only washes their own dishes.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A initiates a cleaning schedule.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A confronts Agent B about the mess.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A organizes a house meeting for policies.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A leaves the kitchen as it is.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          0.0,
          -0.5
        ]
      },
      {
        "description": "Agent A purchases a dishwasher.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          -0.4
        ]
      },
      {
        "description": "Agent A washes dishes while listening to a podcast.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a young adult, is in the kitchen preparing a meal. Agent B, his tired roommate, enters the kitchen. Agent C is sitting at the dining table working on a laptop. Agent D is on the couch in the living room reading a book. Agent A is serving equal portions of the cooked meal.",
    "actions": [
      {
        "description": "Agent A invites Agents B, C, and D to join for a meal, ensuring everyone has a place at the table.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a schedule for weekly meal preparation turns.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A takes extra care to ask about dietary restrictions before serving food.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers to share the recipe after compliments from Agent D regarding the meal.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a group exercise routine for after dinner to engage everyone in physical activity.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          -0.3
        ]
      },
      {
        "description": "Agent A ensures that Agent C, who is busy working, gets served without interrupting their workflow.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A decides to clean up the kitchen post-meal, even though it’s not their turn, noticing others seem tired.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A encourages a discussion on how to better divide household chores.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a suburban home, Agent A is preparing a meal in the kitchen, while Agent B is working on a laptop at the dining table and Agent C relaxes in the living room. Agent A involves B and C in meal planning and prepares a balanced dinner while also respecting dietary restrictions and preferences.",
    "actions": [
      {
        "description": "Preparing a balanced meal that caters to both preferences.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Proposing a jog around the neighborhood after dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Introducing a meal planning rotation system.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Preparing extra portions to share with a neighbor.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Foregoing a favorite snack for others.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Initiating a family meeting for chores distribution.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Setting up a backyard vegetable garden.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Using less seasoning to accommodate dietary restrictions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Encouraging Agent B to join meal prep by offering to finish their work task.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In the kitchen, Agent A coordinates family dinner preparation with attention to individual needs and preferences. Agents B, C, and D assist with tasks around the kitchen and dining area, establishing a sense of communal effort and attentiveness to family well-being.",
    "actions": [
      {
        "description": "Agent A allocates meal portions equally among family members.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A suggests a family walk as a group activity.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A sacrifices their own dessert portion for Agent D.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A prepares a special dish for Agent B.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A ensures all family members contribute to meal preparation.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A takes on cleaning up after dinner on their own.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a rotating schedule for meal tasks.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A wakes up early to prepare breakfast for the family.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a cozy kitchen, Agent A is preparing a nutritious meal and is doubling the recipe. They engage in family discussion with Agents B and C, promoting involvement and openness.",
    "actions": [
      {
        "description": "Agent A lets Agent B decide the side dish to prepare.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A reminds Agent C to take a break and join for dinner.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a family walk post-dinner.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A ensures equal food portions for everyone.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A offers to assist with Agent B's school project.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A packs extra food for Agent C's next-day lunch.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to turn off screens before bedtime.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A keeps the window open for fresh air while cooking.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a tidy and well-lit kitchen, Agent A, a teenager, is preparing a meal. Agent B, their younger cousin, does homework at the dining table, and Agent C, a family friend, is talking to Agent A about a group project while chopping vegetables. Agent A measures and portions the ingredients evenly for everyone.",
    "actions": [
      {
        "description": "Agent A offers to teach Agent B how to cook a basic recipe.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A prepares a large batch of a healthy recipe for the week.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes each person washes their own dishes after the meal.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A helps Agent C with their portion of the group project.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A takes a break to do stretching exercises in the living room.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A initiates a conversation to solve a scheduling conflict.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A stores leftovers properly for future meals.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A makes a comprehensive grocery list for a balanced stock.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agents B and C to participate in meal planning.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is a young adult living with two roommates, engaging in shared responsibilities and resources after returning from a run.",
    "actions": [
      {
        "description": "Offers to cook the next meal for all three roommates.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Proposes a group exercise session for the following morning.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Decides to restock the shared fruit bowl.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Initiates setting up a new recycling system in the apartment.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Chooses to address a problem with uneven chore distribution.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Suggests pooling money for a higher-quality water filter.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Contributes an idea to manage fridge space more efficiently.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Begins drafting a rotating schedule for group grocery shopping.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Voluntarily takes on an extra chore to help a busy roommate.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A, a college graduate living with roommates Agent B and Agent C, finds the shared living space in disarray. Agent A considers cleaning up and how to engage roommates in sharing household chores for a harmonious living environment.",
    "actions": [
      {
        "description": "Agent A decides to start tidying up the common areas, beginning with the coffee table.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          -0.3
        ]
      },
      {
        "description": "Agent A writes a polite note suggesting a cleaning schedule and places it on the fridge.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A purchases a whiteboard and markers to propose a system for tracking cleaning duties.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agent B to join in the cleaning, emphasizing the benefit of a quicker finish.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A sets an example by washing their own dishes plus a few of Agent B's and Agent C's.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A respectfully wakes up Agent C to discuss the shared responsibility of maintaining the apartment.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A goes for a run to clear their mind and plan an approach to discuss household chores.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A makes healthy breakfast smoothies for everyone to share.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is a parent working from home. Agent B is a teen who has just returned from school, and Agent C, a younger sibling, is playing in the living room. The kitchen shows signs of a rushed breakfast with unwashed dishes, and a schedule on the fridge door indicates it's Agent B's turn to do the dishes today. Agent B heads straight to their room, bypassing the untidy kitchen.",
    "actions": [
      {
        "description": "Agent A decides to wash the dishes themselves, setting an example of responsibility.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A reminds Agent B of their scheduled task and inquires if they need assistance managing their time.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A schedules a family meeting to discuss and redistribute household chores.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A creates a chart that tracks completed chores and assigns a reward system to motivate the children.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A ignores the situation to avoid confrontation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.8
        ]
      },
      {
        "description": "Agent A enforces a rule that everyone must wash their own dishes immediately after eating.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A prepares a healthy snack for the family to enjoy together later, promoting a break from work and study.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A encourages exercise by inviting the children for a walk or bike ride after dinner.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A rearranges their work schedule to allow for shared meal preparation time, emphasizing the value of teamwork.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is practicing for soccer tryouts, Agent B is studying, and Agent C is preparing dinner. A sudden power outage disrupts each person’s activities, and Agent A knows where flashlights are stored.",
    "actions": [
      {
        "description": "Agent A fetches flashlights for everyone.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a break and workout for Agent B.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A assists Agent C in preparing dinner.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A leads a family cardio routine.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A shares the tablet with Agent B.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes family bonding time.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A continues training in the dark.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          -0.5
        ]
      },
      {
        "description": "Agent A insists on Agent B's help with meal prep.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A refuses to adjust training routine.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          -0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a small, cozy kitchen infused with the morning sunlight, Agent A is bustling around preparing breakfast. Agent B lounges at the kitchen island, while Agent C shuffles in, drawn by the aroma of coffee. The table is set for three, with an empty chair where Agent D should be. Agent A observes the kitchen clutter and hears Agent B's complaints about meal portions.",
    "actions": [
      {
        "description": "Agent A decides to read up on nutritional information to make more informed breakfast choices.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A proposes a system where everyone contributes to meal preparation on a rotating basis.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A goes for a jog around the neighborhood after breakfast.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a recipe swap with friends to get new ideas for healthy meals.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A starts composting food scraps to minimize waste and contribute to sustainability.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A sets up a breakfast prep area the night before to make the morning routine smoother.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A takes a power nap midday to recharge for the afternoon.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A organizes a cupboard cleanup with Agent B and Agent C to declutter the kitchen.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A is in the kitchen preparing a nutritious dinner, while Agent B is engaged with a school project and Agent C offers help. They work collaboratively, ensuring a supportive and well-organized environment with equal attention to meal preparation and the school project.",
    "actions": [
      {
        "description": "Agent A carefully portions the food for everyone.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A encourages everyone to go for a walk after the meal.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B with the project post-dinner.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests taking turns in conversation during the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A cleans up and practices waste segregation after the meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A plans the following day's meal for all.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A discusses maintaining a balanced workload with Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A prepares a schedule for upcoming meal preparations.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A assembles a nutritious snack for the next day.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Agent A brings in freshly harvested vegetables from the garden into a bustling kitchen where Agents B, C, and D are engaged in cooking, studying, and cleaning respectively. Agent A suggests that everyone contribute to the meal preparation with these fresh ingredients.",
    "actions": [
      {
        "description": "Agent A evenly distributes harvested vegetables among Agents B, C, and D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A offers to take the lead in cooking to allow Agent B a break and suggests rotation in cooking.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A organizes a family meeting for a weekly meal plan, considering everyone's needs.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A prepares a nutritious snack for Agent C to aid concentration.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A turns pantry cleaning into a fun, timed challenge.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A takes a quick nap for evening alertness.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a hydration station in the kitchen.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A neglects personal hunger for a more diverse family meal.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A insists Agent C finish homework before meal assistance.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          -0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "Early Saturday morning, teen Agent A is in the kitchen preparing breakfast for themselves and younger siblings Agent B and C, who are seated at the table. The pantry is stocked with healthy options, and a chore list shows an equal division of household tasks.",
    "actions": [
      {
        "description": "Agent A evenly distributes the first batch of pancakes among the three of them.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A joins the table to eat together, engaging in conversation with Agent B and Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A offers to swap chores for one less accessible to Agent B.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a family walk to the park.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A reviews the pantry and prepares a grocery list for nutritional needs.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests cooking a new recipe together.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A offers some of their own pancakes to a still-hungry Agent B.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A volunteers to take over a chore Agent C dislikes.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "fairness"
    ],
    "scenario": "In a kitchen, Agent A prepares dinner, focusing on nutrition. Agent B plans weekly meals ensuring variety, while Agent C finishes homework. Agent A portions ingredients carefully, considering the family's input. Everyone's diet and preferences are regarded.",
    "actions": [
      {
        "description": "Agent A cooks a large batch of a nutritious meal to share with a sick neighbor.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A teaches Agent C to prepare a balanced meal during cooking.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A schedules a family walk in the park after dinner.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A reduces their own meal portion to ensure plenty for everyone.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A considers Agent C's request to have a friend over, mindful of resources.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests buying groceries in bulk to manage the budget after consulting with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A insists on an early dinner for sufficient family rest.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A involves the family in meal planning through voting on dishes.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      }
    ]
  }
]