[
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is preparing a family dinner, with Agent B reading nearby and Agent C setting the table. The mood is tranquil and the setting cooperative, with family engagement being central.",
    "actions": [
      {
        "description": "Agent A checks the batteries in the smoke detector to ensure it's functioning properly.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wipes a spill on the floor immediately to prevent any slipping accidents.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stirs the pots on the stove and adjusts the heat to maintain a gentle simmer and avoid burns or fire hazards.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B on the choice of reading material, creating a moment of connection.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C for a suggestion on the music playlist for dinner to include them in the decision making.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns on additional lights in the kitchen to avoid eye strain while cooking.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C a simple cooking technique, fostering family bonding and skill sharing.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A samples the dish and tweaks the seasoning to perfect the meal.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a warm, secure family kitchen, Agent A is cooking, Agent B reviews mail including a first-aid guide, and Agent C does homework. The room is filled with laughter and an aroma of baked bread and soup.",
    "actions": [
      {
        "description": "Agent A adds a pinch of salt to the soup, tastes it, and smiles, satisfied with the flavor.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a board game for the family to play after dinner to spend quality time together.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shuts the open window as the evening turns cooler to maintain a comfortable temperature.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector once more, ensuring it’s in proper working condition.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares a humorous story from their past, contributing to the joyful atmosphere.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table, placing each utensil carefully and creating a pleasant dining setup.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a cozy suburban home, Agent A reviews cooking magazines at the dining table, while Agents B and C perform tasks around the house to maintain order and comfort. Agent B is ensuring the smoke detectors work, and Agent C is cooking.",
    "actions": [
      {
        "description": "Agent A decides to cook a new recipe from one of the magazines for the household.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully stores away the magazines back on the shelf after choosing a recipe.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B test the smoke detectors by pressing the test button and listing which ones work.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes note of any required maintenance in the house and plans a trip to the hardware store.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to hold the ladder steady for Agent B as they change a smoke detector battery.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C in the kitchen and offers assistance or a taste test of the meal.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to bond with Agent C by praising the meal's aroma and asking about the recipe.",
        "values": [
          0.0,
          0.0,
          0.1,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a spontaneous game night for the household to enjoy the evening together.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the living space after the day's activities to maintain a comfortable environment.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a cozy suburban home, Agent A is organizing the living room, adjusting furniture to clear pathways, and ensuring the space is tidy. Agent B is watching a comedy show on TV while Agent C assists in securing loose wires. The room is filled with laughter and the inviting smell of dinner cooking.",
    "actions": [
      {
        "description": "Agent A switches on the gas detector in the kitchen.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs edge guards on the coffee table.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a get-together with friends for a game night.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A replaces the smoke detector batteries.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A relaxes, enjoying the comedy on TV.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges family photo frames on the mantle.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A orders takeout from a favorite restaurant.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A replenishes the first aid kit supplies.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets out scented candles for ambiance.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a young parent, has put his toddler, Agent B, to nap and is settled in the living room with a book as Agents C and D, the older children, return from school. The house is secure, and Agent A spends a tranquil afternoon engaging in activities that keep the household running smoothly while also providing opportunities for relaxation and family bonding.",
    "actions": [
      {
        "description": "Agent A checks the baby monitor periodically.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a nutritious snack for Agents C and D.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses after-school activities with Agents C and D.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A enjoys the quietude of the home with a cup of tea.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A oversees Agents C and D's household chores.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a family movie time.",
        "values": [
          0.0,
          0.0,
          0.4,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays a board game with Agents C and D.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A finalizes setting up smoke detectors, enjoys a quiet, secure home environment with their partner and child. While the rain falls outside, the family feels relaxed and engaged with their individual activities.",
    "actions": [
      {
        "description": "Agent A checks the batteries in all the smoke detectors.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits down with Agent C to help with the puzzle for a few minutes.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a family snack, bringing popcorn and fresh apple slices to the dining table.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C how to respond in case the smoke alarms go off.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the living room furniture to create a more open and inviting space.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a new lock on the back door for added security.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts on some soft background music to enhance the relaxed mood.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a cozy reading nook with extra cushions and a blanket for Agent B.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A enjoys a quiet weekend with Agent B, who is baking cookies, and Agent C, who is drawing. The home is warm and secure, with an upcoming family game night.",
    "actions": [
      {
        "description": "Agent A helps set the dining table for snack time.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares the board game for family night.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A clears potential tripping hazards.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays soothing music.",
        "values": [
          0.0,
          0.0,
          0.3,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A praises Agent C's drawing.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A contributes to the conversation with a book anecdote.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is checking the locks on the doors and windows in a cozy family home to ensure everything is secure. Agent B is cooking a meal while Agent C organizes a first-aid kit. The environment is warm with artwork on the walls and preparations for a board game night post-dinner.",
    "actions": [
      {
        "description": "Agent A assists Agent B with meal preparation.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses board game choices with Agent C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors in the house.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a calming breathing exercise before dinner.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores the first-aid kit away.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a family portrait.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares a joke or funny story during dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a surprise post-dinner dessert.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A expresses gratitude for the meal and company.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A ensures the home's security during a storm while making the indoor environment enjoyable for Agent B, who is deeply engaged in creating art for a school project.",
    "actions": [
      {
        "description": "Agent A checks the batteries in the flashlights and ensures they are easily accessible.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to join Agent B to help with the art project.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a round of storytelling with Agent B.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a favorite snack for Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the art supplies to clear walking paths.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B how to make a basic emergency kit.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the house for any leaks or damage.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates an impromptu indoor camping experience.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "It's a quiet evening in the suburban household where Agent A, the teenage protagonist of our story, is lounging in the living room with his relatives, Agent B and Agent C. Agent B, a distant cousin visiting from out of town, is comfortably nestled on the couch, absorbed in a novel. Agent C, Agent A's parent, is busy with a crossword puzzle at the dining table, the hum of a peaceful night punctuated by the occasional flick of the newspaper. As the scent of fresh-baked cookies wafts from the kitchen, Agent A scrutinizes a bookshelf packed with board games and books, reflecting on how to spend time with his family in a way that they all would enjoy.",
    "actions": [
      {
        "description": "Agent A decides to initiate a family board game night.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a baking competition.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully drafts a schedule for a home movie marathon.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts organizing a clean-up operation to declutter the common spaces.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old photo album.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a DIY crafting session.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moves to check the smoke detectors and emergency equipment.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to prepare a healthy snack.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts creating a family emergency plan.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a suburban home, Agent A is cooking, Agent B is writing a grocery list, and Agent C is enjoying music. The family plans for a game night, and the atmosphere is peaceful.",
    "actions": [
      {
        "description": "Agent A double-checks the kitchen smoke detector for functionality.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures the lid on cooking pots.",
        "values": [
          0.0,
          0.0,
          0.8,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A advises Agent C to lower headphone volume.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A updates the first aid kit.",
        "values": [
          0.0,
          0.0,
          0.7,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A converses with Agent B about game night.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help set the table.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays with the family dog.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C a new recipe.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans a spill to prevent slipping.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a parent, is cooking dinner in the kitchen with Agent B, the partner, assisting by putting away dishes. Agent C, their child, is doing homework at the table. The environment is warm and the mood lightened by music.",
    "actions": [
      {
        "description": "Agent A reminds Agent B to wash their hands before helping with the food preparations.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent C for focus on homework, supporting a positive environment.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully transfers hot soup into a bowl to avoid spills.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the stove to ensure it's off after cooking.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the kitchen floor is dry to prevent slips.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans and stores sharp knives securely out of Agent C's reach.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns down music for a calming study environment.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests family dinner at the table to strengthen familial ties.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is in the kitchen preparing a weekend family brunch. Agent B is reading in the living room, and Agent C is drawing at the dining table. The house is full of natural light and pleasant music.",
    "actions": [
      {
        "description": "Invite Agent B and Agent C to set the table.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Open the windows to let in fresh air.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Share a special recipe with Agent B.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Prepare a small plate of fruit slices for Agent C.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Engage in a fun food decoration competition.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Install a new smoke detector.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Place a new first-aid kit in the kitchen.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Implement a kitchen cleaning schedule.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Lead a family yoga session after brunch.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a teenager sitting in the living room, meticulously organizing a collection of vinyl records alphabetically on the shelves. Agent B, a parent, is setting up a new smoke detector. Agent C, another parent, is preparing a favorite soup recipe. The home is warm with cooking aroma and soft jazz music.",
    "actions": [
      {
        "description": "Agent A checks the batteries on the smoke detectors to ensure they're functioning properly.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to surprise Agent C by setting the table with their finest dinnerware for the family meal.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with the installation of the smoke detector.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully cleans the vinyl records and the turntable.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses a playlist of family favorites to play during dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent B about how to test the smoke detector effectively.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A expresses appreciation to Agent C for making the favorite soup.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans an impromptu indoor picnic in the living room.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a mother in her mid-30s, has just finished preparing a family dinner in the kitchen. Agent B, her husband, is tidying up the living room, ensuring there are no tripping hazards. Agent C, their teenage daughter, sets the table beautifully in anticipation of the family meal. The family home exudes warmth and contentment as they prepare to share dinner together.",
    "actions": [
      {
        "description": "Agent A carefully removes the chicken from the oven using the oven mitts.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls her family to the table with a warm smile.",
        "values": [
          0.0,
          0.0,
          0.3,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent C on the table setting.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in conversation about their day with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.2,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game night after dinner.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores the leftovers properly in containers.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures all doors are locked before dinner.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk after the meal.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to share a recent achievement.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a young parent, is in the kitchen preparing a family dinner. Agent B is fixing a loose handrail on the staircase, while Agent C is doing homework upstairs. The kitchen is well-prepared, a pot simmers on the stove, and the smell of cooking hints at an upcoming meal. Ambient music plays, and the environment is cozy with soft evening light.",
    "actions": [
      {
        "description": "Agent A carefully stirs the pot on the stove, adjusting the heat to prevent the contents from spilling over.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A instructs Agent C to wash their hands before setting the table.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places hot pads on the counter in anticipation of placing the hot pot there once the food is ready.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the smoke detectors in the kitchen to ensure they are functional.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A organizes a family game night in the living room.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the kitchen window to let in fresh air, reducing the risk of air quality issues from cooking.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns down the music volume to create a calm dining atmosphere encouraging relaxed conversation.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses an appliance lock to secure the oven door after use, making it inaccessible to Agent C.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads a story to Agent C before bedtime, fostering a peaceful night routine.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a parent, observes a relaxing and uncluttered living room with Agent B reading and Agent C completing a puzzle. A sense of tranquility pervades the setting as evening approaches.",
    "actions": [
      {
        "description": "Initiates family game night.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Double-checks the locks.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Organizes indoor camping.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Prepares hot chocolate.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Proposes and reviews a family emergency plan.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Rearranges furniture for clear pathways.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Joins Agent C with the puzzle.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Puts on a family favorite movie.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Cleans up some clutter in the corner.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a young mother, settles her infant in a freshly child-proofed living room while her husband, Agent B, browses a catalog of family vacations and their teenager, Agent C, sets up a board game.",
    "actions": [
      {
        "description": "Agent A sits down to join Agent C in the board game.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins to organize the snacks on the counter.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the thermostat.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A scans the room for choking hazards.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves a camera to document the game night.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the window for fresh air.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently declines Agent B's vacation suggestion.",
        "values": [
          0.0,
          0.0,
          0.7,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the baby monitor battery.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C explain the game's rules.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a young parent, finishes work and joins the family in the living room, where Agent B is playing and Agent C is planning dinner, with the environment exuding a sense of care and contentment.",
    "actions": [
      {
        "description": "Agent A checking the locks on all doors and windows for security.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A playing a board game with Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A planning meals with Agent C.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A taking time to read a favorite book.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviewing and updating the family's emergency plan.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A replenishing the first-aid kit.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizing a family movie night.",
        "values": [
          0.0,
          0.0,
          0.1,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A testing the smoke alarms.",
        "values": [
          0.0,
          0.0,
          0.7,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizing family photos into albums.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a college student, dedicates her Saturday afternoon to ensuring a balanced diet for herself and roommate Agent B, while also engaging in fulfilling activities. Agent B is making cookies in the kitchen, enjoying the routine and final product of her efforts. A cozy well-maintained apartment provides a backdrop for their contentment and thorough preparedness.",
    "actions": [
      {
        "description": "Agent A checks expiration dates on all of their food supplies.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tests the smoke detector in the kitchen.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges furniture for a clearer pathway.",
        "values": [
          0.0,
          0.0,
          0.6,
          -0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A waters and cares for the terrace garden.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A signs up for an online cooking class.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a routine health checkup.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a cozy reading nook.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A curates a shared playlist.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a warm, well-lit living room, Agent A is preparing a cozy family evening with a hearty meal and a selection of activities with Agents B and C, ensuring a comforting and satisfying environment.",
    "actions": [
      {
        "description": "Agent A checks and maintains the fireplace to ensure the fire remains controlled.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a wholesome family dinner.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a popular board game to play post dinner.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A actively listens to a story from Agent C.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a friendly puzzle competition between Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches a new card game to Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A celebrates completing the puzzle with a dance.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B and Agent C to help clean after dinner.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a comfortable relaxation space with blankets and pillows.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A relaxes in the living room with a book, sharing a harmonious space monitored by Agent B and joined by Agent C, who is occupied with a puzzle.",
    "actions": [
      {
        "description": "Agent A closes the window as the wind picks up.",
        "values": [
          0.0,
          0.0,
          0.6,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with the puzzle.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks on Agent B by knocking on the home office door.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares a photo album with Agent C.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses a board game and invites family for a game night.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings the family pet inside to avoid it being alone outdoors.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes their school backpack for the next day.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a cozy family kitchen, Agent A is engaged in meticulously organizing a meal plan, focusing on nutritional value and enjoying a lively interaction with their parent, Agent B, who is washing dishes, and their younger sibling, Agent C, who is drawing but shows interest in the meal preparation. The environment is warm and familial, with an underlying emphasis on maintaining an orderly and secure space.",
    "actions": [
      {
        "description": "Agent A double-checks the kitchen to ensure all appliances are turned off.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up their meal prep area, making sure sharp objects are out of reach.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help set the table for a family meal.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B collaborate on a mini fire drill with Agent C.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans on setting aside some time after dinner to play a board game.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to compile a list of emergency contacts.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests watching a comedy movie that evening.",
        "values": [
          0.0,
          0.0,
          0.3,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to teach Agent C a fun recipe for the next meal.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a parent, is at home on a peaceful weekend afternoon, enjoying a book by the fireside while the children, Agent B and Agent C, engage in quiet activities. The environment is cozy and secure.",
    "actions": [
      {
        "description": "Agent A checks if the oven timer is set correctly to prevent the cookies from burning.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rises to add another log to the fireplace, ensuring the room stays pleasantly warm.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A walks over to Agent B to compliment them on the progress made on the jigsaw puzzle.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C at the corner desk, offering guidance and encouragement for their drawings.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the kitchen workstation, clearing up any clutter.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures all doors and windows are locked to maintain a secure home environment.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls a family member to catch up and reconnect, strengthening family bonds.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a break from reading and sit with both children, fostering a sense of togetherness.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a tray with warm cookies and milk to share as a treat.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, sitting comfortably on a couch, is reading a book in the living room. Agent B is making herbal tea in the kitchen, and Agent C is engaged with a jigsaw puzzle at the dining table. The setting is warm and homelike with personal touches, a storm is audible outside.",
    "actions": [
      {
        "description": "Agent A ensures all windows are secure against the approaching storm.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers assistance to Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A comforts the cat while attending to its demeanor amidst the storm.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent B with tea preparations.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family game night after the puzzle completion.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reorganizes the furniture for an engaging game night environment.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures the front door and checks the security system.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects movies and video games for family entertainment.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a blanket on the cat as the storm intensifies.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a college student, is planning their week at the kitchen table. Agent B is preparing tea, and Agent C is watching a documentary in the living room with the dog, Agent D. The weather outside is stormy.",
    "actions": [
      {
        "description": "Agent A checks the weather app for week planning.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the first-aid kit is fully stocked.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a hot chocolate while working.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a 'cozy night in' with B and C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes watching a comedy special.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes their study materials.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares for a board game night.",
        "values": [
          0.0,
          0.0,
          0.2,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures doors and windows.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In the warm, sunlit living room, Agent A, a physician, settles with a book while Agent B attends to the indoor plants, and Agent C checks the smoke alarms. Soft music plays in the background, a shelf stacked with games suggests leisure opportunities.",
    "actions": [
      {
        "description": "Agent A carefully makes herbal tea, ensuring the water temperature is just right.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A picks a board game for shared entertainment.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A aids in testing the smoke alarms, contributing to their functionality.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays a soothing tune on her guitar, filling the space with harmony.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads aloud a fascinating book chapter to her roommates.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests establishing a weekly game night for communal fun.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A immerses herself in drawing the tranquil view from her window.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites her roommates to cook a healthy meal together.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in yoga for shared relaxation.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a cozy suburban home, Agent A inhabits the kitchen, basking in the warmth of sunlight pouring through the windows. Agent B, is enjoying the nostalgia in the living room, while Agent C focuses on their studies upstairs. The scent of baking creates an inviting atmosphere.",
    "actions": [
      {
        "description": "Agent A executes a thorough inspection of the smoke alarms to confirm their operational status.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places luminescent nightlights along the passages to avert nocturnal missteps.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A bakes cookies as a delightful treat for Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates an engaging family game night for a communal pastime.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A securely locks away the household's cleansing agents after their application.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates personal cards by hand for Agent B and Agent C with heartfelt notes.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a surprise internal leisurely lunch as a special family gathering.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A festoons the residence with cozy illumination and plush textiles for a soothing ambiance.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A equips the domicile with a comprehensive medical aid kit for emergency scenarios.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.4,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, an amateur chef, is hosting a dinner party. While detailed event preparations are underway, Agent A, along with Agent B and Agent C, is attentive to both the atmosphere and the well-being of upcoming guests.",
    "actions": [
      {
        "description": "Agent A double-checks the food in the oven, ensuring it is cooked at the correct temperature.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A walks through the home, ensuring all walkways are free of obstructions for when the guests arrive.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to test the smoke alarms.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits down to review the list of invitees.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A laughs and shares an inside joke.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A records the final dish presentation on the camera.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent C the responsibility of being the designated greeter.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses an upbeat playlist.",
        "values": [
          0.0,
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a cozy suburban home, Agent A is lounging on the sofa with a book, while Agent B is sketching, and Agent C arranges his model cars. A first-aid kit and emergency plan are visibly placed for readiness.",
    "actions": [
      {
        "description": "Agent A joins Agent C on the floor, admiring his model cars.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent B about her art project.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the first-aid kit.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family game night.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the locks on doors and windows.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes hot chocolate for everyone.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns on soft background music.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family emergency drill.",
        "values": [
          0.0,
          0.0,
          0.8,
          -0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in light stretching exercises.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is preparing to host a small dinner party at her home, ensuring that the environment is free from hazards and welcoming. Agents B and C assist by setting the table and preparing the meal, contributing to a serene and comfortable atmosphere geared towards a communal experience.",
    "actions": [
      {
        "description": "Agent A checks the batteries in her smoke detectors to ensure they are functioning.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews her list of guests to confirm any dietary restrictions.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up the space, removing clutter to create a more open and inviting atmosphere.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A lights scented candles to add a pleasing aroma to her home.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects a playlist of soothing background music to play during the dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places cushions on the chairs for added comfort.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a selection of board games for entertainment after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a designated area for guests' personal belongings.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a small homemade gift as a token of appreciation for each guest.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a caring guardian, is seen inspecting the smoke detectors around the house. Agent B, a playful child, laughs joyfully while building a fort out of cushions in the living room. Agent C, a meticulous teenager, systematically reviews a checklist on the fridge, guiding the proper storage of groceries. The ambiance is peaceful, with Agent A ensuring that the passageways remain unobstructed and the environment is serene.",
    "actions": [
      {
        "description": "Agent A tests the smoke detectors to ensure they are working.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B in fort-building, using cushions to create a play space.",
        "values": [
          0.0,
          0.0,
          0.7,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a house maintenance checklist for a secure living environment.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family meeting to review emergency evacuation procedures.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fixes a squeaky floorboard to prevent falls.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A educates on keeping pathways clear.",
        "values": [
          0.0,
          0.0,
          0.8,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks and secures loose wires.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places non-slip mats in the bathroom.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is organizing a small get-together at their home for a close-knit book club. The home is cozy, and well-stocked with refreshments for the event. Agent B and Agent C have joined the evening. Agent A is finishing the preparation of some snacks, and heads towards the living room with a tray of freshly baked cookies.",
    "actions": [
      {
        "description": "Agent A checks the smoke detectors in the house to ensure they are working correctly.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a first aid kit in a visible and accessible spot.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the seating arrangement to prevent tripping hazards.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a list of emergency contacts and puts it on the refrigerator.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits down with the guests, engaging in the book club discussion.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects a variety of board games for a group activity option.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a planned group activity to get everyone involved.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A keeps an eye on the weather and has a plan for sudden changes.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes taking turns reading passages aloud from favorite books.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a family kitchen, Agent A prepares dinner, Agent B fixes a chair, and Agent C does homework. There's a sense of contentment and care as they perform their tasks attentively.",
    "actions": [
      {
        "description": "Agent A reminds Agent C to take a screen break.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings a nutritious snack to Agent C.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A adds Agent C's favorite ingredient to the meal.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the first aid kit is complete and updated.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures smoke detectors are functioning.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans a spill to prevent slipping.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares a joke with Agent B.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A converses with Agent C about their day.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays some background music while cooking.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A prepares an indoor picnic with a hot chocolate station and board games for a cozy evening. Agent B is finishing work, and Agent C is engaged in drawing, both unaware of the plans. The house is warm, comfortable, and a family bond is imminent.",
    "actions": [
      {
        "description": "Agent A calls Agent B and Agent C to join the living room picnic.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests starting with a board game to engage everyone.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares the hot chocolate in the kitchen and brings it to the picnic area.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures that the fort is stable and secure before inviting Agent C to enter.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to put on some background music to enhance the atmosphere.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C how to make shadow puppets with hands under the fort's light.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories from the day, eliciting laughter from Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to dim the lights slightly for a more comforting ambiance.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to show the artwork she created earlier in the day.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, having installed smoke detectors, views their family engaged in various activities in their secure and pleasant home. Agent B is considering baking options, while Agent C is occupied with a puzzle.",
    "actions": [
      {
        "description": "Agent A double-checks the smoke detectors to ensure they are functioning correctly.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts to childproof the cabinets and power outlets.",
        "values": [
          0.0,
          0.0,
          0.8,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates an escape plan in case of emergencies and discusses it with the family.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family meeting about home security.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family game night.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A orders a comprehensive first aid kit.",
        "values": [
          0.0,
          0.0,
          0.7,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A replaces old locks with more secure ones.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C in the jigsaw puzzle activity.",
        "values": [
          0.0,
          0.0,
          -0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A bakes a cake with Agent B.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A installs a new set of locks on the doors and windows, joins Agent B and C, watching a family movie, warm and cozy.",
    "actions": [
      {
        "description": "Agent A reviews a list of emergency contacts.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a comforting homemade meal.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes starting a family game night.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a movie marathon.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a pillow fight.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A spends time telling family stories.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cuddles with Agent B and C.",
        "values": [
          0.0,
          0.0,
          0.5,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a family park outing.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A pauses work to address the beeping of a low-battery smoke detector in a comfortable family house. Agent B is preoccupied with cooking, Agent C is wearing headphones and focused on homework, and Agent D is playing in their bedroom.",
    "actions": [
      {
        "description": "Agent A replaces the battery in the smoke detector.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks for spare batteries in the drawer.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the smoke detector functions after replacing the battery.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent D build a stable block tower.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses smoke detector importance with Agent D.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join for a family meal.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a reminder to check smoke detectors regularly.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent B with meal preparation.",
        "values": [
          0.0,
          0.0,
          0.2,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks if the family pet is secure.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In preparation for a family anniversary celebration, Agent A is making thoughtful and careful preparations in a decorated home environment. With a focus on organizing the event pleasantly and maintaining an accident-free setting, Agent A engages with their siblings in various tasks.",
    "actions": [
      {
        "description": "Agent A reviews the plan for the evening and makes adjustments for an ideal celebration.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures all smoke detectors are working and establishes clear paths to exits.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a balloon-popping game with riddles for the family to enjoy.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks in with siblings to make sure they feel included and content.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reveals special party favors to surprise siblings.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A lays out disposable cameras for family members to capture the celebration.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a non-slip mat under the rug to prevent slips.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a heartfelt toast to convey genuine sentiment.",
        "values": [
          0.0,
          0.0,
          0.2,
          1.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a young parent, is making a snack in the bright, cozy family home with soft music. Agent B works on a crossword in frustration on the couch, and Agent C is focused on a jigsaw puzzle on the floor.",
    "actions": [
      {
        "description": "Agent A serves the snack for shared enjoyment.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A repairs a protruding nail to prevent mishaps.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C with the puzzle to bond.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with the crossword to ease their frustration.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks smoke detectors for proper function.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family board game for fun.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a reading nook for Agent C.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses vacation plans with the family.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A updates the household emergency plan.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a 34-year-old parent, is in the kitchen preparing a meal. Agent B, their 8-year-old child, is sitting at the dining table working on homework. Agent C is setting up a board game for later. The atmosphere is congenial with an aroma of cooking and sound of music and laughter suggesting a pleasant family environment.",
    "actions": [
      {
        "description": "Agent A carefully adjusts the stove to prevent the food from burning.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table with care, ensuring there are no sharp knives within Agent B’s reach.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to double-check that the smoke detectors are functioning properly before continuing to cook.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks on Agent B's progress with homework, offering assistance.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a taste-testing game with Agent B to engage them in the meal preparation process.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small celebration for finishing the homework, with the meal as a reward.",
        "values": [
          0.0,
          0.0,
          0.3,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans a small spill on the floor immediately to prevent slipping.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns down the music in the living room to create a calm environment to not distract Agent B from homework.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent C to finish the cooking quicker, fostering family collaboration.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a parent, is in the kitchen preparing a family dinner. Agent B, their partner, is securing bookshelves in the living room. Agent C, their teenage child, is doing homework at the dining table. Agent D, the pet dog, is sleeping contentedly on a dog bed. The aroma of dinner and gentle music set a serene evening scene.",
    "actions": [
      {
        "description": "Agent A reviews the recipe to double-check that they haven’t missed any steps.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully adjusts the stove’s heat to avoid overcooking the food.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table with the family's favorite dishes and cutlery.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls Agent C to help with a task in the kitchen.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A periodically checks in with Agent B to offer a hand.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game night after dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A surprises Agent C with their favorite dessert.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C a new cooking skill.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gives the dog a gentle grooming session after dinner.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is preparing a meal in the kitchen, with Agent B reading and sipping tea, and Agent C playing guitar nearby.",
    "actions": [
      {
        "description": "Agent A carefully manages the heat of the stovetop dishes.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages personal hygiene before mealtime.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes sure the smoke detector is working.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A readies a towel for quick spill responses.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures the kitchen by proper knife storage.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family game night to extend the day's enjoyable atmosphere.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A includes Agent C in cooking to share quality time.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares freshly baked cookies, celebrating the baking success.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A steps into a well-lit, cozy kitchen, encounters Agent B, a child carefully drawing, and Agent C, an adult browsing through a cookbook. The kitchen is equipped with a visible first-aid kit and all doors and windows are secure with a breeze coming in through a screen.",
    "actions": [
      {
        "description": "Agent A decides to prepare a nutritious breakfast, featuring everyone's favorite dishes.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector in the kitchen to confirm it is functioning.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent B with a challenging part of their drawing.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies the kitchen, removing any trip hazards from the floor.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a new lock on a cupboard containing cleaning supplies.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans an indoor treasure hunt for Agent B.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B basic first aid techniques.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits with Agent C to discuss the recipe and offer support.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a weekly meal plan and shopping list.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a college student, is organizing study materials in a harmonious living room she shares with roommates. Agent B is reading on the couch, and Agent C brings in tea for everyone.",
    "actions": [
      {
        "description": "Agent A joins Agent B for tea and conversation.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks smoke detectors.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges furniture to prevent tripping.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a relaxation session.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a surge protector for electronics.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a study group with roommates.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A waters the house plants.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places an emergency contact list on the fridge.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a game night.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "A family engaged in various activities within their home, focusing on personal well-being and a positive atmosphere among themselves.",
    "actions": [
      {
        "description": "Agent A reaffirms the locations of the emergency supplies to Agent B.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the weather updates frequently to stay informed.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the list of emergency contacts and the family's contingency plan.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C how to properly use the fire extinguisher.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to start a family game night right after dinner is ready.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B in the kitchen for a quick dance to their favorite old tune.",
        "values": [
          0.0,
          0.0,
          0.2,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a comfortable and inviting space in the living room for after-dinner relaxation and conversation.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B on the dinner's aroma and helps set up the table with fine dinnerware for a special family meal.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a storytelling session, sharing funny and heartwarming stories about their relatives in the family album with Agent C.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "'Agent A', a parent, prepares a family meal in a well-lit kitchen as 'Agent B', sets up a small herb garden on the windowsill, and 'Agent C', their child, draws at the kitchen table. Everyone is involved in their tasks, creating a harmonious domestic scene.",
    "actions": [
      {
        "description": "'Agent A' tests the smoke detectors to ensure they are working correctly.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' stores away household cleaning supplies out of 'Agent C's' reach.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' cuts vegetables into smaller pieces to prevent choking hazards for family meals.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' decides to cook 'Agent B’s' suggested new soup recipe.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' playfully challenges 'Agent C' to draw what they think the soup will taste like.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' compliments 'Agent C' on the creative drawing, boosting confidence.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' organizes a family taste-test for the new soup to engage everyone.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' checks the locks on doors and windows to ensure they are secure.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' arranges the next month's family emergency drill.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a cozy suburban home, Agent A is organizing the living room while Agents B and C engage in their own activities, and Agent D is baking cookies in the kitchen. The environment is warm and serene.",
    "actions": [
      {
        "description": "Agent A initiates a cleanup game with Agent C to put crayons back in the box.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps store cookies in containers.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers help to Agent B with homework.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fixes a squeaky door hinge.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A draws with Agent C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads a story to Agent C.",
        "values": [
          0.0,
          0.0,
          0.3,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chats with Agent D while helping.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family board game night.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a cozy suburban home, 'Agent A' stands in the kitchen preparing a meal. The countertops are cluttered with various ingredients and cooking utensils. 'Agent B' is in the living room, absorbed in a book near the fireplace, while 'Agent C' is upstairs playing a guitar gently. The aroma of cooking fills the house, soft music floats from upstairs, and a storm brews outside.",
    "actions": [
      {
        "description": "Agent A checks that the smoke detector is working properly before continuing with cooking.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns down the stove to a simmer to avoid any potential kitchen mishaps.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up a spill on the floor immediately to prevent slipping.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a plate with a portion of the meal for Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the dining table with care, placing each utensil next to the appropriate plate.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join the others for the meal.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores away the leftover ingredients properly in the fridge.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a game night for after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A lights candles around the home as the storm approaches.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is organizing a family game night at home, has prepared the room for comfort, and all family members are ready to play a new board game.",
    "actions": [
      {
        "description": "Agent A checks the locks on the doors and windows to ensure they are secure before starting the game.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A dims the lights for a cozy atmosphere but ensures there is enough light to play the game.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a first aid kit and places it within reach.",
        "values": [
          0.0,
          0.0,
          0.8,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A disables notifications on their phone to avoid distractions.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a silly wager for the game's loser to keep the mood light.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B and Agent C on their strategy during the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a mental note of which games excite Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a non-optimal move allowing the children a better chance of winning.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A enforces a rule to prevent gloating.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a parent, finds a kitchen mishap involving Agent B, their teenage child, and Agent C, the elderly next-door neighbor, leading to a positive response and problem-solving.",
    "actions": [
      {
        "description": "Agent A turns off the stove and removes the pot to prevent further mess.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to ventilate the smoke and clear the air.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gathers cleaning supplies and initiates the cleanup of the spill, leading by example.",
        "values": [
          0.0,
          0.0,
          0.7,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A contacts a local restaurant to order takeout to ease the dinner plans.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reaffirms Agent B by recalling a personal cooking blunder and the lesson learned from it.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to sit comfortably in the living room while the cleanup is underway.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A orchestrates a spontaneous game night to lighten the mood further.",
        "values": [
          0.0,
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a future cooking class for Agent B with a professional to improve their skills.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures that the kitchen is restored to a clean and orderly state before bedtime.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a mother of two, is preparing a family meal in the kitchen while teaching her daughter, Agent C, to cook and keeping an eye on her son, Agent B, who is doing homework at the table.",
    "actions": [
      {
        "description": "Agent A tastes the dish she is preparing to ensure it is delicious.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up a spill on the kitchen floor immediately to prevent anyone from slipping.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a favorite dish of both Agent B and Agent C to bring a smile to their faces.",
        "values": [
          0.0,
          0.0,
          0.2,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a smoke detector in the kitchen while the children are finishing their meal.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a quick cleanup game with the children post-dinner to tidy the kitchen.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits with Agent B to help him with a difficult homework problem.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays soft music to create a relaxing dinner atmosphere for the family.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is overseeing the family's weekend activities in their home. Agent B and Agent C are deciding on their activities for the day. Agent D is resting on the couch. The environment is secure and calm, with preparations for an art project displayed and plans for the rest of the day underway.",
    "actions": [
      {
        "description": "Agent A suggests a family board game after the art project.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes pictures of the twins as they paint.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins the twins at the craft table to paint together.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes the twins' favorite healthy snacks.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the backyard for security.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a small surprise for the family.",
        "values": [
          0.0,
          0.0,
          0.1,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up the living room without disturbing the napping Agent D.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A has installed a securely fenced play area in their backyard, where Agent C, their child, is playing. Agent B, Agent A's partner, is present. The weather is pleasant, and they plan to have a celebration.",
    "actions": [
      {
        "description": "Agent A initiates a spontaneous game of tag with Agent C.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a first-aid kit out to the patio.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family photo.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a play area inspection schedule.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A relaxes, watching Agent C play.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join the play.",
        "values": [
          0.0,
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C play area boundaries.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a single parent, creates a warm and secure home environment for her children, Agent B and Agent C. The family engages in activities that strengthen their bond and ensure a comfortable and secure atmosphere.",
    "actions": [
      {
        "description": "Agent A initiates a board game with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A instructs Agent B on managing the first-aid kit.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A praises Agent C's drawings.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks doors and windows before play.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tells stories emphasizing consideration and support.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a healthy snack for the family.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reassures Agents B and C about the emergency plan.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shows first-aid procedures for education.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a cozy home environment, while a meal is being prepared in the kitchen and children are engaged in play, Agent A feels content and reflects on his surrounding environment.",
    "actions": [
      {
        "description": "Assists in meal preparation.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Initiates a family game.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Inspects the house for hazards.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Brings out a family board game.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Checks the smoke detector batteries.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Organizes a fire evacuation practice.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Secures the house and tools.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Establishes a structured routine for children.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Installs child-proof locks.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a home environment, Agent A is involved in a puzzle activity, while Agent B and Agent C engage in their own peaceful activities. The setting is imbued with a sense of tranquility and warmth, complemented by comforting background elements such as gentle music and aromatic scents.",
    "actions": [
      {
        "description": "Agent A closes the open window to ensure the indoor temperature remains comfortable.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the aquarium to confirm its proper function.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stretches after sitting for a while, recognizing the need for movement.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers help in kitchen duties to Agent B.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a discussion on puzzle strategies to foster interaction.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a blanket for Agent C's comfort as the temperature drops.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes baking cookies, an enjoyable activity.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moves a lamp to better illuminate the puzzle area.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a group photo to capture the moment.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "A home scenario focusing on three agents whereby Agent A is responsible and caring—looking after plants, engaging with Agents B and C, and considering their needs as weather becomes threatening.",
    "actions": [
      {
        "description": "Agent A moves to secure all windows against the oncoming storm.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits with Agent C, helping with the puzzle to cultivate tranquility.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays a soothing music playlist on a portable speaker.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes warm beverages and a comforting meal for everyone.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses music interests with Agent B.",
        "values": [
          0.0,
          0.0,
          -0.1,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a light stretching session for the household.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A lights candles around the house for extra light.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the emergency contacts list is updated and understood by Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A has finished preparing a homemade meal. Agent B is setting the dining table while Agent C is wrapping up work, and Agent D is playing. The family anticipates gathering for dinner in a relaxed home setting.",
    "actions": [
      {
        "description": "Agent A turns off the oven and stovetop to prevent any accidents after cooking.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully organizes the kitchen, putting away sharp knives and cleaning spills.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites everyone to the dining table for the meal.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A picks fresh flowers from the garden for the dining table.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about everyone's day during dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures all electronic devices are away from the table.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A packs the leftovers in the refrigerator.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing a board game together after dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the locked doors and windows before bedtime.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a home at dusk, Agent A reads about botany, Agent B checks smoke detectors, and Agent C assembles a jigsaw puzzle. The environment is tranquil, embodying care and attention.",
    "actions": [
      {
        "description": "Agent A prepares a family favorite meal with care for a neat kitchen.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C with a puzzle, providing gentle guidance.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the thermostat for room comfort.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family board game evening.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A appreciates Agent B's home maintenance efforts.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the house's security.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C about botanical elements in the puzzle.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a cozy reading nook for Agent C.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A restocks a first aid kit for emergencies.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, preparing a family dinner in the kitchen, smells of baked bread and simmering stew fill the air. Agent B sets the table, Agent C changes smoke detector batteries, and Agent D plays with a puzzle. The household is filled with warmth and laughter.",
    "actions": [
      {
        "description": "Agent A ensures all kitchen appliances are off after use.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings the family together to eat.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages everyone in dinner table conversation.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reveals a hidden dessert to the family.",
        "values": [
          0.0,
          0.0,
          0.1,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a board game night.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A acknowledges Agent C’s responsible action with the smoke detector.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent D with puzzling.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a cleaning up after dinner.",
        "values": [
          0.0,
          0.0,
          0.7,
          -0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores the leftovers for another meal.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "[Agent A resides in a two-bedroom apartment with their sibling, Agent B, and a longtime friend, Agent C. On a calm Saturday morning, with sunlight streaming through the living room windows, Agent A is seated on the plush sofa, flipping through a book. Agent B sits across the room, engaged in assembling a jigsaw puzzle on the coffee table, while Agent C is preoccupied with watering houseplants in the adjacent open kitchen. The scent of fresh coffee wafts through the apartment, and a gentle breeze tingles the wind chimes hanging at the balcony door. Agent A, having just glanced outside and noted the idyllic weather, considers the activity options for the day.]",
    "actions": [
      {
        "description": "Agent A suggests creating a homemade brunch together with Agents B and C to enjoy on the balcony.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to reorganize the bookshelf to make sure it is stable and secure.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to indulge in trying out a new board game with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a neglected guitar from the corner of the room and starts tuning it for an impromptu jam session.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the battery status of the smoke detectors to confirm they are functioning properly.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment for themselves, settling in with a novel for an hour of relaxed reading.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A, with a sense of shared joy, initiates a storytelling session, recalling fun experiences with Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A grabs a camera to capture candid photos of the day, preserving memories of the quality time spent together.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is carefully preparing cookies in the kitchen while Agent B is focused on learning about smoke detector installation and Agent C, the grandparent, enjoys knitting on the living room couch.",
    "actions": [
      {
        "description": "Agent A checks the expiration dates on ingredients before using them.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cautiously places the cookie tray in the oven, using protective oven gloves.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a timer for the cookies to avoid overcooking them.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits down with Agents B and C to share the warm cookies.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game night to enjoy the evening together.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with the smoke detector installation, reading the instructions aloud.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make tea for everyone, ensuring it's not too hot to handle.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen area after baking to prevent pests.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a discussion of how the day went with Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a professional with a home office, is observing documents for work. Agent B is absorbed in reading on the couch, while Agent C is engaged with a puzzle. The house is secure and prepared for a storm that is gathering strength outside.",
    "actions": [
      {
        "description": "Agent A ensures all windows are closed and electronic devices are securely unplugged.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family game night for collective enjoyment.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a warm beverage for Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the basement for water leakage or flooding signs.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges furniture for comfort and security.",
        "values": [
          0.0,
          0.0,
          0.4,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A motivates Agent C to share their puzzle success.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares for a power outage with flashlights and candles.",
        "values": [
          0.0,
          0.0,
          0.8,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join in family preparatory activities.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A backs up work documents onto a cloud service.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a cozy living room filled with the scent of freshly baked cookies, Agent A reads, Agent B does a puzzle, and Agent C works on a project. A first aid kit and emergency numbers are visible, while an air purifier and soft music contribute to the tranquil ambiance.",
    "actions": [
      {
        "description": "Agent A decides to create a comfortable reading nook with the throw pillows to continue reading.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B with the puzzle, placing pieces carefully to assist without taking over.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a break, suggesting they all enjoy some cookies and milk together in the kitchen.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts aside the book to inspect the condition of the first aid kit, ensuring it is well-stocked.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to check whether the air purifier filters need replacing for optimal air quality.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reminds Agent B and C to stretch and take a brief break from their sedentary activities.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to arrange the completed puzzle pieces in a frame to preserve Agent B’s work.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes an impromptu storytelling session, encouraging Agent B and C to share stories.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures loose cables around the study area where Agent C is working to prevent tripping.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a parent, has finished work and notes the secure and orderly household environment. Agent B and Agent C are assembling a puzzle while Agent D prepares dinner. Agent A contemplates the benefits of their remote work arrangement.",
    "actions": [
      {
        "description": "Agent A decides to join their children in completing the puzzle to foster a bond and share quality time.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the new smoke alarms to confirm their functionality, ensuring their reliability.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the first aid kit for any expired products or items that need to be restocked.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family movie night with a selection of films for everyone to vote on.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs corner protectors on the coffee table to prevent accidental injuries during playtime.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks the front and back doors after dinner as part of the nightly routine.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a friendly competition among the family to see who can build the tallest tower using blocks, enhancing communal enjoyment.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets their work laptop aside and turns off email notifications to avoid distractions and spend uninterrupted time with the family.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A organizes a family game night with board games and puzzles, setting a cozy atmosphere with a warm fireplace and a family-filled environment. Agent B and Agent C are present and eager to participate in the proposed activities.",
    "actions": [
      {
        "description": "Agent A turns on some light background music.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the doors and windows.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts for a cooperative board game.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a family photo.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a healthy snack.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls an elderly family member.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent C to a puzzle-solving contest.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects a game adored by Agent B.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assembles an emergency kit.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a warm kitchen, Agent A stirs oatmeal, learning to cook under the watchful eyes of Agent B, who is seated at a table, and Agent C, who reads the newspaper by the counter. Preparedness is signaled by a first aid kit on a shelf.",
    "actions": [
      {
        "description": "Agent A turns down the heat to avoid overcooking the meal.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully portions the oatmeal into bowls.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for natural sweeteners such as honey or fruit.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a light-hearted competition with Agent C on oatmeal topping design.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in conversation with Agent C about a current event from the newspaper.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A politely offers the first bowl of oatmeal to Agent B.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up any spills immediately after cooking.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table with care, ensuring a proper dining setup.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests listing together a grocery list for future meals.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a parent, is preparing a family brunch in the kitchen. Agent B, their spouse, is working on their laptop at the dining table. Agent C, their teenage child, is upstairs working on a school project. The house is warm and smells of delicious cooking.",
    "actions": [
      {
        "description": "Agent A checks the smoke detectors in the house to ensure they are functioning properly.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in conversation with Agent B to discuss vacation ideas for the family.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully reads the instructions on a new kitchen appliance to prevent misuse.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to call Agent C down for brunch with a smile.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans a small spill on the floor immediately to avoid slipping.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A praises Agent C’s dedication to their school project.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a plate of food for Agent C.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a new lock for the medicine cabinet.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs soft lighting for a comforting atmosphere during dinner.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A stands in the kitchen, where fresh cookies have been baked and a gentle environment prevails while family activities take place. An attention to caution is suggested by the presence of a first aid kit.",
    "actions": [
      {
        "description": "Agent A checks the oven to ensure it's turned off after baking.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully transfers the hot cookies onto a plate.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B to look through family photographs and shares memories.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the countertop to prevent any pests.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts away the first aid kit.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A closes the window as the evening gets chillier.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to organize a spontaneous family game night.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with archiving the family photos digitally.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent C's artwork.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is making herbal tea, Agent B is tuning his guitar, and Agent C is texting on the couch in a comfortably warm house with gentle lighting and jazz music playing.",
    "actions": [
      {
        "description": "Agent A joins Agent B, bringing her herbal tea to listen to him play.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to assist in making a healthy dinner.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests an impromptu acoustic session with Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches new designs for a personal project.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in conversation with Agent C.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the dining table for a family meal.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the house is secure before bedtime.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes watching a comedy show for relaxation.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a nutritional meal plan for the week.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, who is a pre-teen, resides in a suburban home with a spacious backyard. The residence is well kept, with fences around the perimeter and locks on the doors and windows. Inside, the aroma of baking fills a bright, tidy kitchen where Agent A is carefully following a recipe to bake cookies. Across the kitchen counter, Agent B, Agent A's parent, is overseeing the process while taking the opportunity to teach proper kitchen conduct. Agent C, a sibling, is working on homework at the dining table, humming cheerfully and occasionally glancing over to see the progress of the baking.",
    "actions": [
      {
        "description": "Agent A uses potholders to remove the cookie tray from the oven to avoid burns.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A attentively listens to Agent B's advice on properly storing sharp kitchen tools.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to leave some cookies undecorated so that Agent C can enjoy decorating them later.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double checks the recipe to ensure all steps were followed correctly.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up any spills immediately to prevent slipping accidents.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside a couple of cookies for Agent B as a thank-you gesture for their help.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A patiently waits for the cookies to cool down before eating, to prevent mouth burns.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns off the oven and all the kitchen appliances after use to prevent fire hazards.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B that they should have a cookie decoration competition for fun.",
        "values": [
          0.0,
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a college student at home, enjoying the comfort of his family's presence. Agents B and C, his parents, tend to household duties while Agent D, his brother, plays basketball in the yard. The tranquil environment is maintained through the collaborative efforts of all family members.",
    "actions": [
      {
        "description": "Agent A joins Agent D in the yard to play basketball, being cautious of the surroundings.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B in arranging and watering the potted plants.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent D store the basketball equipment securely.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a convversation about emergency preparedness with Agent C.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A expresses appreciation for the family meal.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family board game night in the living room.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to make a small repair to a loose step on the porch.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures all doors are locked and smoke detectors are functional.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help clear the dishes and tidy up after dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is organizing a family game night at home with Agent B, her partner, and Agent C, her teenage child. They are gathered in a cozy and well-lit living room, prepared for a night of board games and personal interaction.",
    "actions": [
      {
        "description": "Agent A reviews rules of board games to ensure understanding.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts with a game known for enjoyment.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the window to let in fresh air.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a funny storytelling round.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a break for refreshments.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures Agent C is engaged and not excluded.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to appreciate the gathering.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the room temperature for comfort.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In the family home, Agent A finalizes installing a smoke detector. Agent B relaxes with a photo album, and Agent C enjoys a podcast, all within a secure and sunny living room.",
    "actions": [
      {
        "description": "Agent A prepares a family favorite meal to enjoy together.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses planning a family trip to a desired destination.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a home fire drill.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a detailed emergency backup plan.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fixes a loose railing to avoid accidents.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks into a family first aid course.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family game night with favorite games.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures all doors and windows are locked at night.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a family meeting to discuss home upkeep.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is preparing a birthday surprise for Agent B. The kitchen has a festive atmosphere, with a homemade cake, and a first aid kit placed for precautions.",
    "actions": [
      {
        "description": "Agent A double-checks the balloons to ensure they are secure.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tastes the cake to make sure it meets expectations.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moves fragile items to higher shelves to avoid accidents.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the guest list to ensure all of Agent B's friends are invited.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a designated quiet area for overwhelmed guests.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A practices the birthday song on the guitar.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a board game corner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sanitizes high-touch surfaces as a precaution.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wraps gifts with colorful paper and ribbons.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a tranquil urban home environment, Agent A finalizes the installation of new smoke detectors before diverting attention to Agent B's school project. Agent C focuses on work in an adjacent room, while Agent D plays with blocks.",
    "actions": [
      {
        "description": "Prepare a nutritious dinner.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Organize a family board game night.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Check locks on doors and windows.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Plan a family hike.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Schedule routine check-up.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Create and practice fire escape plan.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Have a heart-to-heart with Agent B.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Surprise family with movie tickets.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Install new backyard fence.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a comfortable home during a quiet stormy Saturday afternoon, Agent A spends time in the living room with Agent B and Agent C, contemplating the intact and orderly environment while enjoying the family's presence and shared activities.",
    "actions": [
      {
        "description": "Agent A stands up to close all open windows to prevent rain from entering.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the battery backup for the home in case there's a power outage.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays soothing music to blend with the sound of rain, promoting a calming ambiance.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C on the floor to assist with the jigsaw puzzle, suggesting puzzle-solving strategies.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A bakes a second batch of cookies, ensuring a treat for everyone.",
        "values": [
          0.0,
          0.0,
          0.1,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game of charades, encouraging light-hearted interaction.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves extra blankets from the closet in case the temperature drops due to the storm.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a hot beverage for Agent B to enjoy while reading.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits down to organize the photo albums, reminiscing about past family holidays.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a retired librarian, is arranging photo albums while her grandson, Agent B, creates artwork, and Agent C, her son, prepares dinner in the kitchen of their countryside home. The evening is peaceful, secure, and filled with family warmth.",
    "actions": [
      {
        "description": "Agent A carefully arranges the sharpened pencils back in their case.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages with Agent B by asking about his artwork.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the batteries in the smoke detector.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps set the table for dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks that all doors are locked in the evening.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the emergency contact list.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A picks up pencils to prevent tripping.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns on additional lights to prevent eye strain.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A treats Agent B's small cut.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a freelance graphic designer, notices a stove knob turned indicating a burner may be left on. Her husband, Agent B, is working on his writing, while their son, Agent C, plays guitar in the living room. Agent A smiles at their dog running in the garden.",
    "actions": [
      {
        "description": "Agent A checks the stove to ensure all knobs are off and reminds everyone to double-check appliances.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family game night.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the locations of emergency equipment with the family.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a creative arts project for family involvement.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to make a surprise dessert for the family.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a regular family meeting to discuss responsibilities.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to play with the dog in the backyard.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes her workspace more meticulously.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A has prepared a warm dinner for the family, while Agent B plays guitar and Agent C engages in a puzzle. The home environment reflects attention to order and comfort, setting the scene for a tranquil evening.",
    "actions": [
      {
        "description": "Agent A checks all the smoke alarms in the house to ensure they are functioning properly.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family game night to follow dinner, selecting games that are enjoyable for everyone.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reminds Agent C to wash hands before dinner, promoting good hygiene.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a video call so the family can have dinner with distant relatives.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans the week's meals to ensure a balanced diet for the family.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs childproof locks on the cabinets with cleaning supplies.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up the living room, making it obstacle-free.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges for a heating system inspection.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a list of emergency contacts and discusses it with the family.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A works on her writing in a serene home environment with Agent B cooking and Agent C upstairs. The household is stable and tranquil.",
    "actions": [
      {
        "description": "Agent A stands up to stretch her legs after a long period of writing.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a break and joins Agent B in the kitchen for a chat and to offer help.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke alarms in the house to ensure they are functioning correctly.",
        "values": [
          0.0,
          0.0,
          0.8,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to review the household's emergency exit plan displayed in the hallway.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads online articles about ergonomic office furniture and considers upgrading her chair for better posture support.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join her for a quick walk around the block for fresh air before dinner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family game night immediately after dinner to strengthen family bonds.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to plan a surprise weekend getaway for the family to relax and recharge.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a lush indoor plant next to her work area to establish a more restful ambiance.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a father who has recently moved with his family into a new neighborhood. He's set up a workspace for his woodworking hobby and is planning to finish a model airplane with his son, Agent B, who's currently studying. Agent C, his wife, is personalizing the house with a photo collage.",
    "actions": [
      {
        "description": "Agent A organizes a fire evacuation drill with his family.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts building the model airplane with Agent B.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a surprise family meal.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs nightlights in hallways.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the house's insurance policy for coverage.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a movie night with family favorites.",
        "values": [
          0.0,
          0.0,
          0.2,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules regular maintenance checks for the home.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, an avid home cook, is preparing a family dinner, while Agent B is working, and Agent C is setting up board games. The home is filled with the scent of stew and the anticipation of game night. Agent A undertakes measures to ensure a secure environment, then joins in the family activities.",
    "actions": [
      {
        "description": "Agent A turns off the stove and unplugs all kitchen appliances after cooking to prevent any hazards.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks that the back door is locked, ensuring the home is secure.",
        "values": [
          0.0,
          0.0,
          0.8,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A washes their hands thoroughly before leaving the kitchen.",
        "values": [
          0.0,
          0.0,
          0.7,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins the family playing a strategic board game, engaging with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to compliment Agent B on their work dedication, creating a positive atmosphere.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help set the dinner table, involving them in the preparation process.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings the first aid kit to the living room, just in case anyone needs it during their game night.",
        "values": [
          0.0,
          0.0,
          0.6,
          -0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings out blankets for Agent B and Agent C, should they feel cold playing by the window.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing soft music in the background to enhance the evening's ambiance.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "During a quiet evening in a cozy home, Agent A reads a book, Agent B plays guitar, and Agent C bakes cookies, while a storm brews outside.",
    "actions": [
      {
        "description": "Agent A checks the doors and windows for security before the impending storm.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gathers candles and flashlights in case the power goes out.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family board game session to enjoy the time together.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A enhances the room’s ambience by turning on extra lamps.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C in baking to assist and socialize.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A dries the pet and provides a cozy sleeping space.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects do not disturb mode on their phone for undisturbed family time.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness"
    ],
    "scenario": "In a cozy suburban home, Agent A has finished organizing personal items on a newly assembled shelf. Agent B is cooking, and Agent C is coloring in the living room. The household encapsulates tranquility with the background melody playing from a record player.",
    "actions": [
      {
        "description": "Agent A checks the shelving stability.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a family photo on the shelf.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chats with Agent C about their art.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B and C to add items to the shelf.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies away the assembly tools.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes books in an appealing manner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a reading nook by the shelf.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A picks a book to read.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares to make dessert.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  }
]