[
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "In a suburban home, Agent A is visibly preparing to resume work on a physics experiment. Agent B, a parent, watches while reading, and Agent C plays with magnetic toys. The mood conveys quiet industriousness and a focus on the task at hand.",
    "actions": [
      {
        "description": "Agent A reviews the experiment instructions to ensure understanding before resuming.",
        "values": [
          0.9,
          0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for an opinion on the experimental setup to gain a new perspective.",
        "values": [
          0.7,
          0.1,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the lab tools to create a more efficient workspace.",
        "values": [
          0.3,
          0.6,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A jots down notes about what’s been observed so far.",
        "values": [
          0.7,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with different variables within the experiment to observe various outcomes.",
        "values": [
          1.0,
          0.7,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a break and prepare a nutritious snack to replenish before continuing the work.",
        "values": [
          -0.1,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully disassembles a part of the experiment that isn't working as expected and searches for online resources to troubleshoot.",
        "values": [
          0.8,
          0.5,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to observe the experiment, explaining the process clearly to ensure comprehension.",
        "values": [
          0.5,
          0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "In the Smith family's suburban home, Agent A engages with experiment kits and a disassembled remote-controlled car in the living room. His parents, Agent B and Agent C, are nearby in the kitchen and dining area, respectively. The house is well-equipped for both educational and wholesome activities.",
    "actions": [
      {
        "description": "Agent A reassembles a remote-controlled car to troubleshoot a directional issue.",
        "values": [
          0.6,
          -0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins a new chemical reaction experiment with household items.",
        "values": [
          0.9,
          -0.2,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A records observations in a notebook while adhering to experiment instructions.",
        "values": [
          0.7,
          -0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break for a nutritious meal prepared by his mother.",
        "values": [
          -0.4,
          0.8,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carries out online research for a deeper understanding of experiment outcomes.",
        "values": [
          1.0,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A presents his experimental findings for his parents' approval.",
        "values": [
          0.4,
          -0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows to enhance ventilation as he works.",
        "values": [
          -0.2,
          0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A documents his car repair process using a camera.",
        "values": [
          0.5,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes his workspace after completing his day’s projects.",
        "values": [
          -0.3,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A scrutinizes the contents of the refrigerator and the recent supermarket flyer advertising exotic fruits. He contemplates breakfast while his eyes wander to culinary books and the half-assembled bookshelf. Indoor plants sit on the window-sill, contributing to the room's fresh feel. Tools from home improvement activities lay scattered in the living room.",
    "actions": [
      {
        "description": "Agent A decides to make a unique breakfast smoothie using the exotic fruits advertised in the flyer.",
        "values": [
          0.7,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins to assemble the half-finished bookshelf, sorting the tools and reading through the manual carefully.",
        "values": [
          0.6,
          -0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches the air-purifying indoor plants for optimal placement around the house.",
        "values": [
          0.7,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A jots down ideas for dinner by consulting one of the culinary books.",
        "values": [
          0.8,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the refrigerator's temperature settings to ensure food is being stored at the right conditions.",
        "values": [
          0.4,
          0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A repurposes leftover materials from the bookshelf project to create small stands for the indoor plants.",
        "values": [
          0.5,
          -0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to let in fresh morning air, enjoying the breeze as he eats his breakfast.",
        "values": [
          0.2,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins planning a weekly shopping list focused on incorporating more diverse, healthy foods.",
        "values": [
          0.6,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is eagerly setting up a new hydroponics system in the bedroom while preparing for a reported storm, with the aid of visiting friend Agent B and the support of the eco-minded sibling, Agent C, and under the watchful eye of Agent D, who is concerned about the storm.",
    "actions": [
      {
        "description": "Agent A unpacks the hydroponics set and begins to assemble it.",
        "values": [
          0.7,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to help set up a space in the room that would avoid water spillage.",
        "values": [
          0.1,
          0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses the phone to research the best types of plants for the hydroponics system.",
        "values": [
          0.9,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gets a sturdy table from the basement for the hydroponics setup.",
        "values": [
          0.2,
          0.6,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the house’s emergency supplies for the incoming storm.",
        "values": [
          -0.2,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings potted plants indoors to protect them from the storm.",
        "values": [
          0.1,
          0.4,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A labels all the plant pods in the hydroponics set.",
        "values": [
          0.8,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses with Agent C the hydroponics system’s integration into green initiatives.",
        "values": [
          0.6,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures the room’s window against the storm.",
        "values": [
          -0.3,
          0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a hobbyist gardener, is in the living room with droopy ferns among other indoor plants, while Agent B works on a science project and Agent C prepares a meal. Agent A investigates the plants' poor condition and seeks to remedy it.",
    "actions": [
      {
        "description": "Agent A examines the undergrowth of the droopy fern to check for pests.",
        "values": [
          0.7,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gets a magnifying glass to inspect the leaves of the fern more closely.",
        "values": [
          0.8,
          0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves a moisture meter from the drawer to test the soil of the droopy fern.",
        "values": [
          0.6,
          0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the plants to ensure they all receive adequate natural light from the window.",
        "values": [
          0.4,
          -0.4,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A waters the fern after deducing that the soil is too dry.",
        "values": [
          0.2,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches online for additional information on fern care in varying temperatures.",
        "values": [
          0.9,
          0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A switches on the LED grow lights he installed to supplement the natural light during the evening.",
        "values": [
          0.7,
          -0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a natural pesticide from ingredients found in the kitchen to treat the suspected pest problem.",
        "values": [
          0.6,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moves the dining table slightly to create a barrier preventing his nephew's project from spilling over to the plants.",
        "values": [
          0.2,
          -0.6,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a young teenager, has the living room to themselves on a rainy Saturday morning. They notice puzzle boxes and a first aid kit, feel morning hunger, and consider the well-stocked kitchen and the companionship of their playful dog.",
    "actions": [
      {
        "description": "Agent A decides to challenge himself by attempting to complete the complex puzzle alone.",
        "values": [
          0.7,
          -0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "They prepare their own nutritious breakfast, trying out a new recipe.",
        "values": [
          0.6,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the initiative to learn how to use the first aid kit.",
        "values": [
          0.7,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "They explore the house to check and update other emergency supplies.",
        "values": [
          0.4,
          -0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes outside to play with the dog, ensuring the gate is locked.",
        "values": [
          0.3,
          0.6,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Organizes the living room to create more space and secure walkways.",
        "values": [
          -0.1,
          0.5,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Researches puzzle-solving techniques online.",
        "values": [
          0.9,
          -0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Sets up an obstacle course for the dog in the backyard.",
        "values": [
          -0.2,
          0.9,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Inside a cozy suburban home, Agent A, a teenager with a penchant for science, finds himself in the living room on a stormy afternoon. The electricity is out due to the weather, leaving Agent A with limited indoor activities. His cousin, Agent B, a fitness enthusiast visiting for the week, does push-ups in the adjacent room. The storm outside rages, producing captivating patterns of light and sound with each thunderclap. Piles of books, a globe, and science experiment kits scattered around Agent A suggest a well-nurtured environment for intellectual pursuits. With the storm as a backdrop, Agent A contemplates his options for the day.",
    "actions": [
      {
        "description": "Agent A decides to build a makeshift battery to power a small LED light using household items.",
        "values": [
          0.7,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A digs into the pile of books to find one about meteorology and better understand the storm outside.",
        "values": [
          0.9,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A crafts a rudimentary barometer using a balloon, a jar, and some water to monitor air pressure changes due to the storm.",
        "values": [
          0.8,
          -0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A challenges himself with bodyweight exercises alongside Agent B, timing each set with the intervals between lightning flashes.",
        "values": [
          -0.3,
          1.0,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses the globe to teach Agent B about the geographical distribution of lightning storms.",
        "values": [
          0.4,
          -0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins drafting a plan for a lightning-proof playhouse to build in the backyard once the storm clears.",
        "values": [
          0.6,
          -0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes all the necessary supplies for the next days in a waterproof container in case the storm causes more outages.",
        "values": [
          -0.1,
          0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens a discussion with Agent B on how ancient civilizations used to explain and deal with severe weather phenomena.",
        "values": [
          0.9,
          -0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A peers out the kitchen window overlooking the garden, watching the rain. B is at the table, sketching. A begins to prepare a new recipe with an array of vegetables on the countertop.",
    "actions": [
      {
        "description": "Agent A starts preparing the new recipe using the kitchen countertop array of vegetables.",
        "values": [
          0.7,
          -0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens a cooking app to find a video for the recipe.",
        "values": [
          0.8,
          -0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects the perfect pots and pans for meal preparation.",
        "values": [
          0.3,
          -0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully turns on an oven, ensuring pot handles are turned inward.",
        "values": [
          0.2,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sharpens knives before chopping vegetables for precise cuts.",
        "values": [
          0.4,
          0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a chopping station with organized ingredients.",
        "values": [
          0.5,
          -0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a first-aid kit within easy reach.",
        "values": [
          0.1,
          -0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A labels leftovers before refrigerating for future meals.",
        "values": [
          0.3,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "[Agent A, a college student, is at the family home studying. Agent B, their parent, is organizing family heirlooms. Agent C, Agent A’s cousin, is working on an eco-friendly house project.]",
    "actions": [
      {
        "description": "[Agent A selects an advanced astrophysics book to read.]",
        "values": [
          0.9,
          0.5,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "[Agent A asks Agent B for stories behind family heirlooms.]",
        "values": [
          0.7,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "[Agent A learns about the eco-friendly house design from Agent C.]",
        "values": [
          0.8,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "[Agent A marks out historical artifact locations on a map.]",
        "values": [
          0.6,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "[Agent A researches a rare artifact online.]",
        "values": [
          1.0,
          0.3,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "[Agent A locks the study room's window upon leaving.]",
        "values": [
          -0.3,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "[Agent A sets up an old telescope for night sky observation.]",
        "values": [
          0.8,
          -0.4,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "[Agent A sketches a fire escape route for the house.]",
        "values": [
          0.5,
          0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "In the family's cluttered attic, Agent A searches through old items for encyclopedias, her intrigue captured by a locked trunk, while her cousin sketches and brother organizes camping gear.",
    "actions": [
      {
        "description": "Agent A tries to pick a trunk's lock with improvised tools.",
        "values": [
          0.8,
          0.5,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A climbs furniture to retrieve a potentially valuable box.",
        "values": [
          0.7,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A establishes a well-lit and ventilated workspace with protective gear.",
        "values": [
          -0.3,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A photographs and shares found items for familial insight.",
        "values": [
          0.6,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A documents the attic's contents for systematic exploration.",
        "values": [
          0.5,
          -0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A refreshes herself with food and water at regular intervals.",
        "values": [
          -0.4,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows to counter the confined space's stuffiness.",
        "values": [
          -0.5,
          0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully repositions a heavy book to avoid any accidents.",
        "values": [
          -0.3,
          0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A consults her grandmother about the mystery trunk.",
        "values": [
          1.0,
          -0.1,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager, is rummaging through the attic of their family home, where they find a chest filled with old maps and a compass. Agent B, Agent A's parent, is organizing family heirlooms nearby. A breeze flows in through a window.",
    "actions": [
      {
        "description": "Agent A examines an antique map to determine its place of origin.",
        "values": [
          0.8,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to research the travels that correspond with the dates on the artifacts.",
        "values": [
          1.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses the old compass to understand how it may have been used during travels.",
        "values": [
          0.7,
          -0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts categorizing the found objects according to the perceived time period.",
        "values": [
          0.8,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully cleans the dust off the items and attic space.",
        "values": [
          -0.2,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the attic space with better lighting and seating.",
        "values": [
          0.3,
          0.6,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A climbs down from the attic to gather more information.",
        "values": [
          0.9,
          0.4,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches the antique map and adds hypothetical routes.",
        "values": [
          1.0,
          0.5,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a detailed inventory of the discovered objects.",
        "values": [
          0.6,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenage botany enthusiast, is at home, gazing at an array of plants. Agent B, her cousin, is nearby with gardening tools, while Agent C, her uncle, brings a tray with food and drinks. They are in a sun-filled living room with resources for learning about plants and an atmosphere conducive to productive activities related to botany.",
    "actions": [
      {
        "description": "Agent A organizes an impromptu research session on medicinal plants.",
        "values": [
          0.9,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with propagating one of the houseplants.",
        "values": [
          0.7,
          0.6,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks all the plants' pots for proper drainage.",
        "values": [
          0.3,
          0.4,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a presentation on exotic plants.",
        "values": [
          0.8,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A updates the pot labels with care instructions.",
        "values": [
          0.4,
          0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A crafts a trellis from household items.",
        "values": [
          0.6,
          0.7,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the plants for optimal sunlight exposure.",
        "values": [
          0.5,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A disinfects and maintains gardening tools.",
        "values": [
          0.1,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stays hydrated with lemonade while gardening.",
        "values": [
          0.2,
          0.8,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teen passionate about botany, uses a rainy day to start an indoor miniature greenhouse. Agent B emphasizes cleanliness, while Agent C prepares a meal.",
    "actions": [
      {
        "description": "Agent A reads the indoor plant care book to find growth conditions for each seed.",
        "values": [
          0.9,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A constructs a watering system to ensure steady moisture for the seeds.",
        "values": [
          0.7,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a lamp to provide light for seed germination.",
        "values": [
          0.8,
          0.1,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches how to make compost from domestic waste to enrich the soil.",
        "values": [
          0.9,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a thermometer to regulate temperature.",
        "values": [
          0.6,
          -0.1,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes planting pots on an old shelf.",
        "values": [
          0.5,
          0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up spills to avoid hazards.",
        "values": [
          0.2,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules daily time for tending to the greenhouse.",
        "values": [
          0.2,
          0.6,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A drafts a proposal for a school recycling program.",
        "values": [
          0.8,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager with a fervent interest in horticulture, is watering the plants in the conservatory of her family home. She spots an old, dusty book about exotic plants. Agent B, her cousin, is nearby, and Agent C, her uncle, is making a smoothie and plans a workout session. The conservatory is filled with sunlight and has fresh air from open windows.",
    "actions": [
      {
        "description": "Agent A carefully dusts off the book and begins to read it, potentially discovering new plant species to cultivate.",
        "values": [
          0.8,
          -0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C for advice on incorporating some of the exotic plants into the home garden.",
        "values": [
          0.7,
          -0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes notes on the information she finds most fascinating in the book.",
        "values": [
          0.9,
          0.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches for online communities or local clubs focused on exotic plants to expand her knowledge.",
        "values": [
          1.0,
          -0.4,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with creating a new plant soil mixture inspired by the book.",
        "values": [
          0.8,
          0.4,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges some of the plants for optimal growth conditions she learned about.",
        "values": [
          0.6,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to help research more about the exotic plants.",
        "values": [
          0.5,
          -0.5,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to skip her usual afternoon relaxation to delve deeper into her horticultural research.",
        "values": [
          0.9,
          0.1,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses Agent C's blender to concoct nutrient-rich fertilizers for her plants.",
        "values": [
          0.3,
          0.7,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "In a suburban home, Agent A explores the living room filled with books and objects from around the world, while his parents are at work in the vicinity. He discovers a family book on rainforests as well as a blooming orchid.",
    "actions": [
      {
        "description": "Agent A selects a book on rainforest biodiversity to study.",
        "values": [
          0.9,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A interacts with Agent B about her occupation to learn more.",
        "values": [
          0.8,
          -0.1,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the blooming orchid by the sunlight.",
        "values": [
          0.7,
          -0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches online for information about orchids in their natural environment.",
        "values": [
          0.9,
          -0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a hike for family engagement.",
        "values": [
          0.6,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A photographs the orchid stages, experimenting with photography settings.",
        "values": [
          0.8,
          0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reorganizes books, including those about nature, handling them carefully.",
        "values": [
          0.3,
          0.4,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks and updates the household emergency kit.",
        "values": [
          0.1,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A after a morning jog, finds a mysterious envelope beneath a fern in the living room, sparking an indoor scavenger hunt amid their family's houseplants.",
    "actions": [
      {
        "description": "Agent A carefully retrieves the envelope from beneath the fern and examines it for clues about its origin.",
        "values": [
          0.8,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B and Agent C if they know anything about the envelope, trying to involve them in the unfolding mystery.",
        "values": [
          0.6,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a magnifying glass to inspect the plants for any pests or anomalies that may have accompanied the envelope.",
        "values": [
          0.7,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads the envelope's content, which contains a challenging indoor scavenger hunt, and decides to embark on the adventure.",
        "values": [
          1.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plots out the possible routes of the scavenger hunt on a map of the house to do it efficiently.",
        "values": [
          0.5,
          0.4,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the plants and envelope, hoping to document the experience and share it with friends later.",
        "values": [
          0.7,
          0.6,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the plants to improve their sunlight exposure as discovered during the envelope examination.",
        "values": [
          0.4,
          0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates labels for each plant with care instructions as a preventative measure for their well-being.",
        "values": [
          0.3,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "In a suburban home, a teenager with a passion for gardening starts exploring the backyard's neglected, overgrown garden brimming with mysterious plants. The mother, organizing the garage, supports the initiative, while the father, inside, keeps an attentive eye on the activity.",
    "actions": [
      {
        "description": "Agent A gathers tools like gloves, a trowel, and pruning shears to begin tending to the overgrown garden.",
        "values": [
          0.5,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches the plants online or finds a botanical guidebook to identify each species.",
        "values": [
          0.8,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches the layout of the garden and plans for optimal plant placement.",
        "values": [
          0.6,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes samples of the soil to test for pH and nutrient levels.",
        "values": [
          0.7,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A labels each plant after identifying them to keep track of their needs and growth.",
        "values": [
          0.7,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a composting area to recycle garden waste into plant food.",
        "values": [
          0.4,
          0.5,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a small fence or netting around the garden to protect it from wildlife.",
        "values": [
          0.3,
          0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A builds a rainwater collection system to provide a sustainable water source for the plants.",
        "values": [
          0.5,
          0.7,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A and her roommate Agent B are in their shared apartment on a quiet afternoon. Agent A is intrigued by a jigsaw puzzle that Agent B is working on after finishing a novel about ancient civilizations. Their neighbor, Agent C, is visiting and cooking soup.",
    "actions": [
      {
        "description": "Agent A decides to watch the documentary series about historical monuments to enhance her knowledge about the one depicted in Agent B's puzzle.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the window to allow fresh air inside and help the soup’s aroma dissipate throughout the apartment.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to teach her how to cook the soup, noting down the recipe and method in a dedicated notebook.",
        "values": [
          0.7,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the bookshelf to find a book on first aid, so she can refresh her knowledge on how to handle minor kitchen accidents.",
        "values": [
          0.6,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B to help finish the jigsaw puzzle, suggesting that once completed, it could be framed and hung up as a decoration.",
        "values": [
          0.4,
          0.5,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent C about his experiences in different cities, motivated by the new perspectives she hopes to gain.",
        "values": [
          0.9,
          -0.1,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to stretch and perform some light physical exercises to re-energize after sitting for a while.",
        "values": [
          -0.2,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches for a fire blanket online and orders one to be better prepared for any potential kitchen fires.",
        "values": [
          0.1,
          -0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is nudged by a natural interest to engage with the surrounding environment, including books and exercise equipment. Agent B is occupied with personal history, and Agent C exhibits a focus on home maintenance.",
    "actions": [
      {
        "description": "Agent A decides to dust off the encyclopedias and read about astronomy.",
        "values": [
          0.8,
          -0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pulls the bicycle out and checks if the tires are properly inflated.",
        "values": [
          0.3,
          0.6,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the box of healthy snacks and selects a variety to try.",
        "values": [
          -0.2,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to set up and use the treadmill for a brief workout session.",
        "values": [
          -0.4,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A unlocks the medicine cabinet to organize and inventory the contents.",
        "values": [
          -0.3,
          -0.6,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A approaches Agent B to ask questions about the photographs in the album.",
        "values": [
          0.7,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C with testing the smoke detectors in other rooms.",
        "values": [
          0.2,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes down the telescope, sets it up, and looks at the sky.",
        "values": [
          1.0,
          -0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches the kitchen for ingredients to prepare a nutritious meal for the family.",
        "values": [
          0.4,
          0.7,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a college student majoring in environmental science, is at her family's suburban home. She steps into the backyard with a gardening book and magnifying glass, determined to identify unknown plant species. Agent B, her parent, is tending to the garden and notes a recent beehive discovery.",
    "actions": [
      {
        "description": "Agent A carefully examines various plants, comparing them with the images and descriptions in her gardening book.",
        "values": [
          0.7,
          -0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes detailed notes and sketches of the plants and their surrounding environment in her research journal.",
        "values": [
          0.8,
          -0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses her magnifying glass to inspect the intricate details of the leaf patterns and flower petals.",
        "values": [
          0.9,
          -0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "In her excitement, Agent A ventures close to the newly built compost heap to observe the interaction between the flora and decomposing material.",
        "values": [
          0.6,
          0.1,
          -0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes soil samples near the different plants to analyze their composition as part of her environmental science coursework.",
        "values": [
          0.7,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts to tidy up an overgrown section of the garden where some unusual plants are hidden.",
        "values": [
          0.3,
          0.4,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to collect seed samples from various plants, storing them in labeled envelopes for her botany lab.",
        "values": [
          0.8,
          -0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully traverses around the garden, mindful of the recent bee activity, ensuring not to disturb their habitat.",
        "values": [
          0.2,
          -0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Using her phone, Agent A photographs the plants and uses an app to cross-reference any additional information she might find.",
        "values": [
          0.6,
          -0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a teenager who recently showed interest in plants, turning the living room corner into a green oasis. Today, a new species of houseplant arrived, and it's left him intrigued due to its complicated care instructions. Agent B, his mother, and Agent C, his father are in the kitchen, preparing ingredients for a nutritious family meal, discussing the health benefits of their choices. Back in the living room stands Agent D, his younger brother, looking at the package of seeds and tools that came with the new plant, ready to assist Agent A.",
    "actions": [
      {
        "description": "Agent A reads the care instructions for the new plant and prepares the soil accordingly.",
        "values": [
          0.7,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a special watering schedule on his phone to ensure the new plant gets the right amount of hydration.",
        "values": [
          0.5,
          0.1,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A relocates other plants to different spots around the house, considering light and space requirements for all his plants.",
        "values": [
          0.4,
          0.3,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a journal documenting the growth and health of the new plant.",
        "values": [
          0.8,
          -0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes pictures of the plant to compare and record changes over time.",
        "values": [
          0.6,
          -0.1,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to repurpose an old table into a dedicated plant stand for his new greenery.",
        "values": [
          0.3,
          0.5,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches online communities dedicated to plant care and decides to join one.",
        "values": [
          0.9,
          0.2,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins gathering ingredients for a DIY natural pesticide after noticing mites on some leaves.",
        "values": [
          0.6,
          0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a university student, is examining water samples with a microscope in her well-maintained family home as Agent B watches. Agent C is making a nutritious smoothie in the kitchen while a trained Labrador rests nearby.",
    "actions": [
      {
        "description": "Agent A carefully places a slide under the microscope and adjusts the magnification.",
        "values": [
          1.0,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A walks around the garden, inspecting vegetables for their meal.",
        "values": [
          0.3,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A jots down a list of equipment and materials for future experiments.",
        "values": [
          0.9,
          -0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls a family member for advice on her findings.",
        "values": [
          1.0,
          -0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up her workspace and organizes hazardous materials.",
        "values": [
          -0.5,
          -0.4,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a portion of the smoothie for concentration.",
        "values": [
          -0.2,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector batteries and first-aid kit.",
        "values": [
          -0.6,
          -0.4,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges her plants for optimal sunlight.",
        "values": [
          0.2,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a graduate student interested in plants, has a new orchid that she is nurturing on her apartment balcony, which she shares with her housemate, an amateur chef named Agent B. The balcony also serves as a space for Agent A's botanical research and care for her plants.",
    "actions": [
      {
        "description": "Agent A examines the orchid's root system with the microscope.",
        "values": [
          0.7,
          -0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the furniture on the balcony.",
        "values": [
          0.1,
          0.6,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches the optimal care for the orchid species.",
        "values": [
          1.0,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a small shelf on the balcony.",
        "values": [
          -0.1,
          0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a reminder on her phone for the orchid’s watering schedule.",
        "values": [
          0.3,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A designs a DIY drip irrigation system.",
        "values": [
          0.5,
          0.7,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a nutritious meal.",
        "values": [
          -0.4,
          1.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a magnifying glass to inspect the orchid.",
        "values": [
          0.8,
          -0.1,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the local library to find more specialized texts.",
        "values": [
          0.9,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, an amateur chef, is in the kitchen preparing to try out a new recipe she found in a cookbook. Agent B, her roommate, is seated at the kitchen table, working on a laptop. Agent A notices an unfamiliar kitchen gadget and contemplates how to incorporate it into her cooking process.",
    "actions": [
      {
        "description": "Agent A decides to read the instruction manual for the unfamiliar kitchen gadget to understand its functions.",
        "values": [
          0.7,
          -0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully washes the fresh vegetables, mindful of cleanliness.",
        "values": [
          0.2,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to wear cut-resistant gloves while dicing vegetables to prevent accidents.",
        "values": [
          -0.2,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with a new way to chop herbs using the multifunctional kitchen gadget.",
        "values": [
          0.8,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to cook with the window open to ensure proper ventilation.",
        "values": [
          0.1,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up spills on the floor immediately to avoid any slips.",
        "values": [
          -0.1,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tastes the food throughout the cooking process to ensure the flavors are balanced and appealing.",
        "values": [
          0.6,
          0.4,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A mentally plans out the steps to multitask efficiently without rushing.",
        "values": [
          0.5,
          0.3,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "In a suburban home, Agent A, a teenager, is focused on setting up an intricate domino trick in the living room. Agent B, the parent, watches from the couch, and Agent C, the younger sibling, enters the room with their drawing pad, intrigued by Agent A's activity. Fresh air flows from an ajar window, while an untouched apple and glass of water rest beside Agent A.",
    "actions": [
      {
        "description": "Agent A carefully examines the design blueprint to ensure the correct set-up for the domino trick.",
        "values": [
          0.6,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A repositions the table to allow more space for the growing domino arrangement.",
        "values": [
          0.1,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes collaborating with Agent C to add artistic elements to the domino configuration.",
        "values": [
          0.7,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a brief break to consume the apple and drink the water for refreshment.",
        "values": [
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the batteries in their camera to ensure it's ready to capture the domino fall.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the window further to ensure better air circulation in the room.",
        "values": [
          -0.1,
          0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the nearby electrical cords to prevent any tripping hazard while executing the domino trick.",
        "values": [
          -0.3,
          0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A consults one of the encyclopedias for structural integrity tips to implement in their domino design.",
        "values": [
          0.8,
          -0.1,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully steps over the dominos to avoid prematurely knocking them down.",
        "values": [
          -0.1,
          0.0,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager, is in the family kitchen with their parent, Agent B, and younger sibling, Agent C. It is early Saturday morning, and Agent A has risen before the rest of the household with an air of restlessness. Agent B, an early riser by habit, is preparing a healthy breakfast, while Agent C watches, habitually reaching for a colorful box of cereal. Agent A notices a new blender, is intrigued, and attentively observes the blending process.",
    "actions": [
      {
        "description": "Agent A asks Agent B to teach them how to use the new blender for future breakfast preparations.",
        "values": [
          0.8,
          -0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to assist Agent B in finishing the smoothie by gathering additional ingredients.",
        "values": [
          0.5,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the sliding door completely to let in more fresh air and stand there for a moment to breathe deeply.",
        "values": [
          -0.1,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to prepare the breakfast table, setting out dishes and utensils methodically.",
        "values": [
          -0.3,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A picks up the first-aid kit and checks the contents, restocking any missing items.",
        "values": [
          0.3,
          -0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the fire extinguisher, making sure it hasn't expired and is in accessible reach.",
        "values": [
          0.4,
          -0.5,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to Agent B and Agent C to go for a morning walk after breakfast.",
        "values": [
          -0.2,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully reads the instruction manual of the blender to understand all its features.",
        "values": [
          1.0,
          -0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the initiative to wash the dishes used by Agent B.",
        "values": [
          -0.4,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "In a spacious, sunlit kitchen, Agent A is preparing their daily smoothie when they notice a peculiar new fruit. Agent B sorts mail, Agent C works on a puzzle, and Agent D reads the newspaper with coffee.",
    "actions": [
      {
        "description": "Agent A slices the mysterious fruit to examine its insides and possibly taste it.",
        "values": [
          0.8,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts researching the odd fruit on their smartphone to identify it.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up the kitchen to ensure no mess is left after prepping their smoothie.",
        "values": [
          -0.1,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A concocts a new type of smoothie, using the new fruit as an experimental ingredient.",
        "values": [
          0.7,
          0.5,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a tasting session with Agents B, C, and D to try the new smoothie.",
        "values": [
          0.6,
          0.2,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to help install smoke alarms in the kitchen.",
        "values": [
          -0.2,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent D about the best practices for food storage.",
        "values": [
          0.5,
          0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to make extra smoothies, planning to save some for the next day.",
        "values": [
          -0.2,
          0.6,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A exercises caution by checking if the new fruit has any known allergens.",
        "values": [
          0.3,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "A teen, Agent A, keen on making an ordinary Saturday spirited, finds a bag of exotic spices next to a cookbook in the kitchen. Agent B, the younger cousin, is nearby engaging in a jigsaw puzzle, and Agent C, the guardian, is relaxing. Agent A contemplates involving everyone in a cooking adventure while preserving the calm home environment.",
    "actions": [
      {
        "description": "Agent A inspects a spice packet, seeking to identify it.",
        "values": [
          0.8,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Assembles ingredients for the recipe.",
        "values": [
          0.7,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Gathers protective gear for the cooking activity.",
        "values": [
          0.1,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Involves Agent B in the spice exploration.",
        "values": [
          0.9,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Turns cooking into a learning game for Agent B.",
        "values": [
          0.9,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Measures ingredients meticulously for the recipe.",
        "values": [
          0.3,
          0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Asks Agent C for cooking advice.",
        "values": [
          0.7,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Carefully manages the stove flame when preheating.",
        "values": [
          0.2,
          0.6,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Sets a timer for the cooking duration.",
        "values": [
          0.1,
          0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager, has set up a small greenhouse area in the sitting room, engaging in the hobby of indoor gardening. Agent B, a family member, watches with interest, and Agent C is nearby, occasionally observing Agent A's work.",
    "actions": [
      {
        "description": "Agent A meticulously labels each plant pot with its respective plant name and care instructions.",
        "values": [
          0.6,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to create a watering schedule chart for the plants.",
        "values": [
          0.5,
          -0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches different species of plants for indoor growth.",
        "values": [
          1.0,
          -0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages with Agent B to teach them about plant care.",
        "values": [
          0.8,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the greenhouse, ensuring each plant gets enough light.",
        "values": [
          0.3,
          0.5,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with creating natural plant fertilizers.",
        "values": [
          0.9,
          0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs an alarm system on the greenhouse for environmental alerts.",
        "values": [
          0.4,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes cuttings from healthy plants using sanitized tools.",
        "values": [
          0.7,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a young teenager, is in their bedroom after school where the environment is calm with an open window, science posters, and a half-assembled electronic kit on the desk. Agent B is cooking in the kitchen while Agent C plays with a puzzle in the living room.",
    "actions": [
      {
        "description": "Agent A decides to finish assembling the electronic kit on their desk.",
        "values": [
          0.6,
          0.3,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to head outside to play with the neighboring children.",
        "values": [
          0.2,
          0.8,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to look through their bookshelf to find a magazine they haven’t read yet.",
        "values": [
          0.9,
          -0.1,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a makeshift laboratory in their room to conduct a simple science experiment with household items.",
        "values": [
          1.0,
          0.4,
          -0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the kitchen to help Agent B with meal prep, aiming to learn a new cooking skill.",
        "values": [
          0.5,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts organizing their room, creating a more efficient and protective layout.",
        "values": [
          -0.1,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in an exercise routine in their room for a short burst of physical activity.",
        "values": [
          -0.3,
          1.0,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins to create a neighborhood newsletter using their computer, seeking contributions from friends.",
        "values": [
          0.7,
          -0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to assemble a new piece of furniture that has been left unassembled in the living room.",
        "values": [
          0.3,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager, comes back from school to his home which has a basement serving as a gym and study space. Upon entering the basement, he notices an old locked chest and a rock-climbing wall that intrigues him. A world map with pins on it hangs on the wall, and the windows are open allowing fresh air to fill the room.",
    "actions": [
      {
        "description": "Agent A attempts to pick the lock on the chest using paper clips, applying things he learned from a book.",
        "values": [
          0.9,
          -0.3,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the study desk to make room for the electronic kit, organizing all the materials neatly.",
        "values": [
          0.3,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a cushion on the floor below the rock climbing wall in case he falls.",
        "values": [
          -0.1,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes online to learn more about the places marked on the world map.",
        "values": [
          1.0,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a wholesome sandwich to eat before starting his activities, using ingredients from the kitchen.",
        "values": [
          0.1,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A explores the content of the computer, checking if there is any educational software installed.",
        "values": [
          0.8,
          -0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls Agent B to ask about the history of the old chest.",
        "values": [
          0.7,
          -0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads the manuals of the DIY electronic kit to understand the precautions before starting.",
        "values": [
          0.4,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a middle-aged person with an interest in home improvement, is evaluating their home office for updating and reorganization, whereas Agent B, a teen, becomes interested in the process, and Agent C provides snacks and emotional support.",
    "actions": [
      {
        "description": "Agent A begins to organize the cables and wires, identifying which ones could still be of use.",
        "values": [
          0.7,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes collaborating with Agent B to fix an old electronic screwdriver.",
        "values": [
          0.8,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B start a DIY project to convert the digital camera into a security webcam.",
        "values": [
          1.0,
          0.8,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses the decluttered space to create a more functional and open office area.",
        "values": [
          0.3,
          0.7,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the snack from Agent C, appreciating the thoughtfulness and ensuring a moment of rest and refreshment.",
        "values": [
          0.1,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A investigates the possibility of turning one of the old phones into an educational tool for Agent B's science projects.",
        "values": [
          1.0,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A thoroughly cleans the desk to make it a healthier workspace.",
        "values": [
          0.2,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up an area of the office as a charging station for the family's devices, using a wire organizer.",
        "values": [
          0.6,
          0.7,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a teenager entering their home, where different activities buzz in the kitchen and living room. The pleasant scent of cooking fills the air, a puzzle on the table piques interest, and an indoor garden adds to the atmosphere's vitality.",
    "actions": [
      {
        "description": "Helps with cooking by following a new recipe.",
        "values": [
          0.4,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Sets up a mini-station to perform a food-related science experiment.",
        "values": [
          0.7,
          0.4,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Searches for the next puzzle piece to contribute to Agent C's puzzle.",
        "values": [
          0.6,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Fixes a loose tile in the living room to prevent accidents.",
        "values": [
          -0.1,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Organizes tools for emergency preparedness.",
        "values": [
          -0.2,
          0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Reads up on hydroponics for the indoor garden.",
        "values": [
          0.8,
          0.5,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Experiments with a new plant species for the garden.",
        "values": [
          0.9,
          0.6,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Conducts an online research project for school.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Takes a break for relaxation and breathing exercises.",
        "values": [
          -0.2,
          0.7,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a young adult, is at home browsing through an old bookshelf in the attic, intrigued by various subjects ranging from ancient civilizations to foreign languages. Agent B is engaged in a jigsaw puzzle and Agent C is organizing the attic contents.",
    "actions": [
      {
        "description": "Agent A carefully extracts one of the books from the bookshelf to inspect its contents.",
        "values": [
          0.8,
          -0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wipes the dust off the cover of the book and coughs slightly, prompting them to open a window for ventilation.",
        "values": [
          0.2,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits cross-legged on the floor, flipping through the pages eagerly.",
        "values": [
          0.9,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gets up to fetch a notebook and pen to jot down intriguing facts they discover.",
        "values": [
          0.7,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides against delving into a book they perceive to be too damaged to handle.",
        "values": [
          -0.4,
          -0.3,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A climbs onto a sturdy chair to reach a book on the highest shelf.",
        "values": [
          0.6,
          0.5,
          -0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully repositions the ladder to make sure it is stable before climbing it.",
        "values": [
          0.1,
          0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside several interesting books to potentially read later.",
        "values": [
          0.5,
          -0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for input on which book might contain the most engaging content.",
        "values": [
          0.7,
          0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is unpacking in her new apartment with Agent B. They discover a complex light fixture and an old, locked wooden box which pique their interest. Agent A is focused on understanding and managing her surroundings, ensuring an environment that avoids hazards.",
    "actions": [
      {
        "description": "Agent A finds a key for the wooden box within the apartment.",
        "values": [
          0.7,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the light fixture for artistic effect.",
        "values": [
          0.6,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches for the light fixture details online.",
        "values": [
          0.8,
          0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches the historical significance of the box online.",
        "values": [
          0.9,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shakes the wooden box to guess its contents.",
        "values": [
          0.5,
          0.3,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ethically discusses the opening of the wooden box.",
        "values": [
          -0.4,
          0.1,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the wooden box lock with a magnifying glass.",
        "values": [
          0.6,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a young parent and hobbyist gardener, is in the sunny backyard beside a small home garden, noticing an unexpected plant sprouting among the tomatoes. Agent B, their child, is baking for the first time in the kitchen, while Agent C, a neighbor with botanical knowledge, arrives for a visit.",
    "actions": [
      {
        "description": "Agent A puts on gloves to examine the new plant more closely.",
        "values": [
          0.6,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes samples of the unknown plant for further analysis.",
        "values": [
          0.8,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a barrier around the plant to prevent anyone from accidentally touching it.",
        "values": [
          -0.3,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches through a gardening book for any similar types of plants listed.",
        "values": [
          0.7,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a phone to take pictures of the plant and uses an app to assist in identification.",
        "values": [
          0.9,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A constructs a temporary greenhouse structure over the unfamiliar plant to monitor its growth.",
        "values": [
          0.8,
          -0.4,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully watches over Agent B as they take the cake out of the oven.",
        "values": [
          -0.2,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shows Agent B how to set up a time-lapse camera to capture the garden.",
        "values": [
          0.7,
          0.4,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A downloads a plant identification mobile application recommended by Agent C.",
        "values": [
          0.9,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager passionate about gardening, is at home in the backyard, examining a new type of seed they discovered in an artisanal market. Agent B, their elder cousin with an interest in botany, is visiting and sharing insights into interesting plant species. The backyard is well-organized, with a variety of gardening tools neatly arranged against the fence, and a book on rare plants rests on the patio table.",
    "actions": [
      {
        "description": "Agent A decides to plant the new seeds in a section of the garden, systematically labeling the area for future reference.",
        "values": [
          0.7,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A grabs the book on rare plants and cross-references the details about the seed with the book to learn about its origin and required conditions.",
        "values": [
          1.0,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A builds a protective covering around the new planting area to shelter the seedlings from potential pests and harsh weather.",
        "values": [
          0.2,
          0.4,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creatively sets up a homemade irrigation system to ensure the new plants receive enough water.",
        "values": [
          0.5,
          0.7,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches a diagram of the garden, mapping out future expansion possibilities based on this new addition.",
        "values": [
          0.8,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches online for communities or forums to connect with others who have experience with this plant type.",
        "values": [
          0.9,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses their phone to take photos of the planting process for documentation and future reflection on the growth stages.",
        "values": [
          0.6,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a schedule to regularly check on the seeds' progress, adhering to a disciplined routine.",
        "values": [
          0.4,
          0.5,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "In a well-lit kitchen, Agent A discovers exotic fruits and feels the pull to learn more about them and incorporate them into a meal. Agent B, reading nearby, and Agent C, sketching at the table, are present but engaged in their activities. The scene is ripe for learning and creative culinary exploration by Agent A.",
    "actions": [
      {
        "description": "Agent A begins researching recipes featuring the exotic fruits.",
        "values": [
          0.8,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A washes the produce carefully before any food preparation.",
        "values": [
          0.1,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the workstation with cutting boards and knives to avoid accidents.",
        "values": [
          0.2,
          -0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a new recipe journal to document new ingredient exploration.",
        "values": [
          0.9,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A converses with Agent B about the fruits, including them in the process.",
        "values": [
          0.6,
          0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A samples the fruits, taking detailed notes on their characteristics.",
        "values": [
          0.7,
          0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a new dish improvising with the fruits and other ingredients.",
        "values": [
          1.0,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches the nutritional benefits of the fruits online.",
        "values": [
          0.8,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a teenager who has come home to find a scrapbook and a note left by their sibling (Agent B), signaling a need for help with a school project – a family tree. The teenager is attracted to the scrapbook and also considers following their exercise routine on the treadmill in the house. In the kitchen, their parent (Agent C) bakes cookies and prepares for dinner.",
    "actions": [
      {
        "description": "Agent A begins to sort through the photographs, selecting ones that might be useful for the family tree project.",
        "values": [
          0.7,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to call their grandparent to ask for stories behind some of the old photos they’ve found.",
        "values": [
          0.8,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans to create a digital version of the family tree to add to the physical scrapbook.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to put on the running shoes and use the treadmill for a quick workout before dinner.",
        "values": [
          0.1,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a space on the table to work on the scrapbook without disturbing the family dinner preparation.",
        "values": [
          0.3,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully stores the photographs back into the box to protect them after using what they need.",
        "values": [
          0.1,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break from the scrapbook work and steps outside to get some fresh air.",
        "values": [
          0.2,
          0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts interviewing Agent C about their memories of the people in the old photos.",
        "values": [
          0.9,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a young adolescent, is inspired by the stimulating environment of their home for knowledge and the well-being of the household. They observe the houseplants, assist with meal preparations, take interest in scientific experiments, and discover a potential new area of learning in terms of emergency preparedness.",
    "actions": [
      {
        "description": "Agent A carefully inspects the unfamiliar leaf, researching online to identify the plant and understand its care.",
        "values": [
          0.9,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent B with meal preparation, learning recipes that incorporate a balance of nutrients.",
        "values": [
          0.6,
          -0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to create a controlled experimental setup, testing a hypothesis they developed.",
        "values": [
          0.8,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up the area around the houseplants, ensuring the surroundings are hazard-free.",
        "values": [
          0.2,
          0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in discussion with Agent C to learn more about the experiments.",
        "values": [
          0.9,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the emergency preparedness section in the survival manual, trying to ensure preparedness.",
        "values": [
          0.6,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes brief notes from the manual, planning to share them with the family later.",
        "values": [
          0.7,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A implements a brief stretching and light exercise routine for well-being.",
        "values": [
          0.2,
          0.8,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager, is in the family kitchen on a sunny Saturday morning, looking through a cookbook for a complex recipe to cook, while Agent B is working on their laptop and Agent C organizes the pantry. Ingredients are ready on the counter, suggesting Agent A's inclination towards cooking.",
    "actions": [
      {
        "description": "Agent A decides to prepare the complex dish he found in the cookbook, gathering all the ingredients meticulously.",
        "values": [
          0.7,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors and fire extinguisher in the kitchen before starting to cook.",
        "values": [
          -0.2,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls out to Agent B to ask if they have ever tried cooking the dish before, seeking guidance.",
        "values": [
          0.8,
          -0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A labels and prepares his cooking utensils and work area to ensure order and prevent accidents.",
        "values": [
          -0.3,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a cooking vlog recording, narrating his steps and thoughts during the cooking process.",
        "values": [
          0.9,
          0.4,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the kitchen first aid kit to check if it’s fully stocked before beginning the cooking process.",
        "values": [
          -0.1,
          0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A texts a friend who's a cooking enthusiast for some tips on preparing the dish.",
        "values": [
          1.0,
          0.2,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes regular taste tests and adjusts his cooking methods as he goes along, not hesitating to start a step over if necessary.",
        "values": [
          0.8,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the ingredient containers back into the pantry, integrating Agent C's organizational system.",
        "values": [
          -0.4,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is an amateur gardener exploring his untended backyard with a variety of wild plants. Agent B, a knowledgeable neighbor, observes from over the fence. Agent C, the younger cousin, shows interest in the gardening activities from the sidelines.",
    "actions": [
      {
        "description": "Agent A opens a gardening book to identify unfamiliar plants.",
        "values": [
          0.6,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins uprooting weeds, preserving desired plants.",
        "values": [
          0.4,
          0.3,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the fence's foundation for stability.",
        "values": [
          -0.2,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to discuss local plants and gardening.",
        "values": [
          0.8,
          0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a compost bin.",
        "values": [
          0.3,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans the garden layout with a rudimentary map.",
        "values": [
          0.7,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A instructs Agent C on yard cleanliness to prevent pests.",
        "values": [
          0.2,
          0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes regular breaks for water and rest.",
        "values": [
          -0.3,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks away garden tools after use.",
        "values": [
          -0.4,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A explores an old family cookbook in the kitchen, making meticulous notes for a meal, while Agent B observes and Agent C lounges nearby, keeping a watchful eye.",
    "actions": [
      {
        "description": "Agent A decides to prepare the old family recipe but experiments with a new spice.",
        "values": [
          0.8,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes ingredients and cooking tools before cooking.",
        "values": [
          0.4,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a miniature fire extinguisher close to the stove as a precaution.",
        "values": [
          0.1,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calculates portion sizes to avoid wasting ingredients.",
        "values": [
          0.3,
          -0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with a healthier cooking method.",
        "values": [
          0.7,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wears oven mitts and uses long-handled utensils while cooking.",
        "values": [
          0.2,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A keeps a first-aid kit accessible in the kitchen.",
        "values": [
          0.2,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the kitchen floor is dry and clear to prevent accidents.",
        "values": [
          0.1,
          -0.1,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, an enthusiastic teenager, finds an old bookshelf in the attic with hidden maps and a compass while helping with spring cleaning. The attic light illuminates the dusty space. Agent B, the parent, is sorting through boxes elsewhere in the attic.",
    "actions": [
      {
        "description": "Agent A carefully examines old maps and compass, trying to determine their origins.",
        "values": [
          0.7,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches the maps online to understand if they might be historically significant.",
        "values": [
          0.8,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A climbs to the attic window to compare the maps with the current landscape.",
        "values": [
          0.6,
          -0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes notes of distinguishing landmarks or notes found with the maps.",
        "values": [
          0.5,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a workstation with proper lighting to analyze the maps.",
        "values": [
          0.4,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A enlists Agent B's help in deciphering unfamiliar terms on the maps.",
        "values": [
          0.5,
          0.0,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses gloves to handle old maps and protect their condition.",
        "values": [
          0.2,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares the discovery with a friend knowledgeable about cartography via video call.",
        "values": [
          0.9,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager, is poised to create an exotic dessert from a newly acquired cookbook in her home kitchen. Natural light filters in, casting a glow over the ingredients ready on the countertop. Her father, Agent B, is reading in the next room, and her grandmother, Agent C, tends to herbs in the garden. The quiet atmosphere is conducive to concentration, with the only sounds being the occasional clink of cooking utensils.",
    "actions": [
      {
        "description": "Agent A opens the pantry to find rare spices that might add an unconventional twist to the dessert recipe.",
        "values": [
          0.9,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully reads the steps in the cookbook, visualizing each phase before starting to execute the dessert preparation.",
        "values": [
          0.8,
          0.1,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges all the ingredients and equipment needed on the kitchen counter, maintaining order and cleanliness.",
        "values": [
          0.4,
          0.6,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a portable fire extinguisher near her cooking station, knowing that she will be working with high heat.",
        "values": [
          -0.2,
          0.0,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to put on some lively music to keep her spirits high while she bakes.",
        "values": [
          -0.3,
          0.7,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A measures ingredients with precision, understanding that baking is a science and each component's quantity affects the outcome.",
        "values": [
          0.3,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes occasional breaks to hydrate and maintain her stamina throughout the cooking process.",
        "values": [
          -0.4,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A diligently cleans up spills immediately to prevent any slip and fall accidents in the kitchen.",
        "values": [
          -0.5,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, absorbed in a scientist's autobiography, is surrounded by elements that suggest an atmosphere of exploration and learning. The presence of a nutritious meal being prepared and the proximity of testament to previous hands-on projects indicate an environment supportive of both mental and bodily demands as well as preparation for risk management in projects.",
    "actions": [
      {
        "description": "Agent A gets up and starts researching basic electronic circuits online to better understand the workings of the radio.",
        "values": [
          0.9,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to walk to the nearby store to purchase components for a new science experiment.",
        "values": [
          0.8,
          0.7,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes apart the old radio to explore its components and attempt to make improvements.",
        "values": [
          1.0,
          0.3,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A converses with Agent B on why certain foods are considered better fuel for the brain and body.",
        "values": [
          0.7,
          -0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls Agent C to the living room to share insights from the autobiography.",
        "values": [
          0.8,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously documents the new science experiment in a notebook for future reference.",
        "values": [
          0.6,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts stretching and practicing deep-breathing techniques before engaging in a new task.",
        "values": [
          -0.1,
          0.8,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes and cleans the makeshift laboratory upstairs.",
        "values": [
          -0.2,
          0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a biologist and an avid gardener, is tending to a DIY hydroponics system in the living room while Agent B is in the open kitchen making a salad. Agent C watches from the sofa, showing interest in the gardening activity.",
    "actions": [
      {
        "description": "Agent A examines the growth of lettuce in the hydroponics system.",
        "values": [
          0.7,
          -0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A refreshes the water in the DIY hydroponics system.",
        "values": [
          0.4,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns on a grow light for the hydroponics system.",
        "values": [
          0.2,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses a magnifying glass to inspect the root development.",
        "values": [
          0.8,
          -0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A records the growth measurements in a journal.",
        "values": [
          0.6,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the principles of hydroponics with Agent C.",
        "values": [
          0.9,
          0.2,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a homemade non-toxic pesticide.",
        "values": [
          0.3,
          0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches additional methods of vertical gardening.",
        "values": [
          1.0,
          0.2,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager, is home alone, sitting at their desk with scientific equipment and notes from a project, when they hear an unfamiliar thud in the attic. Agent B and Agent C are playing catch outside and accidentally send a ball through Agent A's open window.",
    "actions": [
      {
        "description": "Agent A takes a flashlight and climbs up to the attic to explore the source of the unknown sound.",
        "values": [
          0.9,
          0.7,
          -0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to move some boxes around to see if anything has fallen that could have made the thud sound.",
        "values": [
          0.7,
          0.6,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A writes down the occurrence of the sound in their notepad, adding it to a collection of other odd events noted in the past.",
        "values": [
          0.8,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures the ladder to the attic firmly before ascending to prevent any accidents.",
        "values": [
          -0.4,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches common causes of such sounds in old houses online.",
        "values": [
          1.0,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a sticky note on the window as a reminder to close it in the future to prevent accidental entries from outside objects.",
        "values": [
          -0.5,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A discovers a variety of engaging opportunities in her home, including researching new plants, studying a puzzle, and reading a climbing guidebook.",
    "actions": [
      {
        "description": "Agent A picks up one of the plant labels and decides to research the plant species online.",
        "values": [
          0.8,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the new plants into a decorative arrangement that optimizes their sunlight exposure.",
        "values": [
          0.6,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a closer look at the puzzle and attempts to fit several pieces together.",
        "values": [
          0.7,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads through the climbing guidebook and contemplates planning a future climbing trip.",
        "values": [
          0.9,
          0.6,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a system to remind herself and her roommates to water the plants regularly.",
        "values": [
          0.4,
          0.4,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a group chat with her roommates to organize a puzzle completion night.",
        "values": [
          0.5,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to prepare a nutritious meal for herself.",
        "values": [
          0.3,
          0.7,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a keen gardener, and Agent B, a landscape architect, discuss the feasibility of planting exotic plants at home while checking a gardening manual. Agent C, a young relative, inspects the family’s emergency kit to ensure preparedness.",
    "actions": [
      {
        "description": "Agent A grabs a notebook to jot down a planting schedule and list of required materials for the gardening project.",
        "values": [
          0.7,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a sample of the soil in the potential planting area for testing.",
        "values": [
          0.8,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses the internet to research the best local nurseries to find the exotic plants discussed.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins to clear the chosen section of the garden for the new plants, wearing gloves and using appropriate tools.",
        "values": [
          0.4,
          0.6,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates labels for the new plants to track growth and care instructions.",
        "values": [
          0.5,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a visit to Agent B's workplace to look at designs for sustainable garden features.",
        "values": [
          0.8,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to teach a family member how to care for the new plants, giving clear and detailed instructions.",
        "values": [
          0.3,
          0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a watering system that can be easily adjusted according to the needs of different plants.",
        "values": [
          0.2,
          0.7,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans an educational trip to a nearby botanical garden with Agent B and C for inspiration.",
        "values": [
          0.9,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "In the peaceful living room, Agent A reads while Agents B and C engage in their own separate pastimes. The environment, infused with natural light and dotted with bright green plants, invites mental and physical exploration within the secure haven of their home.",
    "actions": [
      {
        "description": "Agent A sets the book aside and approaches Agent C, showing interest in the sandwich-making process.",
        "values": [
          0.4,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to Agent C to experiment with a new sandwich recipe they read about.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes outside to the garden and picks fresh herbs.",
        "values": [
          0.5,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A drafts a plan for a family cook-off competition.",
        "values": [
          0.6,
          0.4,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the bookshelves methodically.",
        "values": [
          0.2,
          -0.1,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes out a puzzle and invites Agent B to solve it together.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the furniture to maximize open space.",
        "values": [
          0.2,
          -0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches an escape room challenge.",
        "values": [
          0.9,
          0.2,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes digital photos into albums.",
        "values": [
          0.3,
          -0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is observing ailing plants in the family greenhouse alongside Agent B and Agent C, searching for causes and remedies while being conscious of creating a stable environment for recovery.",
    "actions": [
      {
        "description": "Agent A takes a closer look at the plants to identify signs of pest infestation or disease.",
        "values": [
          0.8,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a notebook and begins documenting observations of the affected plants, including leaf color and soil moisture.",
        "values": [
          0.9,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully uproots one of the plants to examine the root health.",
        "values": [
          0.7,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the greenhouse's temperature and humidity levels against optimal conditions for the plants.",
        "values": [
          0.6,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests relocating the withering plants to a different section of the greenhouse that receives different light exposure.",
        "values": [
          0.5,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A collaborates with Agent B to mix and test a new, nutrient-rich soil blend they learned about online.",
        "values": [
          0.7,
          0.5,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches on her smartphone for modern, non-harmful pest control solutions.",
        "values": [
          0.9,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A consults a detailed gardening book from the shelf to cross-reference symptoms and potential solutions.",
        "values": [
          0.8,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously cleans the greenhouse tools before and after use, to prevent any disease spread.",
        "values": [
          0.3,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager, enters the home kitchen after school, finds fresh produce and vegetarian cooking books on the counter, and a model airplane on the coffee table, and shows interest in learning to cook plant-based meals and continuing the airplane assembly.",
    "actions": [
      {
        "description": "Agent A washes the apple before eating.",
        "values": [
          0.2,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts preparing a new recipe.",
        "values": [
          0.9,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves the first aid kit as a precaution.",
        "values": [
          -0.1,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up chopping tutorials online.",
        "values": [
          1.0,
          -0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a slip-proof mat under the cutting board.",
        "values": [
          -0.2,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A contacts Agent B for dietary advice.",
        "values": [
          0.7,
          0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes cooking ingredients.",
        "values": [
          0.3,
          0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes breaks to hydrate and have a snack.",
        "values": [
          -0.3,
          0.8,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the model airplane and plans the next steps.",
        "values": [
          0.9,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is organizing his new bookshelves in his home office, considering how best to arrange his travel memoirs and scientific journals.",
    "actions": [
      {
        "description": "Agent A catalogues his books and journals by subject, then alphabetically by the author.",
        "values": [
          0.8,
          0.3,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A explores constructing a pinboard for notes related to his current reading interests.",
        "values": [
          0.7,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches innovative shelving solutions online.",
        "values": [
          0.9,
          0.5,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins a DIY project to create sub-shelves.",
        "values": [
          0.6,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to stretch and prevent fatigue.",
        "values": [
          -0.5,
          0.7,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully places journals on high shelves using a ladder.",
        "values": [
          -0.6,
          0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs LED lights under shelves.",
        "values": [
          0.1,
          0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a nature enthusiast and an amateur chef, observes a garden early in the morning and interacts with Agent B, a neighbor, who brings fresh herbs. They discuss gardening and cooking, while Agent C, a new roommate, moves in upstairs.",
    "actions": [
      {
        "description": "Agent A inspects the fresh herbs and decides to incorporate them into a new recipe that requires meticulous preparation.",
        "values": [
          0.8,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A thoroughly washes the fresh produce with care to remove any dirt or potential contaminants.",
        "values": [
          0.2,
          0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to rearrange the kitchen to create a more efficient layout for cooking the new dish.",
        "values": [
          0.5,
          0.7,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a first aid kit from the bathroom and places it within easy reach in the kitchen, just in case of a minor injury while cooking.",
        "values": [
          -0.1,
          0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to start a compost bin in the garden for organic waste, ensuring a sustainable practice.",
        "values": [
          0.7,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the spare room to assist Agent C with the boxes, ensuring that the pathway is clear to prevent accidents.",
        "values": [
          0.1,
          0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ventures outside to explore the backyard more closely, looking for a perfect spot to set up a bird feeder.",
        "values": [
          0.9,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside some of the meal cooked with the herbs to invite Agent C to dine with them, as a welcoming gesture.",
        "values": [
          0.4,
          0.3,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is an amateur astronomer who has turned an attic into an observatory. On a night of a rare celestial event, he prepares to observe and record his findings. Agent B, his cousin and a sports enthusiast, and Agent C, the neighbor, are also present, with Agent C delivering a new telescope lens.",
    "actions": [
      {
        "description": "Agent A carefully aligns the new telescope lens for the best view.",
        "values": [
          0.8,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans observatory windows and the telescope for clear observations.",
        "values": [
          0.5,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A documents the celestial event with notes and sketches.",
        "values": [
          0.9,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites guests to watch and shares his knowledge.",
        "values": [
          0.7,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A verifies observations with a guidebook for accuracy.",
        "values": [
          1.0,
          0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A captures the event with a camera and plans to share it online.",
        "values": [
          0.6,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks weather updates to ensure uninterrupted viewing.",
        "values": [
          0.4,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches the event history for better understanding.",
        "values": [
          1.0,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tweaks telescope settings for improved viewing clarity.",
        "values": [
          0.7,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a horticulturist, is examining the growth of her exotic plants in the greenhouse with her young niece, Agent B, observing in fascination.",
    "actions": [
      {
        "description": "Agent A decides to give Agent B a mini-tour of the greenhouse, explaining the origins and characteristics of the various plant species.",
        "values": [
          0.7,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously records the growth rate and health of the plants in her notebook.",
        "values": [
          0.5,
          0.3,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully opens the package of rare seeds and starts planning the best method for planting them.",
        "values": [
          0.8,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with a new fertilizer mix on a small sample of plants to test its effectiveness.",
        "values": [
          0.6,
          0.5,
          -0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A grabs a magnifying glass to inspect a new, unfamiliar insect on one of the plants.",
        "values": [
          0.9,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a sample of the plant potentially affected by the insect to the lab area for further research.",
        "values": [
          0.7,
          0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to help her plant the new seeds, giving her a hands-on experience.",
        "values": [
          0.6,
          0.5,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A realizes some plants need more space to grow and begins to reorganize the greenhouse.",
        "values": [
          0.4,
          0.5,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A contemplates preparing a new recipe from a cookbook in the kitchen, with fresh ingredients and a new kitchen gadget at hand. Agent B is engaged with a book, while Agent C enters with a flair of outside air. The environment is ripe for further exploration, cooking, and interaction among the agents.",
    "actions": [
      {
        "description": "Agent A reads through the new recipe thoroughly before starting to cook.",
        "values": [
          0.8,
          -0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the new kitchen gadget and reads the instruction manual.",
        "values": [
          1.0,
          -0.1,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A preps ingredients with attention to recipe details.",
        "values": [
          0.7,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tests the gadget's effectiveness in the new recipe.",
        "values": [
          0.9,
          0.6,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A labels the spice mixtures by ethnic origins.",
        "values": [
          0.6,
          0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A adds a personal twist to the dish.",
        "values": [
          1.0,
          0.5,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a fire extinguisher nearby during cooking.",
        "values": [
          -0.3,
          -0.4,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A employs traditional techniques in cooking.",
        "values": [
          0.4,
          0.8,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans and organizes the kitchen post-cooking.",
        "values": [
          -0.5,
          0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager at home, is preparing the family greenhouse for the upcoming planting season. While her younger siblings play, she assesses gardening tools, unopened seed packets, and takes steps to ensure a conducive environment for plant growth.",
    "actions": [
      {
        "description": "Agent A climbs the ladder to open the window at the top of the greenhouse.",
        "values": [
          0.4,
          0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the seed packets and begins to prepare the soil.",
        "values": [
          0.8,
          0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the water irrigation system.",
        "values": [
          0.2,
          0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a weekly plan on a calendar.",
        "values": [
          0.6,
          0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gathers old gardening books and takes notes.",
        "values": [
          0.9,
          0.3,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up online tutorials about advanced gardening techniques.",
        "values": [
          1.0,
          0.1,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs small lights around the interior of the greenhouse.",
        "values": [
          0.3,
          0.5,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A drafts a list of additional supplies and tools needed.",
        "values": [
          0.5,
          0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A practices lifting and moving heavy bags of soil.",
        "values": [
          0.1,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is in the kitchen preparing breakfast, while Agent B is studying unfamiliar subjects, and Agent C is installing a new water filter.",
    "actions": [
      {
        "description": "Agent A decides to create an experimental breakfast dish using a variety of traditional and exotic ingredients found in the pantry.",
        "values": [
          0.7,
          0.5,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads the installation guide for a new water filter and proceeds to install it, aiming to enhance the tap water's quality.",
        "values": [
          0.7,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A flips through Agent B's astronomy book, captivated by the images of distant galaxies.",
        "values": [
          1.0,
          0.2,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A notices a pot on the stove whistling, indicating it's too hot, and turns down the burner to prevent spillage.",
        "values": [
          -0.3,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to allow more light and fresh air into the kitchen.",
        "values": [
          -0.2,
          0.4,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the kitchen floor to reduce the risk of someone slipping.",
        "values": [
          -0.5,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A explores smart home devices for features that can improve home security.",
        "values": [
          0.3,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is preparing the soil with a new gardening technique when they find a metallic object. Agent B is occupied in the kitchen while Agent C is building a weather station.",
    "actions": [
      {
        "description": "Agent A excavates the object carefully to examine it without harm.",
        "values": [
          0.7,
          -0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites others to discuss the object, fostering communal learning.",
        "values": [
          0.6,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches the object online to identify and understand it.",
        "values": [
          0.8,
          -0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A washes hands after handling the object.",
        "values": [
          0.2,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A seeks expert opinion on the object from the library or museum.",
        "values": [
          0.9,
          -0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A practices new gardening techniques with care for self.",
        "values": [
          0.3,
          0.5,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A notes down the process and findings in a journal.",
        "values": [
          0.8,
          -0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans planting based on weather station data.",
        "values": [
          0.6,
          0.4,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager, is pacing in the living room with a book in hand titled \"Exotic Plants and Their Hidden Properties\". They observe that the family houseplants look strikingly similar to one described in the book for its air-purifying abilities. Agent B, the sibling, is sprawled on the couch, peeling an orange while watching a documentary on health and lifestyle.",
    "actions": [
      {
        "description": "Agent A decides to read aloud interesting facts from the book about plant properties to Agent B.",
        "values": [
          0.7,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests repotting the houseplant into a larger container for better growth.",
        "values": [
          0.5,
          0.4,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows to allow for increased air circulation in anticipation of the coming storm.",
        "values": [
          -0.2,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a fun challenge to Agent B to identify fruits that provide the most benefit for sustained physical stamina.",
        "values": [
          0.6,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts researching how to care for the houseplants to ensure their longevity.",
        "values": [
          0.8,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the batteries in the flashlights and the expiry date on items in the emergency kit.",
        "values": [
          -0.1,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes an impromptu indoor fitness challenge with Agent B to promote health.",
        "values": [
          0.3,
          0.9,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up the care requirements for a new, exotic plant they might add to the collection.",
        "values": [
          0.9,
          0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A closes the windows as the wind starts to pick up, ensuring no unnecessary risks before the storm.",
        "values": [
          -0.3,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a university student, has just moved into a new shared apartment with roommates Agent B and Agent C. Amidst unpacking their boxes in the common area, Agent A stumbles upon an unmarked box that doesn't belong to them. The apartment is quiet except for the occasional sounds of the city from the open window, which brings a soft breeze into the room. Agent A is cautious about personal boundaries but feels compelled by the mystery of the unclaimed object.",
    "actions": [
      {
        "description": "Agent A contemplates the box, then decides to message the roommates asking if they know anything about it.",
        "values": [
          0.7,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a quick snack break, munching on an apple while continuing to observe the box.",
        "values": [
          0.1,
          -0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins to draft a tagging system for their belongings for future clarity and organization.",
        "values": [
          0.5,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches the apartment complex's online forum to see if anyone is missing a box.",
        "values": [
          0.6,
          0.1,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the box for any external markings or labels that could hint at its owner.",
        "values": [
          0.8,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts aside the box and focuses on securing their own belongings, placing locks on their private cabinets.",
        "values": [
          -0.1,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A Googles how to deal with unknown packages in a shared living environment for the best course of action.",
        "values": [
          0.7,
          -0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches a potential layout for their room which includes space for their new roommates' items.",
        "values": [
          0.6,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to set up a camera to document the unboxing of their own items and perhaps include the mystery box if it remains unclaimed.",
        "values": [
          0.9,
          -0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is setting up an indoor herb garden in the sunroom at home, learning from books and online resources while Agent B cooks and Agent C watches a documentary. Pots, seeds, and tools are arranged in the space for the garden.",
    "actions": [
      {
        "description": "Agent A reads gardening books and takes notes.",
        "values": [
          0.8,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the watering schedule.",
        "values": [
          0.7,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A lays out the pots in the sunroom.",
        "values": [
          0.6,
          0.5,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A considers plant adaptations.",
        "values": [
          1.0,
          0.1,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a DIY irrigation system.",
        "values": [
          0.3,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes garden tools and labels.",
        "values": [
          0.2,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sterilizes pots and tools.",
        "values": [
          -0.1,
          0.0,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A builds a barrier for the pet.",
        "values": [
          -0.2,
          0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A preps seeds in containers.",
        "values": [
          0.5,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a culinary enthusiast, is exploring the diverse flora in his new backyard, while Agent B, his neighbor and a horticulturist, tends to her garden, and Agent C, his roommate, exercises inside the house.",
    "actions": [
      {
        "description": "Agent A collects a few leaves from the plants and stores them in separate labeled bags for later research.",
        "values": [
          0.7,
          -0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses an app to snap pictures of the plants to reference them against an online database.",
        "values": [
          0.8,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent B to ask about the plants and their uses.",
        "values": [
          0.9,
          -0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to join Agent C for a quick workout session to energize himself for the day.",
        "values": [
          -0.4,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A visits a nearby library to find books on local flora and their culinary applications.",
        "values": [
          0.9,
          -0.1,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A watches a documentary about indigenous cooking methods utilized in the region.",
        "values": [
          1.0,
          -0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "A teenage enthusiast assesses their garden for the optimum planting of new exotic seeds, considering environmental factors, with a parent and another family member nearby, conducting their own activities.",
    "actions": [
      {
        "description": "Conducts experimental planting using different soil amendments to compare plant growth.",
        "values": [
          0.7,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Builds a protective cover for the exotic plants to prevent pest damage.",
        "values": [
          0.3,
          0.5,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Collects and documents the plants' growth progress and health on a daily basis.",
        "values": [
          0.8,
          0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Sketches a detailed map of the garden for specific seed placement.",
        "values": [
          0.6,
          0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Sets alarms for consistent watering and plant care.",
        "values": [
          0.1,
          0.6,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Researches the best organic pest deterrents online.",
        "values": [
          0.9,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Seeks gardening advice from the more experienced parent.",
        "values": [
          0.5,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Reorganizes garden tools for accessibility and future use.",
        "values": [
          0.2,
          0.4,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Invites another family member to assist in planting, educating them in the process.",
        "values": [
          0.4,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Teenager Agent A is in the garage, surrounded by various tools and old electronic devices. Agent B is organizing the space while Agent C works on a birdhouse. The environment is ripe for exploration and creation, with sunlight streaming in and a gentle breeze.",
    "actions": [
      {
        "description": "Agent A disassembles an old radio to understand its inner workings.",
        "values": [
          0.7,
          0.5,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a personal workspace in the garage.",
        "values": [
          0.3,
          0.6,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads a manual on electrical circuits.",
        "values": [
          0.8,
          0.2,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches out ideas for repurposing old devices.",
        "values": [
          0.9,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the garage floor of hazards.",
        "values": [
          0.1,
          0.4,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes parts into bins.",
        "values": [
          0.4,
          0.5,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B collaborate on fixing an old bicycle.",
        "values": [
          0.6,
          0.8,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a junior high school student interested in hydroponic gardening, sets up a prototype system in the sunroom with the assistance of Agent B (parent), guidance from Agent C (neighbor), and the observant yet skeptical Agent D (sibling).",
    "actions": [
      {
        "description": "Agent A takes the initiative to involve everyone by delegating tasks, enhancing efficiency, and cooperation.",
        "values": [
          0.7,
          0.6,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses the tablet to cross-check if the nutrient mix is correct, avoiding potential harm to seedlings.",
        "values": [
          0.9,
          0.3,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully labels each planter with the corresponding seed type using a permanent marker.",
        "values": [
          0.4,
          0.5,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a demonstration for Agents B, C, and D, explaining how the hydroponic system works and its benefits.",
        "values": [
          0.8,
          0.7,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to wear gloves to prevent cuts from the sharp edges of the plastic bottles while handling them.",
        "values": [
          0.3,
          0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully measures the space needed between each planter to ensure proper light access and air flow.",
        "values": [
          0.5,
          0.4,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with arranging the planters at different angles to see which configuration captures the sunlight best.",
        "values": [
          0.6,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a small water reservoir system that enables the seedlings to be adequately watered with minimal effort.",
        "values": [
          0.5,
          0.8,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects a corner of the sunroom that is visible but out of the way to place the prototype hydroponic setup.",
        "values": [
          0.2,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is fascinated by an old botanical book and inspires to contribute to his grandfather's garden. Agent B oversees his endeavours, while Agent C prepares a nutritious family meal.",
    "actions": [
      {
        "description": "Agent A performs detailed sketches of plants.",
        "values": [
          0.8,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks his grandfather for cross-pollination tips.",
        "values": [
          0.9,
          0.3,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses his phone for plant research.",
        "values": [
          0.7,
          0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A washes up before lunch.",
        "values": [
          0.1,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares his findings at lunch.",
        "values": [
          0.6,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A commits to a plant-tending schedule.",
        "values": [
          0.4,
          0.7,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A labels and protects new plants.",
        "values": [
          0.4,
          0.5,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "In a suburban home with ample backyard space, Agent A, a teenager with an inventive streak, is in the living room surrounded by scattered scientific magazines and DIY project kits. Agent B, the parent, is preparing breakfast, visible from the living room. Agent C, a younger sibling, is setting up a small tent indoors for a pretend campout.",
    "actions": [
      {
        "description": "Agent A decides to take one of the DIY kits and starts assembling an indoor weather station to understand the outdoor temperature changes.",
        "values": [
          0.8,
          0.4,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A heads to the backyard to collect soil samples, intrigued by the garden's ecosystem.",
        "values": [
          0.9,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches a layout for a new backyard obstacle course.",
        "values": [
          0.6,
          0.7,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a cookbook from the shelf and selects a nutritious recipe to prepare a family brunch.",
        "values": [
          0.3,
          0.8,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts an impromptu science quiz game with Agent C with healthy snacks as rewards.",
        "values": [
          0.9,
          0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes apart an old and non-functioning radio to understand its components.",
        "values": [
          1.0,
          0.6,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family emergency drill.",
        "values": [
          0.5,
          0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A explores an app for indoor fitness challenges.",
        "values": [
          0.7,
          0.9,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Inside a cozy suburban kitchen, Agent A explores culinary interests, while Agent B sketches a vegetable garden, and Agent C cleans out closets. The kitchen is filled with sunlight and the scent of fresh citrus.",
    "actions": [
      {
        "description": "Agent A decides to invent a new smoothie recipe using exotic fruits from the pantry.",
        "values": [
          0.7,
          -0.3,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A combs through cookbooks for meal ideas that incorporate ingredients from their future garden.",
        "values": [
          0.8,
          0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C sort through old kitchen gadgets, debating which should be kept for potential use.",
        "values": [
          0.5,
          0.4,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B collaborate to build a bird feeder from spare materials, considering the garden's ecosystem.",
        "values": [
          0.6,
          0.3,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A, inspired by Agent C's cleaning, initiates a rearrangement of the kitchen for more efficient space usage.",
        "values": [
          0.3,
          0.4,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tests the viability of different composting methods they read about, to enhance their garden’s soil.",
        "values": [
          0.9,
          0.6,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A explores the possibility of creating homemade organic plant fertilizers using kitchen waste.",
        "values": [
          0.8,
          0.5,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a teenager who has taken an interest in gardening and set up a small indoor garden at home. They are inspecting new plant sprouts and considering repotting them while their parents, Agent B and Agent C, prepare lunch.",
    "actions": [
      {
        "description": "Agent A examines each plant for signs of disease or pests to prevent any issues from spreading.",
        "values": [
          0.7,
          -0.3,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes detailed notes on the growth progress of each plant species.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the plants to ensure they all receive adequate light.",
        "values": [
          0.4,
          0.5,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches online about advanced gardening techniques.",
        "values": [
          1.0,
          0.2,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to repot a thriving basil plant into a larger container.",
        "values": [
          0.6,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares labels for each pot to track the plant types.",
        "values": [
          0.3,
          0.1,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently prunes dead leaves from the plants.",
        "values": [
          0.4,
          0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A waters the plants, measuring the amount of water carefully.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager who has received a science project kit, is in the den, preparing to start assembling it. Agent B is on the couch, and Agent C is cooking in the kitchen.",
    "actions": [
      {
        "description": "Agent A reads the instruction manual to understand assembly steps.",
        "values": [
          0.7,
          0.2,
          0.6,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the components to figure out how they fit together.",
        "values": [
          0.9,
          0.7,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A seeks advice from Agent C on the science behind the experiments.",
        "values": [
          0.8,
          0.6,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A searches for more experiments online.",
        "values": [
          1.0,
          0.8,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for creative input.",
        "values": [
          0.8,
          0.8,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes kit components in order.",
        "values": [
          0.1,
          0.5,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assembles and tests his first circuit.",
        "values": [
          0.8,
          0.9,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is a teenager who comes home to an empty house and finds a complex, 1000-piece jigsaw puzzle on the kitchen counter. The large wooden table and the afternoon sunlight streaming through the window invite him to start the puzzle.",
    "actions": [
      {
        "description": "Agent A considers the puzzle on the kitchen counter, decides to start assembling it on the spacious table.",
        "values": [
          0.8,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the kitchen to ensure that the window is properly latched after feeling a stronger gust of wind.",
        "values": [
          -0.1,
          -0.2,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to move the kitchen chairs away from the table to prevent accidental trips while working on the puzzle.",
        "values": [
          -0.2,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "He fetches the first aid kit from the bathroom and places it on a shelf in the kitchen, just in case of any minor injuries.",
        "values": [
          -0.4,
          -0.3,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to his room, grabs his noise-canceling headphones to block out distractions while working on the puzzle.",
        "values": [
          0.4,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out his phone and starts researching puzzle-solving strategies.",
        "values": [
          1.0,
          0.2,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts on an adventurous podcast to listen to while he fits the puzzle pieces together, to stimulate his mind.",
        "values": [
          0.6,
          0.5,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "After a while, Agent A stands up to stretch his legs and does a few quick exercises to keep himself alert.",
        "values": [
          -0.3,
          0.9,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sends a message to Agent B, asking for any tips since Agent B is known for completing puzzles.",
        "values": [
          0.7,
          -0.3,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, being a resourceful homeowner, is starting a shelving project in his tool shed with the help of his neighbor, Agent B, and teenage cousin, Agent C, who are both taking an interest in the work.",
    "actions": [
      {
        "description": "Agent A sketches out a new shelf design after noticing Agent C’s interest in unique joinery techniques from the book.",
        "values": [
          0.7,
          -0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B conduct an inventory check for all necessary protective gear before starting the project.",
        "values": [
          -0.2,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches a more efficient shelving plan online to maximize space in the tool shed.",
        "values": [
          0.9,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a break to prepare a nutritious snack for everyone, given the physical demands of the work ahead.",
        "values": [
          -0.6,
          0.8,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A demonstrates the importance of cleaning up sawdust and wood scraps to maintain a tidy workspace and prevent accidents.",
        "values": [
          0.1,
          0.3,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to aerate the nearby garden patch, illustrating the importance of gardening upkeep.",
        "values": [
          -0.3,
          0.6,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pauses the shelving project to teach Agent C about the structural integrity of different wood types.",
        "values": [
          0.8,
          0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A is in the family kitchen, dealing with an oven malfunction as he prepares to bake a new recipe. Agent B is present in the living room, and Agent C is at the dining table. A well-organized kitchen and the prepped ingredients set the stage for Agent A's culinary adventure.",
    "actions": [
      {
        "description": "Agent A searches through the kitchen drawers to find the troubleshooting guide in the cookbook.",
        "values": [
          0.8,
          0.3,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to use a standalone kitchen timer to track the baking time.",
        "values": [
          0.1,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully watches the baking process through the oven window to prevent burning.",
        "values": [
          0.5,
          0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places an oven thermometer inside to ensure accurate temperature levels.",
        "values": [
          0.4,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A consults the internet on his phone for advice on oven malfunctions.",
        "values": [
          0.9,
          0.2,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proceeds to carefully mix and prepare additional ingredients while waiting for the oven to preheat again.",
        "values": [
          0.3,
          0.6,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reorganizes the kitchen to prevent any accidents while the oven is being monitored.",
        "values": [
          0.1,
          0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the smoke detectors in the kitchen to ensure they are functional.",
        "values": [
          0.2,
          0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for past experiences about oven issues and potential solutions.",
        "values": [
          0.7,
          0.1,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "In a suburban home, Agent A stands in a kitchen adorned with herbs, between Agent B engrossed in an online culinary course, and Agent C securing the living room.",
    "actions": [
      {
        "description": "Agent A creates natural pest repellents from kitchen herbs to explore their properties.",
        "values": [
          0.6,
          -0.2,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Helps Agent B cook by incorporating freshly picked kitchen herbs into a recipe.",
        "values": [
          0.7,
          0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a DIY science experiment with an organized kit in the kitchen.",
        "values": [
          0.8,
          -0.1,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Tightens a wobbly leg of a kitchen chair to prevent possible mishaps.",
        "values": [
          0.2,
          0.0,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Listens to a podcast on innovative household tools while organizing drawers.",
        "values": [
          0.5,
          0.4,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Snacks on an apple for an immediate physical need while thinking of next steps.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Checks the fire extinguisher's expiration date and location.",
        "values": [
          0.1,
          -0.4,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Secures and repositions a loose cable to prevent tripping.",
        "values": [
          0.1,
          -0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, entering a sunlit kitchen, observes Agent B engrossed in a science magazine and Agent C struggling with an art project. A page on hydroponics in the magazine captures Agent A's interest, setting the stage for potential exploration and engagement in both the scientific and artistic atmospheres present.",
    "actions": [
      {
        "description": "Agent A starts a conversation with Agent B about hydroponics, asking in-depth questions.",
        "values": [
          0.8,
          -0.2,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C find instructional painting technique videos.",
        "values": [
          0.7,
          -0.1,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A completes breakfast preparation for everyone, ensuring a good start to the day.",
        "values": [
          -0.1,
          0.9,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sketches a design and lists materials for a DIY hydroponic system.",
        "values": [
          0.9,
          0.1,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a potted herb and starts a hydroponic experiment.",
        "values": [
          0.7,
          0.2,
          -0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A documents the process of experimenting with hydroponics.",
        "values": [
          0.5,
          0.0,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes creating hydroponics-related illustrations.",
        "values": [
          0.6,
          -0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a science-themed board game.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to buy more art supplies and materials for hydroponics.",
        "values": [
          0.4,
          0.8,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "In a suburban home, Agent A observes the kitchen activity with Agent B rinsing vegetables and Agent C assembling a puzzle. The scent of stew and fresh herbs fills the air.",
    "actions": [
      {
        "description": "Agent A prepares a novel salad with new ingredients.",
        "values": [
          0.8,
          0.3,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a kitchen clean-up race, emphasizing care with utensils.",
        "values": [
          0.4,
          0.7,
          0.4,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads a cookbook for a challenging recipe.",
        "values": [
          1.0,
          -0.3,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the pantry on a stable stool.",
        "values": [
          0.5,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a homemade seasoning blend.",
        "values": [
          0.9,
          0.4,
          0.1,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a mindful tasting session.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A collects and organizes meal ingredients.",
        "values": [
          0.3,
          0.5,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges heavy pots to a secure location.",
        "values": [
          -0.2,
          0.4,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "safety"
    ],
    "scenario": "Agent A, a teenager, finds himself home alone with a new modular kitchen rack to assemble, along with a snack prepared by Agent B. Fresh air flows into the space from the ajar back door.",
    "actions": [
      {
        "description": "Agent A meticulously reads through the assembly instructions for the modular kitchen rack.",
        "values": [
          0.8,
          -0.2,
          0.5,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins to assemble the kitchen rack.",
        "values": [
          0.6,
          0.5,
          0.3,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gathers protective gear.",
        "values": [
          -0.3,
          -0.1,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to eat the snack.",
        "values": [
          -0.5,
          0.9,
          0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows in other rooms.",
        "values": [
          -0.4,
          0.2,
          0.7,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tests the sturdiness of the racks.",
        "values": [
          0.4,
          0.2,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A documents the assembly steps.",
        "values": [
          0.7,
          0.3,
          -0.2,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully sweeps the area after assembly.",
        "values": [
          -0.6,
          0.1,
          0.9,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to create labels for the rack compartments.",
        "values": [
          0.5,
          0.4,
          -0.1,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  }
]