[
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a fitness enthusiast, concludes a workout session in the living room. Agent B is in the kitchen preparing a post-workout meal, and Agent C, their child, sits by the dining table engrossed in homework. The living room is well-ventilated with fresh air pouring in through the open windows. Agent A notices a loose wire presenting a tripping hazard.",
    "actions": [
      {
        "description": "Agent A secures the loose wire from the stereo.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent B with meal preparation.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares a light-hearted joke with Agent C.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family game post-meal.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens additional windows to enhance air circulation.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A does post-meal stretching with the family.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans an outing for the family.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A readies the dining space for the meal.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads a book for relaxation.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A finishes a morning workout, revitalized. Agent B is making breakfast, and Agent C readies for work. The household is alive with individual routines that contribute to a collective feeling of tranquility and organization.",
    "actions": [
      {
        "description": "Agent A prepares a bowl of oatmeal with the fresh fruits cut by Agent B to refuel after their workout.",
        "values": [
          0.0,
          0.9,
          0.5,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sends a group message to B and C suggesting an evening movie night for relaxation.",
        "values": [
          0.0,
          -0.2,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A steps onto the balcony to take several deep breaths of the fresh morning air.",
        "values": [
          0.0,
          0.5,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to rearrange the living room furniture to enhance the space’s ambiance.",
        "values": [
          0.0,
          -0.5,
          -0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a new playlist of music that brings a sense of joy, planning to share it with B and C during breakfast.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sorts through a cabinet of games, picking out a few to suggest for a game night later in the week.",
        "values": [
          0.0,
          -0.3,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts drafting a list of errands to run, ensuring everything is in order for the coming days.",
        "values": [
          0.0,
          -0.4,
          0.7,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent C with setting up their workspace for an optimized working environment.",
        "values": [
          0.0,
          -0.2,
          0.6,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A does a quick online search for local events that might be enjoyable to attend together with their housemates.",
        "values": [
          0.0,
          -0.3,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A returns from a jog and enters the kitchen where Agents B and C are preparing for dinner in a clean and organized setting. The environment is conducive to a stable, nourishing, and content evening.",
    "actions": [
      {
        "description": "Agent A decides to wash their hands thoroughly before proceeding to help prepare the dinner.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to let in more fresh air as they start to organize the ingredients for the meal.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully cuts the vegetables, taking time to evenly chop them to ensure they cook uniformly.",
        "values": [
          0.0,
          0.5,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A notices a spill on the floor and immediately cleans it up to prevent any slips or falls.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns on some light background music to create an enjoyable atmosphere while cooking.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks that the smoke detector is working properly before beginning to cook.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agents B and C to build on their interpersonal relationships.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously stores away leftover ingredients to keep them fresh and uses the first in, first out principle.",
        "values": [
          0.0,
          0.3,
          0.6,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A suggests a board game that they know everyone enjoys to extend the pleasant time together.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is at home in the kitchen preparing a fresh salad. Agent B enters the kitchen and commends the appearance of the meal. Agent C joins and decides to make a fruit drink. They enjoy friendly interactions as they prepare to dine together.",
    "actions": [
      {
        "description": "Agent A carefully sharpens knives before chopping vegetables.",
        "values": [
          0.0,
          0.4,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A hydrates with a glass of water.",
        "values": [
          0.0,
          0.7,
          0.6,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays soft music.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns off all electrical kitchen appliances.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A measures salad dressing ingredients.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation on weekly highlights.",
        "values": [
          0.0,
          0.3,
          0.2,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wraps leftovers for refrigeration.",
        "values": [
          0.0,
          0.3,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent C in choosing fruits.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens a window to let in fresh air.",
        "values": [
          0.0,
          0.4,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A hosts a dinner party with Agents B and C, filling their home with lively conversation, delightful aromas, and a cozy ambiance. They indulge in a sumptuous meal, enjoy entertainment, and foster a sense of camaraderie.",
    "actions": [
      {
        "description": "Agent A decides to dim the lights in the dining area, creating a warm atmosphere for the meal.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a toast to good company and the meal they are about to share.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A suggests watching a comedy movie everyone enjoys to end the evening with laughter.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a board game after the movie, encouraging a friendly competition.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers everyone refreshing lemonade they’ve prepared themselves, ensuring they stay hydrated throughout the evening.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to let in some fresh evening air for comfort during the gathering.",
        "values": [
          0.0,
          0.1,
          -0.1,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously checks the kitchen and living area to make sure everything is turned off and locked up for the night.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A passes around a photo album of fun memories for everyone to reminisce over, strengthening bonds.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a single parent enjoying a relaxed Sunday at home with Agent B, a teenager absorbed in reading, and Agent C, the youngest, drawing intently. The household emanates a sense of tranquility and warmth, with natural light and comforting music.",
    "actions": [
      {
        "description": "Agent A prepares a nutritious lunch with garden vegetables.",
        "values": [
          0.0,
          0.8,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk to the park for exercise and air.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays charades with Agents B and C.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads stories aloud to Agents B and C.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a family meditation session.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to finish a jigsaw puzzle.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks home security before bed.",
        "values": [
          0.0,
          -0.5,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the house with Agents B and C.",
        "values": [
          0.0,
          0.4,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "In the kitchen, Agent A has prepared a healthy sandwich and set the table for lunch with a pitcher of lemon water. Agent B is organizing a cupboard, and Agent C is at the kitchen island with a science project. The backdoor is ajar, letting in a breeze and fresh air, and a first-aid kit is accessible.",
    "actions": [
      {
        "description": "Agent A sits at the table, inviting Agent B and Agent C to join for lunch.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the backdoor to ensure it is closed and locked after the breeze.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to take a break from the project and join them for a meal.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pours water for everyone, insistent on keeping the family well-hydrated.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to play some light music in the background to enhance the meal atmosphere.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gently reminds Agent B to sit down and rest, offering to take over the cupboard organizing task.",
        "values": [
          0.0,
          -0.2,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk after lunch to the nearby park for a dose of nature and physical activity.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a quick quiz game during the meal about healthy food choices, turning it into a fun learning session.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A examines the first-aid kit to ensure that everything is in place and up to date.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the kitchen windows wider to allow more fresh air to circulate.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a mother of two, has finished making a nutritious dinner, while her husband, Agent B, just got back from a jog, and their teenage children, Agents C and D, are completing homework upstairs. The dinner table is ready, and Agent A is gathering everyone for the meal.",
    "actions": [
      {
        "description": "Agent A invites the family to share their most uplifting moments of the day while enjoying the meal.",
        "values": [
          0.0,
          0.5,
          0.3,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family board game after dinner to enhance the joyous atmosphere of the evening.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family hike for the upcoming weekend to explore a new trail, engaging the family in anticipation.",
        "values": [
          0.0,
          0.8,
          -0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects a brightly colored tablecloth and plays lively music to create an inviting and upbeat ambiance for dinner.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the seating at the dinner table to ensure everyone has a clear line of sight to one another to facilitate conversation.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a serving of a new, exotic fruit as part of the meal to introduce the family to different tastes and nutritional benefits.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks that all sharp kitchen tools and hot items are out of reach of younger family members to maintain a harm-free environment.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks the front door and activates the alarm system before the family sits down for dinner, securing the home.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a future vacation to a destination favored by the family, sparking discussion and shared excitement.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a culinary enthusiast, hosts a dinner party to introduce herself to her new neighbors, Agents B and C. The dining room is warm and smells of a savory roast, with an environment prepared for friendship and enjoyment.",
    "actions": [
      {
        "description": "Agent A opens the windows to allow fresh air to circulate in the dining room.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the food in the oven wearing oven mitts to ensure personal protection.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A introduces a game to promote laughter and enjoyment after dinner.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a toast to new friendships.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares anecdotes about her culinary adventures.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures everyone has a full glass of water throughout the evening.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to share stories about the neighborhood.",
        "values": [
          0.0,
          -0.2,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A declines to open a second bottle of wine, promoting moderation.",
        "values": [
          0.0,
          0.4,
          0.7,
          -0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages moving to the living room for comfort and warmth.",
        "values": [
          0.0,
          -0.3,
          0.6,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a teenager, is in the kitchen preparing a smoothie after an early morning jog. Agent B, Agent A's mother, is organizing emergency contacts, and Agent C, Agent A’s younger brother, is securing cables in the living room. The home is filled with sunlight.",
    "actions": [
      {
        "description": "Agent A decides to make extra smoothies and labels them for everyone in the family for later consumption.",
        "values": [
          0.0,
          1.0,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a regular alarm as a reminder for a break during his studies to do a brief workout.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs a new smoke detector in the kitchen to alert in case of a fire.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A maps out a fire escape plan for the family and discusses it over dinner.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans and bandages a small cut he got while slicing the fruits, without delay.",
        "values": [
          0.0,
          -0.2,
          0.8,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns on upbeat music in the kitchen to enhance his mood while cooking.",
        "values": [
          0.0,
          0.2,
          0.1,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family game night to spend quality time together in the evening.",
        "values": [
          0.0,
          -0.4,
          0.5,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to research healthy recipes online to contribute to the family meals.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "In a well-lit kitchen, Agent A is preparing vegetables for dinner, Agent B is consulting a recipe, and Agent C is setting the dining table, with the atmosphere buoyant with the aroma of fresh food and soft humming.",
    "actions": [
      {
        "description": "Agent A decides to prepare a new, healthy recipe that includes plenty of fresh vegetables and lean proteins.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs smoke detectors and a fire extinguisher in the kitchen for increased prevention.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family game night after dinner to foster quality time.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to stretch and do some light exercises in between cooking tasks.",
        "values": [
          0.0,
          0.6,
          -0.1,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the knife handles are turned inwards away from the edge of the counter.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to choose the background music, fostering a pleasant atmosphere.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a group conversation about everyone's day, smiling and listening actively.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent C in helping to prepare a simple side dish, providing guidance and praise.",
        "values": [
          0.0,
          0.5,
          0.6,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside a portion of the meal for a neighbor who lives alone, planning to deliver it later.",
        "values": [
          0.0,
          -0.2,
          0.4,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is taking a break after a productive work morning. Agent B is preparing brunch, and Agent C exercises in the living room.",
    "actions": [
      {
        "description": "Agent A decides to join Agent C in stretching exercises.",
        "values": [
          0.0,
          0.8,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests going for a family bike ride in the nearby park after brunch.",
        "values": [
          0.0,
          0.7,
          -0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a bird feeder on the window sill.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a cluttered cupboard.",
        "values": [
          0.0,
          -0.3,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A drafts a meal plan for the next week.",
        "values": [
          0.0,
          0.5,
          0.6,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent B to prepare the table for brunch.",
        "values": [
          0.0,
          -0.2,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to take a 20-minute nap before brunch.",
        "values": [
          0.0,
          0.9,
          0.2,
          -0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls a relative to catch up and share cheerful events.",
        "values": [
          0.0,
          -0.4,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A lights scented candles to create a calming environment.",
        "values": [
          0.0,
          -0.5,
          -0.1,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A wakes up on a peaceful Saturday morning, feeling refreshed without an alarm. The house is tranquil with her father working remotely, and her brother playing video games. She decides to make a fruit smoothie in a sunlit kitchen, while light music plays, and shares it with her family, setting the tone for a relaxed, enjoyable day.",
    "actions": [
      {
        "description": "Agent A chooses to make a large jug of smoothie to share with her family.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a small workstation on the patio for her father, Agent B, to enjoy the weather while working.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to join her brother, Agent C, for a cooperative gaming session.",
        "values": [
          0.0,
          -0.3,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family brunch in the garden to enjoy the morning together.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family walk in the nearby park later in the afternoon.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the living room to create a cozy movie-watching setup for the evening.",
        "values": [
          0.0,
          0.3,
          0.7,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A calls a friend to plan a weekend hiking trip for the following week.",
        "values": [
          0.0,
          0.6,
          -0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A practices some light yoga on the balcony to stretch out after her exams.",
        "values": [
          0.0,
          0.9,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a power nap after making breakfast to recharge for the day.",
        "values": [
          0.0,
          1.0,
          0.2,
          -0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a college student, has just returned home after final exams. The house is quiet as Agent B, their parent, is tending to the garden, and Agent C, their teenage sibling, is in their room practicing guitar. Agent A places a pair of newly bought running shoes by the door and heads into the kitchen. Inside the kitchen, Agent A opens the refrigerator, filled with a variety of fresh ingredients. They glance at the clock, noting it's early afternoon. Agent A steps into the living room, examining a pile of books on the coffee table, considering whether to spend the afternoon reading or to take a nap on the comfortable sofa bathed in sunlight from the open window.",
    "actions": [
      {
        "description": "Agent A starts preparing a nutritious smoothie with the fresh ingredients.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a brisk walk in the neighborhood for fresh air.",
        "values": [
          0.0,
          0.6,
          -0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts on the new running shoes for an afternoon jog.",
        "values": [
          0.0,
          0.9,
          0.3,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A picks one of the books from the coffee table to read.",
        "values": [
          0.0,
          -0.2,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A lays down on the sofa for a power nap to refresh.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays a board game with Agent C to bond and share a laugh.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B in the garden, getting hands-on experience with plants.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to practice some yoga in the living room, using an online video for guidance.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a space in the living room for a meditation corner.",
        "values": [
          0.0,
          -0.3,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is hosting a dinner party at home, with Agent B arranging music and Agent C bringing a board game. The setting is cozy and conducive to both enjoyment and well-being.",
    "actions": [
      {
        "description": "Agent A checks the batteries in the smoke detector before beginning to cook.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the emergency exit plan with Agents B and C.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A samples the food to make sure it's perfect before serving.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a deep breath to maintain composure before guests arrive.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a lively conversation about a shared interest.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fills everyone’s glass and proposes a toast.",
        "values": [
          0.0,
          0.1,
          0.0,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing the board game after dinner.",
        "values": [
          0.0,
          0.2,
          0.0,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A regularly tops off water glasses for hydration.",
        "values": [
          0.0,
          1.0,
          0.8,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wraps up extra food for guests to take home.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.3,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "In a bright, busy kitchen, Agent A is preparing a meal while maintaining cleanliness and caution. Agent B is working on school projects and Agent C tidies the nearby area. Agent D, playful in the backyard, keeps a watchful eye on the kitchen activities. The household radiates a sense of structured, joyful cohabitation.",
    "actions": [
      {
        "description": "'Agent A' turns pot handles inward to prevent spills.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' shares a snack with Agent B.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' opens windows for ventilation.",
        "values": [
          0.0,
          0.5,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' listens to a favorite music playlist.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' sets a cooking timer.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' straightens the kitchen rugs.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' plays catch with Agent D.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "'Agent A' tastes and seasons the food.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a college student, is back home from university and teams up with Agent B in the kitchen to prepare a meal, while Agent C tidies the living room. The house is filled with warmth and the smells of cooking, providing a sense of communal joy and wellbeing.",
    "actions": [
      {
        "description": "Agent A decides to chop vegetables for the meal being prepared.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a board game night after dinner.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a group exercise session in the backyard.",
        "values": [
          0.0,
          0.8,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to retire early to replenish their rest.",
        "values": [
          0.0,
          0.7,
          0.4,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to install the new smoke detectors they bought earlier.",
        "values": [
          0.0,
          -0.4,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to reorganize the kitchen for better efficiency while cooking.",
        "values": [
          0.0,
          -0.5,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in light-hearted banter with Agent B to keep spirits high while cooking.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a deep breath of fresh air from the open window while stretching.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a young parent in a suburban home with a warm and relaxed atmosphere, watching their children Agents B and C play in the yard while their partner, Agent D, works on a puzzle. The smell of homemade bread fills the home and everyone is engaging in their comforting activities.",
    "actions": [
      {
        "description": "Agent A decides to join Agents B and C in the game of tag.",
        "values": [
          0.0,
          0.6,
          -0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break from the game to prepare a nutritious lunch for the family.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the backyard's fence.",
        "values": [
          0.0,
          -0.1,
          0.9,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family board game.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A instigates a pillow fight with the family.",
        "values": [
          0.0,
          0.4,
          -0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B and Agent C some basic first aid.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a small treasure hunt in the yard.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the home's first aid kit is stocked.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent D to join the outdoor activities.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is prepping for a dinner party and engages in various tasks that emphasize the values of well-being, bonding, knowledge sharing, foresight, emotional ambiance, social engagement, and property maintenance.",
    "actions": [
      {
        "description": "Takes a playful break with Agent C for shared joy.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Teaches Agent B the stir-fry dish for knowledge sharing.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Washes produce for hygienic cooking.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Involves all in table setting for inclusivity.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Cleans up the house to prevent dinner party disturbances.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Plays light music to enhance dinner ambiance.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Checks first-aid kit for emergency preparedness.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A has returned home from work to find a warm house with a fragrance of cookies and a healthy snack available. Agent B and C are playing, and Agent D has baked cookies. The home environment is serene with a glow of the sunset.",
    "actions": [
      {
        "description": "Agent A changes into comfortable clothes and starts yoga in the living room.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and the kids have a dance party to their favorite songs.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cooks a nutritious meal for the family.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes for an evening walk with Agent D.",
        "values": [
          0.0,
          0.4,
          0.7,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads a novel on the couch.",
        "values": [
          0.0,
          -0.1,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays a board game with the family.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A holds a family meeting to plan the weekend.",
        "values": [
          0.0,
          0.3,
          0.6,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and the kids bake new cookies together.",
        "values": [
          0.0,
          0.4,
          0.4,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a young adult, is in the living room on a Sunday morning, stretching in front of the TV following an exercise video. Agent B, their roommate, is in the kitchen with a bowl of fruit salad. Agent C, another roommate, is watering plants on the balcony. Agent A notices a loose screw on the TV stand, pauses the workout video, tightens the screw, and resumes working out after having a salad with Agent B and laughing with Agent C.",
    "actions": [
      {
        "description": "Agent A tightens the loose screw on the TV stand to prevent any potential accident.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A accepts the fruit salad from Agent B and sits down to eat together, having a friendly conversation.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A resumes the exercise routine after managing the TV stand, with increased enthusiasm.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows to let in additional fresh air while exercising.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches a more advanced workout plan online to follow in the future.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to Agent B and C to have a regular weekend exercise session together.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a hydration station with water and beverages for everyone to use after workouts.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to rearrange the furniture in the living room to create more space for exercise.",
        "values": [
          0.0,
          -0.3,
          0.5,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up the instructions to repair a small tear in the couch to prevent it from getting worse.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is preparing a well-balanced breakfast in the kitchen. Agent B is reading the paper, and Agent C is setting the table. The family dog is napping in the living room.",
    "actions": [
      {
        "description": "Agent A carefully plates the breakfast.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the stove is turned off.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about daily plans.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows for air circulation.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a morning exercise session.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to pack Agent C’s lunch.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family outing.",
        "values": [
          0.0,
          -0.4,
          0.1,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the dog for a walk with a leash.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays light, cheerful music.",
        "values": [
          0.0,
          0.2,
          -0.1,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A prepares a festive meal for a small family gathering, focusing on nourishing and flavorsome cooking as Agent B arranges the dining area. Agent C selects background music with Agent D, all within the warmth of the family home.",
    "actions": [
      {
        "description": "Agent A checks the smoke detectors before beginning to cook.",
        "values": [
          0.0,
          0.4,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tastes the food to adjust seasonings.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches cooking basics to Agents C and D.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays a card game with Agent C and Agent D.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up spills immediately.",
        "values": [
          0.0,
          0.4,
          0.9,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A wears a funny apron to entertain Agent B.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses ergonomic kitchen tools to ease strain.",
        "values": [
          0.0,
          0.4,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages with Agent C’s music choices.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a garnishing competition with Agent D.",
        "values": [
          0.0,
          0.5,
          0.6,
          1.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A wakes up on a sunny Sunday morning in his family's suburban home. His mother is preparing breakfast, his father is setting the table, and their dog is showing excitement. Agent A feels uplifted by the smell of baking and the sound of his father humming a tune.",
    "actions": [
      {
        "description": "Agent A offers to help set the table for breakfast.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to join his father in a light exercise routine in the garden after breakfast.",
        "values": [
          0.0,
          0.8,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps his mother by washing the breakfast dishes without being asked.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the dog for a walk around the neighborhood.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A unpacks a new board game and invites his parents to play after the chores are done.",
        "values": [
          0.0,
          -0.1,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to plan his study schedule for the upcoming school week.",
        "values": [
          0.0,
          -0.4,
          0.7,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors in the house to see if they are functioning correctly.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to fix a loose stair railing that his mom pointed out a few days ago.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to bake cookies using the family's favorite recipe.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a college student, returns home after morning classes to find Agent B, her mother, preparing lunch and Agent C, her father, checking the smoke detector. A breeze freshens the house.",
    "actions": [
      {
        "description": "Agent A helps chopping vegetables for the salad.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the dining area.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a quick workout session.",
        "values": [
          0.0,
          0.9,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the locks on doors and windows.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C in testing smoke detectors.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a brief nap.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites family for a board game.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A waters the indoor plants.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A washes the dishes after lunch.",
        "values": [
          0.0,
          0.1,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a culinary enthusiast, has just returned from the farm market and is preparing breakfast in a sunlit, warm kitchen, with Agents B and C present. Agent B is engaging in drawing, while Agent C organizes the pantry.",
    "actions": [
      {
        "description": "Agent A decides to make a large breakfast, incorporating the newly bought produce, to share with Agent B and Agent C.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector while cooking to ensure it is working properly.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "After breakfast, Agent A involves Agent B in washing the dishes, turning it into a playful water game.",
        "values": [
          0.0,
          0.3,
          -0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A, noticing they have been sedentary, sets a timer for a family exercise session in the living room.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent C that they should organize the medicine cabinet to check for expired items and restock necessary supplies.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans to prepare a homemade meal prep for the upcoming week, ensuring they utilize all fresh ingredients.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "To reduce risks of accidents, Agent A installs a new lock on the cleaning supplies cabinet, out of Agent B's reach.",
        "values": [
          0.0,
          -0.2,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B for a storytelling session focused on the importance of not touching sharp kitchen tools.",
        "values": [
          0.0,
          -0.1,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "At the end of the day, Agent A engages the family in a relaxing yoga session to wind down.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a fitness enthusiast preparing breakfast in a spacious, well-lit kitchen while his daughter, Agent B, finishes homework and his partner, Agent C, packs a first-aid kit. The family is preparing for a hiking trip.",
    "actions": [
      {
        "description": "Agent A prepares an omelet with vegetables for a nutritious start to the day.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a fruit smoothie, combining bananas, berries, and yogurt.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside a portion of the smoothie to drink before their hike.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stretches briefly, encouraging Agent B to join in and warm up.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the weather forecast to ensure favorable conditions for the hike.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures the house before leaving to prevent any security issues.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a playful quiz about nature with Agent B.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fills reusable water bottles for hydration during the outing.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a spirited teenager, is in the kitchen contemplating a fruit selection for a smoothie, while dressed for their morning jog. Agent B is looking at recipes, and Agent C dances to music. A fresh aroma wafts from the baked bread and coffee.",
    "actions": [
      {
        "description": "Blending various fruits with yogurt for a smoothie post-jog.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Checking the weather app for jog conditions.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Inviting Agent C to join the morning jog.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Stretching on the garden mat after jogging.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Washing hands before and after smoothie prep.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Sharing the smoothie with B and C.",
        "values": [
          0.0,
          -0.5,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Making fresh coffee for Agent B.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Selecting a calming playlist for relaxation.",
        "values": [
          0.0,
          -0.4,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Engaging in bread-making with Agent B.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a teenager engrossed in a colorful cookbook in the middle of their tidy and warmly lit kitchen. Agent B, their parent, reads the newspaper at the kitchen table, and Agent C, a cousin, is fixing a cabinet.",
    "actions": [
      {
        "description": "Agent A carefully washes their hands before and after handling different food items.",
        "values": [
          0.0,
          0.3,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously follows the recipe steps, measuring ingredients for a dish they are preparing.",
        "values": [
          0.0,
          -0.2,
          0.6,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a kitchen timer to prevent overcooking the meal.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens a window to allow fresh air into the kitchen.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to taste-test the dish, seeking feedback.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up spills immediately to maintain a tidy space.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the dining table with care to create a pleasant mealtime atmosphere.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns off the stove and all kitchen appliances after finishing cooking.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures the kitchen by storing away sharp utensils.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A returns from a morning run to find Agent B preparing a nutritious breakfast and Agent C reading peacefully; a chirping smoke detector indicates low batteries without disturbing the harmony.",
    "actions": [
      {
        "description": "Agent A changes the smoke detector's batteries.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks food ingredient expiration dates.",
        "values": [
          0.0,
          0.3,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to circulate air.",
        "values": [
          0.0,
          -0.2,
          0.5,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A adds spinach to the smoothie for more nutrients.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the breakfast table beautifully.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays soothing background music.",
        "values": [
          0.0,
          -0.3,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A refrains from disturbing Agent C's reading.",
        "values": [
          0.0,
          -0.2,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies the living space.",
        "values": [
          0.0,
          -0.1,
          0.4,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a weekly meal plan for balanced eating.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a young adult who recently moved to a new apartment for better work opportunities. Agent B, a long-time friend, and Agent C, a professional chef, are over to cook dinner together. They are preparing the meal, with Agent C directing and Agent B setting the table.",
    "actions": [
      {
        "description": "Agent A suggests making a healthy smoothie with the fresh produce they bought together.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A participates in chopping vegetables for the meal, maintaining good knife technique.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows for circulation while cooking.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes to fetch a first-aid kit just to have it handy.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays music that all of them enjoy to create a pleasant atmosphere.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to set up a small herb garden on the balcony.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites friends to join a short workout session before dinner.",
        "values": [
          0.0,
          0.9,
          -0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a trivial game while the food cooks.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a workspace that is clutter-free and plans to keep it that way.",
        "values": [
          0.0,
          -0.3,
          0.5,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "In a warmly-lit kitchen, Agent A prepares for cooking while Agent B enjoys tea and Agent C works on a grocery list, all within a comfortable domestic setting.",
    "actions": [
      {
        "description": "Agent A washes vegetables and cuts them with care.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the locks on the back door for security.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sharpens the kitchen knives carefully.",
        "values": [
          0.0,
          -0.2,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a pot of water to boil for pasta, attentively adjusting the flame.",
        "values": [
          0.0,
          0.3,
          0.2,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A playfully flicks water at Agent C.",
        "values": [
          0.0,
          0.4,
          -0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A has a spontaneous dance-off with Agent B.",
        "values": [
          0.0,
          0.7,
          -0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C chopping techniques.",
        "values": [
          0.0,
          -0.1,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A steps outside to breathe fresh air and stretch.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pours coffee for Agent B and chats about music.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a marathon enthusiast, is making a post-run smoothie in the kitchen. Agent B is setting up the living area for a movie day. Agent C is packing gear for an outdoor photography session. The house is filled with a sense of contentment.",
    "actions": [
      {
        "description": "Agent A decides to stretch and cool down after preparing the smoothie.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to join Agent B to watch a movie and enjoys a shared laughter-filled moment.",
        "values": [
          0.0,
          -0.4,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a second smoothie to share with Agent B during the movie.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke alarms are functional while doing chores around the house.",
        "values": [
          0.0,
          -0.1,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A spends time with Agent C offering to help with packing.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a short nap in the afternoon to regain strength.",
        "values": [
          0.0,
          0.9,
          0.4,
          -0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to read a book in the garden.",
        "values": [
          0.0,
          -0.2,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a small indoor garden.",
        "values": [
          0.0,
          -0.3,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to prepare a healthy family dinner, involving everyone in cooking.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A steps into the kitchen where Agent B is preparing breakfast, and Agent C is arranging equipment for a workout, all in a home with fresh air coming through an open window and a reminder of a morning hike on the fridge calendar.",
    "actions": [
      {
        "description": "Agent A assists Agent B with meal preparation by slicing up some additional fruits.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table for breakfast, ensuring there are enough seats for all roommates.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a group stretch before eating to start the day with invigoration.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews a map of the hiking trail while eating breakfast.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small first-aid kit for the hike.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A secures the front door before sitting down for breakfast.",
        "values": [
          0.0,
          0.1,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts on sunscreen before the hike.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A switches to sturdy hiking boots.",
        "values": [
          0.0,
          0.2,
          0.6,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the weather forecast for the hike.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A returns from a morning run, hydrates, and joins roommates Agent B and Agent C in the kitchen where a breakfast preparation is underway. The environment is welcoming with open windows and gentle breezes.",
    "actions": [
      {
        "description": "Agent A decides to stretch out after the run to prevent muscle soreness.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a nutritious breakfast to replenish the body after exercising.",
        "values": [
          0.0,
          0.9,
          0.4,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent C with breakfast preparation, fostering teamwork.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent B about the book being read to connect on a personal level.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to clean up the running gear and neatly store it away.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to open more windows to invite more fresh air into the kitchen.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to participate in a light post-breakfast walk in the garden.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects a peppy, upbeat playlist on the speaker to energize the morning atmosphere.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A and his spouse, Agent B, enjoy a bright Saturday morning in their cozy suburban home. Agent A prepares a hearty breakfast, while Agent B goes for a jog. Their teenager, Agent C, joins them for breakfast, and they all gear up for a day filled with gardening, cycling, and family activities.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C for a cycling trip after the breakfast clean-up.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A browses a gardening book to select herbs and vegetables for the family to plant together.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously locks all the doors and windows before the family sets out for their outdoor activities.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings a first-aid kit along for the cycling trip, just in case anyone needs it.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a picnic, telling Agents B and C to prepare a basket of healthy snacks and refreshments.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to surprise Agent C by teaching them some basic car maintenance after noticing Agent C's interest in the family car.",
        "values": [
          0.0,
          -0.2,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a short warm-up session with Agent B and Agent C before they start their exercise to prevent injuries.",
        "values": [
          0.0,
          0.3,
          0.7,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to spend the evening with Agents B and C organizing a family board game night.",
        "values": [
          0.0,
          -0.3,
          0.2,
          1.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a fitness enthusiast, enters the bright and airy kitchen where their roommate Agent B is preparing breakfast and Agent C is reading. The neatly organized house and the presence of a well-stocked first-aid kit provide comfort and peace, suggesting plans for relaxation and maintenance of well-being after an active morning.",
    "actions": [
      {
        "description": "Agent A decides to join Agent B in cooking, helping to prepare a fruit salad for breakfast.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes an extended shower focusing on relaxation and muscle recovery.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A practices mindful breathing exercises while stretching on a yoga mat.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to invite fresh air into the home.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reorganizes a disordered cupboard to restore order.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reminisces about past runs with Agent B, sharing experiences.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks for new running routes online, planning future activities.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans their weekly meals, focusing on balanced nutrition.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a community outing with Agents B and C.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a teen girl with passion for culinary arts, is finishing up cooking pancakes in the kitchen, anchoring a communal weekend breakfast for the family. The father, Agent B, is enjoying his coffee and engaging with his tablet at the kitchen island, as Agent C, the younger brother, sets the dining table.",
    "actions": [
      {
        "description": "Agent A flips the pancakes skillfully, ensuring they cook evenly on both sides.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tastes a piece of pancake to ensure it is delicious before serving.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the flame on the stove to prevent any pancakes from burning.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a platter and arranges the finished pancakes decoratively.",
        "values": [
          0.0,
          0.3,
          -0.1,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up a spill of batter on the counter immediately to maintain cleanliness.",
        "values": [
          0.0,
          0.4,
          0.7,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the window to let in the morning breeze, which carries the scent of fresh pancakes throughout the house.",
        "values": [
          0.0,
          0.1,
          0.4,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to make a fruit salad as a refreshing side dish.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits down with her family to enjoy the meal she prepared.",
        "values": [
          0.0,
          -0.3,
          -0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector to confirm it's functioning, aware of the hazards of cooking.",
        "values": [
          0.0,
          -0.1,
          1.0,
          -0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Inside a tranquil home filled with morning light, Agent A wakes up to a day primed with possibility. Agent B is in the kitchen, cooking a nutrient-rich meal, while Agent C ensures a clean and secure environment. The elements of the day ahead entice Agent A to engage in activities beneficial to mind, body, and spirit.",
    "actions": [
      {
        "description": "Agent A stretches and completes a brief morning workout routine.",
        "values": [
          0.0,
          0.7,
          -0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C to water the indoor plants.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B and C for a communal breakfast.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family board game for enjoyment.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a morning jog around the neighborhood.",
        "values": [
          0.0,
          0.9,
          -0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meditates for mental clarity.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A restocks the household's first aid kit.",
        "values": [
          0.0,
          -0.4,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a creative hobby.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "After a morning jog, Agent A enters the kitchen where Agent B is cooking breakfast and Agent C is potting a new plant by the breakfast table.",
    "actions": [
      {
        "description": "Agent A crafts a protein shake.",
        "values": [
          0.0,
          0.8,
          -0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A dines with the family.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers gardening gloves to Agent C.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A airs the room further by opening more windows.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A imparts knowledge on wellbeing and balanced food.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a spontaneous, light group workout.",
        "values": [
          0.0,
          0.9,
          -0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A verifies the smoke detector’s functionality.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up around the kitchen area.",
        "values": [
          0.0,
          -0.3,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is tending to their indoor plants. Agent B is reading about organic cooking and occasionally watching Agent A. Agent C is working on a puzzle. Sunlight fills the room, and fresh air circulates from the plants.",
    "actions": [
      {
        "description": "Agent A reorganizes the plant arrangement for better sunlight exposure.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A undertakes a DIY project to construct an indoor greenhouse.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses collected rainwater to water the plants, checking soil moisture levels.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A quizzed Agent C with a game on plant species and care.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a healthy snack with their homegrown produce.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps with the puzzle after ensuring hands are clean.",
        "values": [
          0.0,
          -0.1,
          0.4,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B partake in a yoga session to stretch.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks for pests among the plants and removes them.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a teenager who has just returned home from school and dropped their backpack by the door. Their younger sibling, Agent B, is in the kitchen, preparing a fruit salad with various colorful fruits spread out on the countertop. Agent C, their parent, is inspecting the smoke detectors in the hallway, ensuring they are working properly. The house feels lively and warm, with soft music playing from a speaker in the living room.",
    "actions": [
      {
        "description": "Agent A washes their hands thoroughly before starting to help Agent B with the fruit salad.",
        "values": [
          0.0,
          0.4,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully cuts fruits to avoid any mishandling of the knife.",
        "values": [
          0.0,
          0.3,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to organize the salad into a fun pattern on the platter for visual enjoyment.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows to allow more natural light and fresh air into the house.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns the music up slightly, choosing a danceable playlist to enhance the home atmosphere.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a table for the fruit salad with a mindful layout to avoid any tripping hazards.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a light-hearted, impromptu dance with Agent B in the kitchen, laughing together.",
        "values": [
          0.0,
          0.7,
          0.3,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old photo album to share with Agent B, reminiscing on fun family memories.",
        "values": [
          0.0,
          0.3,
          0.6,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A hosts brunch at home with fresh food, while ensuring the space is well-lit and fresh air circulates. Agent B relaxes on the sofa, while Agent C admires the outside view.",
    "actions": [
      {
        "description": "Agent A prepares a refreshing plate of fruits and water for Agent B.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to fill the room with natural light and air.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A performs a series of yoga poses to rejuvenate.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures smoke detectors are in working order.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns off cooking appliances post-use.",
        "values": [
          0.0,
          -0.4,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a light-hearted game with friends.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares a funny personal story.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk with friends in the neighborhood.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a young adult, finishes a day of work at home and joins Agent B in the kitchen, who is making a smoothie. Agent C, their cousin, watches a nature documentary in the living room. Agent A invites everyone to enjoy their drinks on the balcony and engages in enjoyable activities while ensuring a secure environment.",
    "actions": [
      {
        "description": "Agent A joins Agent B in preparing the smoothie.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking drinks to the balcony to enjoy the fresh air.",
        "values": [
          0.0,
          -0.2,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C for fresh air on the balcony.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings out cards for a game on the balcony.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks the front door for security.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a future park outing.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks kitchen appliances are off.",
        "values": [
          0.0,
          -0.2,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a workout session on the balcony.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a nature documentary movie night.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A arrives home after completing a half-marathon, feeling accomplished. Agent B, their partner, is reading on the couch. The living room offers a tranquil environment with fresh air and sunlight. Nutritious food ingredients await in the kitchen for a post-race meal.",
    "actions": [
      {
        "description": "Agent A decides to cook a gourmet, nutritious meal for recovery.",
        "values": [
          0.0,
          0.9,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to demonstrate stretching exercises to Agent B.",
        "values": [
          0.0,
          0.5,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans to share their race experience with Agent B.",
        "values": [
          0.0,
          0.2,
          -0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A considers preparing a hot bath with Epsom salts.",
        "values": [
          0.0,
          -0.4,
          0.7,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A thinks about organizing their gear.",
        "values": [
          0.0,
          -0.3,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A contemplates setting an early bedtime for ample rest.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A aims to open windows for more natural air.",
        "values": [
          0.0,
          -0.2,
          0.6,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to call a friend to celebrate their race achievements.",
        "values": [
          0.0,
          -0.5,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a brief walk outside with Agent B to enjoy the sunset.",
        "values": [
          0.0,
          0.3,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "In the cozy living room of a suburban home, Agent A, a passionate amateur chef, arranges ingredients on the kitchen counter, while Agent B browses recipes, and Agent C relaxes on a sofa.",
    "actions": [
      {
        "description": "Agent A confidently selects a recipe.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a meticulous check.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to create a playlist.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully organizes the workflow.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes starting the evening with a homemade cocktail.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the initiative to teach Agent B.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a group photo.",
        "values": [
          0.0,
          -0.3,
          0.1,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans and disinfects the kitchen surfaces.",
        "values": [
          0.0,
          0.2,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A integrates a small, impromptu game.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a teenager engrossed in a home-based fitness challenge with Agent B, his younger brother. In the well-ventilated family garage turned gym, they prepare for a workout; Agent A proposes a new routine, and Agent C, their mother, reminds them of warmth and offers fruits and hydration.",
    "actions": [
      {
        "description": "Agent A leads a warm-up session that prepares them for intensive physical activity.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A demonstrates a new workout routine for Agent B to follow, while ensuring proper form.",
        "values": [
          0.0,
          0.8,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a sip of water after a set of exercises.",
        "values": [
          0.0,
          0.9,
          0.4,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks their progress on the whiteboard and updates it with the new routine.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers encouragement and feedback to Agent B.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A slices additional fruit during the break.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens another window for increased airflow.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to play uplifting music.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a teenager, is in the kitchen preparing a meal while her siblings, Agent B and Agent C, work on homework at the dining table. The kitchen is well-equipped, and there's a homely atmosphere with the aroma of cooking. Agent B and Agent C participate in meal preparation by setting the table and show appreciation for Agent A's efforts.",
    "actions": [
      {
        "description": "Agent A finishes cooking and serves the meal onto plates.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the kitchen, cleaning up spills and washing the dishes.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads an after-dinner walk with her siblings.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reminds siblings to put on their reflective vests.",
        "values": [
          0.0,
          -0.1,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about their day during the walk.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks that all the doors are locked before bedtime.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans for the next day's meal with a new recipe.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets an earlier bedtime for herself.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reflects on the day's events in her journal.",
        "values": [
          0.0,
          -0.4,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a high school athlete, is seated at the kitchen table on a bright Saturday morning, while Agent B is preparing breakfast, and Agent C exercises in the next room. Fresh air fills the home, suggesting a serene yet active morning.",
    "actions": [
      {
        "description": "Agent A helps prepare breakfast by cutting fruit and making juice.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a walk in the backyard for fresh air and movement.",
        "values": [
          0.0,
          0.5,
          -0.1,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously sets up the dining area for breakfast.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows for more fresh morning air.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Suggests a board game with Agent B after breakfast.",
        "values": [
          0.0,
          -0.2,
          -0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Cleans the kitchen to maintain order.",
        "values": [
          0.0,
          -0.3,
          0.4,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Proposes a family exercise session post-breakfast.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Creates a weekly schedule for school and sports.",
        "values": [
          0.0,
          -0.2,
          0.5,
          -0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A has just returned home from school and dropped off his backpack in his bedroom. The room feels stuffy, so he opens a window. Agent B is cooking in the kitchen while Agent C is stretching after a run.",
    "actions": [
      {
        "description": "Agent A opens a window in his bedroom to let in fresh air.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C for a light workout.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B prepare dinner.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a quick shower before dinner.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A selects a board game for family activity after dinner.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches a new recipe online for future meals.",
        "values": [
          0.0,
          -0.1,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes his school work and room.",
        "values": [
          0.0,
          -0.3,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tends to the herb garden.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a 20-minute nap before studying.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is preparing a hearty brunch, Agent B is at the dining table, and Agent C is upstairs. Agent A creates a welcoming environment with food and a fresh breeze.",
    "actions": [
      {
        "description": "Agent A carefully flips the pancakes on the griddle",
        "values": [
          0.0,
          0.2,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the fridge and decides to make a quick run to the store",
        "values": [
          0.0,
          -0.4,
          0.2,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B if they need anything from the store",
        "values": [
          0.0,
          0.0,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table with care",
        "values": [
          0.0,
          0.1,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to open more windows in the dining area",
        "values": [
          0.0,
          0.1,
          0.3,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to stretch his legs",
        "values": [
          0.0,
          0.6,
          0.1,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A delegates setting brunch on the table to Agent C",
        "values": [
          0.0,
          -0.2,
          0.4,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays some soft music to set a pleasant ambiance",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A showcases their new home to friends Agent B and Agent C, focusing on security features and well-being-oriented lifestyle with fresh food, an exercise area, and a ready-to-use bike. They plan to spend the day ensuring comfort and enjoyment.",
    "actions": [
      {
        "description": "Agent A prepares a fresh, nutritious meal",
        "values": [
          0.0,
          0.9,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a light workout session",
        "values": [
          0.0,
          0.7,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A demonstrates the security system",
        "values": [
          0.0,
          0.2,
          0.9,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a meditation session",
        "values": [
          0.0,
          -0.2,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a bike ride activity",
        "values": [
          0.0,
          0.8,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites guests to enjoy a smoothie",
        "values": [
          0.0,
          0.6,
          -0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the house security before outing",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a casual movie night",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A includes friends in meal prep",
        "values": [
          0.0,
          0.3,
          -0.1,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a high school basketball player lounging in the family room during a weekend morning. Sunlight streams through the open windows as Agent A casually enjoys their time. Agent B is preparing breakfast. Agent C is setting up board games on the coffee table.",
    "actions": [
      {
        "description": "Agent A helps set up the table for breakfast.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C to log their sleep hours.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a warm-up routine before breakfast.",
        "values": [
          0.0,
          0.8,
          -0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proofreads their homework at the kitchen table.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads the family in a game of charades.",
        "values": [
          0.0,
          0.3,
          -0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the home first aid kit.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tunes up the bicycle.",
        "values": [
          0.0,
          0.5,
          0.7,
          -0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A mediates a playful dispute fairly.",
        "values": [
          0.0,
          -0.3,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens all windows to let in fresh air.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A stretches and glances at a bicycle, planning to cycle with Agent B later. Agent B is studying and Agent C is cooking. The home atmosphere is tranquil with soft music playing.",
    "actions": [
      {
        "description": "Agent A makes a refreshing drink for everyone.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B for a walk.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps set the dining table.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the first aid kit.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up the living room.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A works on a puzzle.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a cycling route.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in light exercise.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reminds Agent B to drink water.",
        "values": [
          0.0,
          0.4,
          0.4,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is in the kitchen with Agent B and C, preparing a family meal on a weekend.",
    "actions": [
      {
        "description": "Agent A adjusts the heat on the stove to avoid overcooking the meal.",
        "values": [
          0.0,
          0.3,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A walks over to C to show them the proper way to set a knife on the table.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the fridge to ensure there are enough ingredients for the meal and a balanced variety.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to hydrate themselves with a glass of water.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector to confirm it's working, given they are cooking.",
        "values": [
          0.0,
          -0.1,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A engages in light exercises by doing stretches in the kitchen while waiting for food to cook.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to involve B and C in a game of guessing spices by scent to make cooking fun.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group cleanup after the meal, emphasizing teamwork.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a walk after the meal to enjoy the good weather.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a teenager, is in the living room with Agent B, who is casually working on a puzzle, and Agent C, who is reading a gardening magazine. The environment is comfortable and inviting, with fresh air and the possibility of snacks.",
    "actions": [
      {
        "description": "Agent A decides to join Agent B in assembling the puzzle.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A walks to the kitchen to prepare a healthy snack for everyone.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent C about their shared interest in gardening.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stretches and does some light exercises to reenergize.",
        "values": [
          0.0,
          0.7,
          -0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a short walk for a change of scenery and fresh air.",
        "values": [
          0.0,
          0.5,
          -0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small game night to enjoy after dinner.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors to ensure functionality.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to read out loud from Agent C's magazine.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A insists on preparing a nutritious meal for dinner.",
        "values": [
          0.0,
          0.9,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a sophomore college student home for the weekend in the family's suburban house. On a Saturday morning, Agent A studies in the kitchen with light streaming through the windows, while Agent B tends the garden and Agent C plays video games in the living room.",
    "actions": [
      {
        "description": "Agent A stands up from studying, stretches, and decides to prepare a nutritious breakfast.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to take a 20-minute break from studying to go for a brisk walk around the neighborhood.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully locks the back door after stepping out for the walk, ensuring the house remains secure.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C for a quick game of basketball in the driveway to get a bit of exercise.",
        "values": [
          0.0,
          -0.3,
          -0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a small workstation in the garden to study while enjoying the fresh air and company of Agent B.",
        "values": [
          0.0,
          -0.1,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gathers the family in the evening to watch a favorite movie together, providing relaxation after the day’s tasks.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small meal prep session in the kitchen, making plans for healthy lunches over the next few days.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A focuses on getting to bed at a reasonable hour to be well-rested for studying the following day.",
        "values": [
          0.0,
          0.8,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A participates in a yoga session with Agent B for a more relaxed start to the morning.",
        "values": [
          0.0,
          -0.4,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a lively teenager with an affinity for sports and outdoor activities. On a bright Saturday morning, Agent A is seen lacing up running shoes in a warmly lit kitchen, while Agent B, Agent A’s parent, is preparing a nutrient-rich breakfast of eggs and whole-grain toast. Agent C, Agent A's sibling, is meticulously organizing a corner of the living room into a restful study area, with ample daylight streaming through the open windows.",
    "actions": [
      {
        "description": "Agent A sets out for a morning jog around the neighborhood.",
        "values": [
          0.0,
          0.9,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A returns from the jog and immediately hydrates with a bottle of water from the kitchen.",
        "values": [
          0.0,
          1.0,
          0.5,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join in on stretching exercises in the garden.",
        "values": [
          0.0,
          0.8,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the first aid kit to replenish any items used after a minor scrape sustained during exercise.",
        "values": [
          0.0,
          -0.2,
          1.0,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B set the breakfast table, ensuring hot dishes are placed on protective mats to prevent surface damage.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a longer than usual shower, embracing a moment of relaxation and rejuvenation after the run.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opts to take a nap in the well-ventilated and peaceful living room.",
        "values": [
          0.0,
          0.4,
          0.7,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A spends time organizing the sports equipment in the garage, ensuring everything is in good condition and easily accessible.",
        "values": [
          0.0,
          0.5,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a college student, is in her studio apartment kitchen preparing a meal. Agent B, a childhood friend visiting from out of town, lounges on the sofa with a book in hand. Agent C, Agent A's cousin, is at the dining table setting up a new board game.",
    "actions": [
      {
        "description": "Agent A carefully tests the meal's flavor, adding spices as needed.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B collaborate to set the dining table with care.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the window for ventilation while cooking.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews a first-aid kit she keeps in the kitchen.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A turns down the music volume for a serene atmosphere.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A slices extra vegetables to store for future meals.",
        "values": [
          0.0,
          0.4,
          0.3,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "After cooking, Agent A cools down by stretching and doing light exercises.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stores the sharp kitchen tools properly after use.",
        "values": [
          0.0,
          -0.3,
          0.8,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a toast to celebrate their reunion.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "In a cozy, sunlit kitchen, Agent A is preparing a nutritious meal with vegetables and home-grown herbs, while Agent B works on homework at the kitchen table and Agent C contributes fresh herbs from the garden. The arrangement signals preparation for a family dinner with an emphasis on well-being and contentment.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to help with dinner.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places sharp utensils out of reach.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to use a stool.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A extinguishes the stove and oven.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A locks the doors and sets security.",
        "values": [
          0.0,
          -0.2,
          1.0,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a walk after dinner.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A separates recyclables from trash.",
        "values": [
          0.0,
          -0.3,
          0.3,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A moderates personal servings.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B and Agent C.",
        "values": [
          0.0,
          -0.1,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "In a suburban home, Agent A is preparing a nutritious meal in the kitchen, Agent B is reading on the sofa, and Agent C sets up an indoor workout area. The environment is tranquil with tasks being performed in harmonious balance.",
    "actions": [
      {
        "description": "Agent A tastes the dish they are preparing.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fills and sips from a glass of water.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up the kitchen.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join the meal.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stretches with Agent C.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays upbeat music.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A writes down future workout goals.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures kitchen appliances are off.",
        "values": [
          0.0,
          -0.3,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A packs a meal for a friend.",
        "values": [
          0.0,
          -0.4,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "In a spacious, sunlit kitchen, Agent A, a fitness enthusiast in their early thirties, is preparing a homemade, nutrient-rich green smoothie. Agent B, a sibling who enjoys yoga and meditation, is rolling out a mat in the adjacent living room, ready for an online guided session. Agent C, a cousin visiting for the weekend, is sorting through a shelf of board games, looking for an engaging way to spend the afternoon. There is a palpable sense of warmth and comfort in the home, as well as an undercurrent of anticipation for a healthy, enjoyable day ahead.",
    "actions": [
      {
        "description": "Agent A decides to make extra smoothie to share with Agent B and Agent C.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to join in a team cooking session to prepare a nutritious dinner for everyone.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A goes on a quick run to the local market to replenish fresh produce for the household.",
        "values": [
          0.0,
          0.6,
          0.1,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a brief session on the benefits of mindful eating and demonstrates this during a shared meal.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a DIY home theater for a movie night, ensuring all electrical cords are neatly tucked away.",
        "values": [
          0.0,
          -0.4,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests an early night for the household to ensure a full night's rest before their planned hiking trip the next day.",
        "values": [
          0.0,
          0.5,
          0.2,
          -0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A returns home to find Agent B practicing dance and Agent C building a puzzle in the sunlit living room. They prepare dinner, ensuring to serve a nutritious meal, and they foster a sense of contentment through shared activities and a secure environment.",
    "actions": [
      {
        "description": "Agent A turns on some music that Agent B loves.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares and serves a well-balanced meal for the children.",
        "values": [
          0.0,
          0.9,
          0.5,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B to learn a few dance steps, laughing together.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a movie night with a favorite family film.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to stretch and do some light exercises.",
        "values": [
          0.0,
          0.4,
          -0.2,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family board game session after clearing the dinner table.",
        "values": [
          0.0,
          -0.3,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads a bedtime story to Agent C before tucking them into bed.",
        "values": [
          0.0,
          -0.5,
          0.8,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures that the front and back doors are locked before heading to bed.",
        "values": [
          0.0,
          -0.2,
          1.0,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to join Agent C to add a few puzzle pieces together.",
        "values": [
          0.0,
          -0.4,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a teenage girl, returns home on a cold afternoon to find her brother, Agent B, reading. She ensures the house is warm and secure, and then engages in comfortably preparing a meal, interacting with her brother, and enjoying the evening indoors.",
    "actions": [
      {
        "description": "Agent A prepares a warm, nutritious meal for herself and her brother.",
        "values": [
          0.0,
          0.8,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to spend some time with Agent B by asking about the book he’s reading.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to lock the front and back doors of the house.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "As it gets darker, Agent A turns on more lights in the house to maintain good visibility.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to sit by the fireplace, working on her homework while enjoying the warmth.",
        "values": [
          0.0,
          0.5,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gathers blankets and cushions to make sure she and her brother are comfortable on the couch.",
        "values": [
          0.0,
          -0.2,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "After homework, Agent A decides to watch a movie with Agent B, selecting one they both love.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks for any unattended electrical appliances that might have been left running.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "To unwind before bed, Agent A practices some light stretching or yoga.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a young adult, enters the house they share with Agent B, who is cooking, and finds Agent C lounging and Agent D tidying up. The environment is inviting with the smells of cooking and sounds of jazz music. Agent A heads to change out of work clothes.",
    "actions": [
      {
        "description": "Changes into athletic gear for a jog.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Helps set the table for a communal dining experience.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Suggests group yoga after dinner.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Prepares a nutritious smoothie.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Chooses to read a new book for leisure.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Proposes a fun cleaning day for the household.",
        "values": [
          0.0,
          0.4,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Replaces the battery in a smoke detector.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Prepares for the next day to minimize morning stress.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Takes a leisurely warm shower.",
        "values": [
          0.0,
          -0.2,
          0.0,
          1.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a young adult, has just returned home from work to find housemates Agent B and Agent C already there. Agent B is setting the dinner table, and Agent C lounges with a book amidst a puzzle. The house feels calm, organized and ready for a quiet, enjoyable evening.",
    "actions": [
      {
        "description": "Agent A decides to help Agent B finish preparing the meal by cutting vegetables to add to the pot.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing some soft background music to enhance the dining ambiance.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the initiative to set up an air purifier in the living room to ensure a comfortable environment.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to engage in a stretching routine while waiting for dinner to encourage relaxation.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to complete the jigsaw puzzle while conversing with Agent C to foster a collaborative mood.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans to lead a cleanup after dinner to maintain the cleanliness and order of the communal space.",
        "values": [
          0.0,
          -0.4,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about how everyone's day went, deepening communal bonds while they dine.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A proposes a walk outside to get some fresh air and stretch their legs.",
        "values": [
          0.0,
          0.8,
          -0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to check that the front door is locked, ensuring a secure environment before bedtime.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a college student, returns home and joins her family. She is greeted by the comforting activities of her parents in a warm, familiar environment.",
    "actions": [
      {
        "description": "Agent A helps Agent B by chopping vegetables.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses leftovers to prevent waste.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks smoke detectors for functionality.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites parents for board game.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fixes a wobbly chair to prevent accidents.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family movie night.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes and declutters shared spaces.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a family outing.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests organizing family photos into an album.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "In a warm kitchen at sunset, Agent A prepares dinner humming contentedly, Agent B sets the table attentively, and Agent C shows fleeting interest from their book to the kitchen.",
    "actions": [
      {
        "description": "Agent A encourages Agent C to join in the cooking, teaching them how to knead the dough for bread.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the kitchen windows to let in the crisp evening breeze while they cook.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "After the preparations, Agent A proposes a quick walk outside before everyone sits down for dinner.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors in the home as they move around the kitchen.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to savor a well-prepared dish they are particularly proud of.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans spilled water immediately to prevent any mishaps.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a collaborative game of charades after dinner to entertain the family.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places a vase of fresh flowers on the table, smiling at their addition to the ambiance.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to do some light stretching in the living room to unwind after the bustling kitchen activity.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "In a sunlit living room, Agent A puts on sneakers indicating readiness for the Family Fun Run Training Program, as Agent B shows mild reluctance and Agent C shows enthusiasm for joining the upcoming group activity. Agent A checks the clock and points to the training chart.",
    "actions": [
      {
        "description": "Agent A laces their sneakers firmly, ensuring readiness for the run.",
        "values": [
          0.0,
          0.5,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A inspects everyone's footwear for suitability.",
        "values": [
          0.0,
          0.2,
          1.0,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fills water bottles for hydration during the run.",
        "values": [
          0.0,
          0.7,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a light stretching session to prevent injury.",
        "values": [
          0.0,
          0.4,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets a considerate pace for the family's varying fitness levels.",
        "values": [
          0.0,
          -0.3,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a group selfie for a shared memory.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a game of tag for fun during the run.",
        "values": [
          0.0,
          0.6,
          -0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A designates a break for snacks and rest mid-run.",
        "values": [
          0.0,
          0.3,
          0.7,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A listens to Agent B's book insights, encouraging intellectual engagement.",
        "values": [
          0.0,
          -0.5,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A observes their children, Agent B and Agent C, as they engage in quiet activities at home. A batch of muffins bakes in the oven, spreading a comforting aroma, while Agent A sits with a herbal tea and a first aid booklet.",
    "actions": [
      {
        "description": "Offer assistance with a puzzle, stimulating cognitive activity.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Discuss the picture book to encourage family bonding.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Increase airflow by opening windows in the house.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Conduct a light stretching routine for physical engagement.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Schedule a walk to the park for fresh air and exercise.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Plan a board game for entertainment and family togetherness.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Ensure the first aid kit is well-stocked and within reach.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Serve the muffins with a glass of water or milk for nourishment.",
        "values": [
          0.0,
          0.7,
          0.6,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a health-conscious parent who has just finished their daily home workout in the living room. Agent B, their partner, is cooking a nutritious dinner and Agent C, their child, is setting the dining table. The windows are open, letting in fresh air and neighborhood sounds.",
    "actions": [
      {
        "description": "Agent A decides to make homemade fruit smoothies for the family to enjoy before dinner.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays soothing music on the speaker to enhance the dinner atmosphere.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A introduces a new dining rule where all electronic devices are put away to ensure undisturbed family time.",
        "values": [
          0.0,
          -0.1,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a lively dinner conversation to engage the family.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a walk in the park after dinner for some light exercise and family bonding.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the locks on the doors and windows before the family settles for the evening.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans a small indoor herb garden project to improve the quality of the air and add fresh flavors to meals.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A arrives home greeted by a cooked meal and a well-prepared dining environment by their partner, Agent B, and teenage sibling, Agent C. Agent A engages warmly with their family members and pitches in with household activities.",
    "actions": [
      {
        "description": "Agent A washes their hands thoroughly before eating.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a board game post-dinner.",
        "values": [
          0.0,
          -0.2,
          0.3,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reminds Agent C to finish homework.",
        "values": [
          0.0,
          -0.1,
          0.4,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes on the task of dishwashing.",
        "values": [
          0.0,
          -0.4,
          0.2,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows for ventilation.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously organizes kitchenware.",
        "values": [
          0.0,
          -0.3,
          0.7,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures all appliances are off post-dinner.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A enjoys a post-dinner walk with Agent B.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews their budget for financial stability.",
        "values": [
          0.0,
          0.1,
          0.8,
          -0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "In the cosy, sunlit kitchen of a suburban home, Agent A, a chef, prepares a hearty breakfast. Agent B, a teenager, lounges on a bar stool, and Agent C, a child, finishes a drawing at the kitchen table. Agent A plates a colorful spread on the dining table, while the smell of fresh coffee and baked bread fills the air, and morning birdsong drifts in from an open window.",
    "actions": [
      {
        "description": "Agent A prepares a balanced meal using fresh vegetables from the garden.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A installs smoke detectors and checks the fire extinguisher in the kitchen.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays cheerful music to create a pleasant dining atmosphere.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a spontaneous family game after breakfast.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes the family dog for a brisk walk around the neighborhood.",
        "values": [
          0.0,
          0.5,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sits with Agent C to praise and discuss the child’s artwork.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B for a brief discussion about the articles in the magazine.",
        "values": [
          0.0,
          -0.1,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to meditate and breathe deeply in the peaceful morning setting.",
        "values": [
          0.0,
          -0.5,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a weekend getaway to a local cabin in the woods.",
        "values": [
          0.0,
          -0.4,
          0.8,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a health-conscious individual who has just returned home from an evening walk. Inside, Agent B is preparing a colorful vegetable stir-fry, and the smell of dinner distracts Agent C from homework. Agent A engages with both B and C in a positive, relaxed household atmosphere.",
    "actions": [
      {
        "description": "Agent A helps Agent B by chopping vegetables.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table, including fresh flowers.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A converses with Agent C about their day.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows for fresh air.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family board game.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent B a supportive hug.",
        "values": [
          0.0,
          0.1,
          0.6,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with homework.",
        "values": [
          0.0,
          -0.2,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen.",
        "values": [
          0.0,
          -0.3,
          0.7,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gets a blanket for Agent C.",
        "values": [
          0.0,
          0.1,
          0.6,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, with her twin children, Agent B and Agent C, engages in a home exercise session that includes yoga, a meditation session, followed by a picnic in the garden.",
    "actions": [
      {
        "description": "Agent A prepares a balanced home-cooked meal for lunch.",
        "values": [
          0.0,
          1.0,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads her children through meditation after yoga.",
        "values": [
          0.0,
          0.3,
          0.6,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A applies sunscreen before the outdoor picnic.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the home security system before starting their activities.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages her children to share their thoughts and feelings during the picnic.",
        "values": [
          0.0,
          -0.2,
          0.4,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a nap with the children after lunch.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a garden treasure hunt for mental and physical engagement.",
        "values": [
          0.0,
          0.8,
          0.5,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is a young adult who has just finished a long day of remote work at home. He is in the kitchen with Agent B, his roommate, who is also winding down from her day. The kitchen is warm and filled with the aromas of cooking, as both have decided to cook dinner together. Agent C, a neighbor and close friend, has been invited over to join them and is setting the table. The room is lively with the sounds of sizzling and laughter, the evening light casting a cozy glow over the scene.",
    "actions": [
      {
        "description": "Agent A decides to prepare a nutritious meal with plenty of vegetables and lean proteins.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes sure to grab a pot holder before handling the hot pan to avoid burns.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A initiates a game night to enjoy some laughter and fun.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a toast expressing gratitude for the company and the meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "After eating, Agent A insists on doing the dishes to give Agent B some rest.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a group walk after dinner for some light exercise and fresh air.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to prepare a cup of herbal tea for everyone to unwind before bed.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to check that the front door is locked for the night.",
        "values": [
          0.0,
          -0.2,
          1.0,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A plans to go to bed at a reasonable hour to ensure adequate rest.",
        "values": [
          0.0,
          0.7,
          0.6,
          0.5,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a 30-year-old marathon runner, is in her kitchen preparing a nutritious post-run meal. The kitchen is spacious and sunlit, with fresh herbs growing on the windowsill and a well-stocked fruit bowl on the counter. Agents B and C, her teenage children, are at the table. Agent B is doing homework, while Agent C is planning their school's environmental club agenda. A gentle breeze wafts in from the open window, mixing the scent of the outdoors with the aroma of cooking.",
    "actions": [
      {
        "description": "Agent A turns on her favorite upbeat playlist to energize the atmosphere of the kitchen.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts chopping a variety of colorful vegetables for a salad, engaging her children in conversation about their day.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small indoor exercise break for everyone to stretch and take a break from sitting.",
        "values": [
          0.0,
          0.6,
          -0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules the next family fire drill to practice emergency procedures.",
        "values": [
          0.0,
          -0.3,
          1.0,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks her home first aid kit to ensure everything is up to date and replenishes it as needed.",
        "values": [
          0.0,
          -0.1,
          0.9,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the house locks and security system before going to bed.",
        "values": [
          0.0,
          -0.2,
          0.8,
          -0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A places nightlights in the hallway to prevent tripping in the dark.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A researches wholesome recipes for the family’s dinner for the next week.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads her children in a laughter yoga session to relieve stress.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is preparing a communal breakfast in the kitchen. Agent B is stretching in the living room, and Agent C gets drawn to the kitchen by the activities and breakfast aroma.",
    "actions": [
      {
        "description": "Agent A carefully chops an assortment of fresh vegetables for an omelet.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table with care, including placing a pitcher of water with lemon slices for everyone.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tests the smoke detector in the kitchen while waiting for a pot to boil.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to help finish cooking to make it a collaborative effort.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent B and Agent C about their plans for the day.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a quick group exercise session after breakfast to energize for the day.",
        "values": [
          0.0,
          0.9,
          0.3,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to make a large batch of food to ensure leftovers for anyone who might need a meal later in the day.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes time to ensure the food is cooked to everyone's liking, accommodating any dietary restrictions.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up spills immediately during cooking to prevent any slipping accidents.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is in the kitchen on a weekend morning, preparing a nutritious breakfast. Agent B is watching a documentary, and Agent C is gardening outside.",
    "actions": [
      {
        "description": "Agent A starts preparing a well-balanced breakfast.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets the dining table with care.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a board game session.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to tackle a puzzle.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a personal workout routine.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A fixes a loose railing on the porch.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A learns plant care with Agent C.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A crafts a handmade card.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a health-conscious mother, is preparing a balanced evening meal for her family in the kitchen of their cozy suburban home. Agent B, her teenage son, enters the kitchen after finishing his homework. Agent C, the father, is in the living room doing stretches after his run. The family enjoys the routine of dinner time bathed in the aroma of healthy food and soft background music.",
    "actions": [
      {
        "description": "Agent A slices vegetables for a nutrient-rich salad.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A stirs the homemade soup to ensure it does not stick to the bottom of the pot.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the locks on the doors before the family retires for the night.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family game night after dinner.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the next day’s agenda with her family, ensuring all are prepared.",
        "values": [
          0.0,
          -0.2,
          0.5,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A lights some candles to create a calm and relaxing ambiance while dining.",
        "values": [
          0.0,
          -0.3,
          -0.2,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a moment of gratitude before the meal, where each family member shares something they are grateful for.",
        "values": [
          0.0,
          -0.1,
          0.1,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reads a book to her son before his bedtime, a chapter from a novel they are both enjoying.",
        "values": [
          0.0,
          -0.2,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A, a passionate home chef, is preparing for a family dinner. Agent B is reading on the couch, and Agent C is sorting laundry.",
    "actions": [
      {
        "description": "Carefully chops up vegetables for soup, considering the nutritional value.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Sets the table and places a new bouquet of flowers in the center.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Turns on a playlist of cooking tunes to fill the kitchen with music.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Checks the first-aid kit to make sure it's fully stocked.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Teaches Agent C the correct way to sort laundry to prevent accidents.",
        "values": [
          0.0,
          0.3,
          0.7,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Samples the soup, adjusting seasoning to perfection.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Engages in light-hearted banter with Agent B.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Takes a moment to step outside for fresh air.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Sets out board games for after-dinner fun.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is preparing a meal in the kitchen, Agent B is reading in the living room, and Agent C is doing homework. The ambiance is one of a comfortable home environment with an emphasis on wellbeing, readiness, and the upcoming shared dining experience.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to participate in the cooking process, making the dinner preparation a shared experience.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game to guess the spices and ingredients in the meal, making dinner interactive.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the cooking and dining area before and after meal prep, ensuring cleanliness.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk for some light exercise after dinner.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a fire drill after dinner, emphasizing preparedness.",
        "values": [
          0.0,
          -0.4,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family movie night, picking a favorite film.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a storytelling session during dinner, enhancing bonding.",
        "values": [
          0.0,
          0.2,
          0.1,
          1.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A repairs a loose floorboard to prevent any mishaps.",
        "values": [
          0.0,
          -0.3,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A bakes extra cookies for the neighbor, nurturing community relations.",
        "values": [
          0.0,
          -0.1,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness"
    ],
    "scenario": "Agent A is in a kitchen preparing a new recipe while Agent B sorts mail at the table and Agent C does homework with interest in the cooking process. The environment is well-kept and pleasant.",
    "actions": [
      {
        "description": "Agent A carefully pulls out the dish from the oven, using oven mitts.",
        "values": [
          0.0,
          0.5,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help garnish the dish.",
        "values": [
          0.0,
          -0.5,
          0.3,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens all windows for better fresh air circulation.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the dining area beautifully.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector batteries.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a surprise dessert for Agent B.",
        "values": [
          0.0,
          -0.4,
          0.2,
          0.9,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A tastes and adjusts the seasoning of the dish.",
        "values": [
          0.0,
          0.1,
          0.5,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes a nutritious smoothie.",
        "values": [
          0.0,
          0.8,
          0.6,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A practices good hygiene while cooking.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  }
]