[
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A prepares a homemade dinner, Agent B selects music, and Agent C arranges the ambient lighting, setting a stage for a cozy and engaging evening among friends.",
    "actions": [
      {
        "description": "Agent A brings out an old photo album to reminisce about past shared experiences.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a spontaneous dance-off in the living room.",
        "values": [
          0.0,
          0.8,
          0.0,
          1.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A decides to mix a signature cocktail for everyone.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers a warm throw blanket to Agent B who is chilly.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A enthusiastically suggests a post-dinner walk.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to play a board game that promotes teamwork.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to share a new song they composed.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A collaborates on finishing the surprise dessert.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes a group selfie with everyone to capture the moment.",
        "values": [
          0.0,
          0.2,
          0.0,
          1.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is organizing a small celebration for Agent B's recent personal achievement. The living room is decorated with colorful banners, balloons, and a table set with a variety of healthy homemade snacks and fresh drinks. A lively playlist is ready to be played. Agent B and Agent C, close friends of Agent A who share similar interests, are invited to the occasion. The setting is informal and cozy, with warm lighting and comfortable seating arranged to encourage engagement and mutual enjoyment.",
    "actions": [
      {
        "description": "Agent A encourages Agent B to share stories about their road to achievement.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A toasts to Agent B's success with fresh juice.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to let in fresh air and create a pleasant atmosphere.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A leads a group activity or game that involves all the guests.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites guests to participate in preparing a special dish together in the kitchen.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A offers a brief moment of relaxation and guided group breathing exercises.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A personally thanks each guest for coming, showing appreciation for their presence.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A orchestrates a group photo to commemorate the gathering.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home on a Sunday afternoon, Agent A, a parent, prepares a homemade meal in the kitchen. Agent B, their spouse, is setting the dining table, and Agent C, their child, plays with a puzzle. There's warmth, a pleasant atmosphere, and an open door allowing fresh air in.",
    "actions": [
      {
        "description": "Agent A calls Agent C over to help with a simple task in the kitchen, like stirring the salad dressing.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to taste-test the sauce for the main dish, asking for their opinions.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside a special portion of the meal for Agent B, remembering their preference for less spice.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests putting on some light music to enhance the dining experience for everyone.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a toast to celebrate a small family achievement before eating.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A leads a fun cleanup game post-meal, trying to involve Agents B and C to make it entertaining.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a short walk after dinner to enjoy the sunset as a family.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes an impromptu photo session with everyone in the kitchen, capturing the moment.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to share stories about their week during dinner to foster conversation.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is hosting a dinner for close friends Agent B and cousin Agent C, filled with delightful aromas and cheerful table settings, anticipating an evening of shared meal, laughter, and reminiscence in a warm dining environment.",
    "actions": [
      {
        "description": "Agent A initiates a toast to celebrate their gathering, inviting everyone to raise their glasses.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A serves the homemade stew to Agent B and Agent C first before serving themselves.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes playing a favorite group board game after dinner.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shares personal stories and listens attentively to Agent B and Agent C's experiences during dinner.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a group picture to capture the joyous moment.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A leads a collaborative kitchen clean-up with Agent B and Agent C after the meal, turning it into a fun activity.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent B and Agent C a small parting gift, a batch of homemade cookies, at the end of the night.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A accompanies Agent C outside for a brief walk while they wait for their ride home.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A plays their favorite music in the background to enhance the dining atmosphere.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a lively kitchen, Agent A is proactively assembling a brunch while basking in the camaraderie and conversation of Agent B and Agent C.",
    "actions": [
      {
        "description": "Agent A artfully arranges the dish they've prepared and invites Agent B and Agent C to taste it.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a spontaneous game of charades after brunch.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent B and Agent C about planning a family hike for the next weekend.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B on the smoothies, lifting their mood.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares a funny childhood memory with Agent B and Agent C, deepening their bond.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to let Agent C add a personal touch to the brunch table setting.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.5,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers to teach Agent B how to make the dish next time.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to join a fun workout session later in the day.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes writing a heartfelt note to their grandparents, reminiscing over shared meals.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, enters a household bustling with the activity of a family preparing for dinner. Home-cooked meal aromas and a refreshing breeze fill the home, setting the stage for a nurturing and engaging evening.",
    "actions": [
      {
        "description": "Agent A embraces Agent B in gratitude for the meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C by bringing utensils to the table.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to change the music to something more upbeat to set a lively dinner atmosphere.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plays a trivia game with Agent D to help with homework while waiting for dinner.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A opens the window further to allow more fresh air into the dining room.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.4,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes initiative to pour water for everyone at the table.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B's cooking after trying the first bite.",
        "values": [
          0.0,
          0.1,
          0.0,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A asks everyone to share the highlight of their day.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the dishes after dinner, offering to wash them.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.3,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is planning a wholesome Sunday brunch for the family. The kitchen is lively, with preparations for a nutritious meal. Agent B is returning from a run, and Agent C is setting up the dining area with music.",
    "actions": [
      {
        "description": "Agent A blends a variety of fresh fruits to make a nutritious smoothie for everyone.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A enters a light-hearted cooking competition with Agent B, making omelettes.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a post-brunch family yoga session.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.4,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk in the park after the meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a spontaneous living room dance-off.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A warmly embraces Agent B after their run, sharing light-hearted teasing.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shares childhood stories with Agent C while cooking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A makes a surprise dessert for the family with a flourish.",
        "values": [
          0.0,
          -0.3,
          0.0,
          1.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to flip pancakes, teaching them a new skill.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A prepares to host a small dinner party with Agents B and C, involving cooking, setting up a dinner space, enjoying music, and anticipating a pleasant evening together.",
    "actions": [
      {
        "description": "Agent A creates a new cocktail recipe and shares it with friends.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A places a polaroid camera on the dinner table.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to lead a group toast.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites friends to participate in a storytelling game.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A proposes an after-dinner walk.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A instigates a dance-off post-dinner.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent C on the meal.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent B a hand-made gift.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to pack leftovers for friends.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, enjoys a lazy Saturday at home. They stretch out on a hammock, Agent B is absorbed in a book, and Agent C prepares breakfast. The aroma, sun, and breeze set a serene scene. They share smiles, hum songs, and radiate a gentle harmony.",
    "actions": [
      {
        "description": "Agent A organizes an impromptu picnic brunch in the backyard for the family.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join them on the hammock to read aloud from B's book.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to set the table with added warmth from flowers.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a spontaneous game of tag with the family pet.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A playfully throws bits of pancake to the pet.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A strums a guitar, singing with the family.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about day plans.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family walk to the park.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A helps clean up after breakfast.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a household kitchen, Agent A is preparing a family meal while Agent B works on a puzzle. Agent C enters to compliment the cooking aroma, and Agent D excitedly shares their day's experiences. The room buzzes with warmth and flowing conversation.",
    "actions": [
      {
        "description": "Agent A invites Agent B to taste-test the dish for feedback.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a comfortable dining space with cushions on the floor.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A plays upbeat music during dinner.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A engages the family in planning a weekend outing.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A listens to Agent D share about their day.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.5,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers a tired Agent B a cup of tea.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.3,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a spontaneous dance party.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.8,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family movie time.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A reminisces with the family using an old photo album.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a sunny kitchen, Agent A and his older cousin, Agent B, prepare a stack of waffles while Agent C engages with a family album. The air is light with the scent of breakfast and the sound of laughter as Agent A participates in the waffle-making and enjoys the warmth of family company.",
    "actions": [
      {
        "description": "Agent A enthusiastically flips pancakes on a hot griddle, laughing at his attempts.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.5,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A brings a tray of freshly squeezed orange juice to the table.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug with Agent B and Agent C.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a dance-off in the living room after breakfast.",
        "values": [
          0.0,
          0.4,
          0.0,
          1.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A offers to clean up the kitchen after breakfast.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.3,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C reminisce over the family album together.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A makes personalized drawings on waffles with toppings.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A samples the first pancake with exaggerated praise.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          -0.5,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to charades while waiting for breakfast.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "On a sunny Saturday morning, Agent A is preparing breakfast in a cozy home filled with laughter and warmth, as their partner, Agent B, and children, Agents C and D, enjoy a playful start to the day.",
    "actions": [
      {
        "description": "Invite Agent B to share a dance in the kitchen amidst breakfast preparation.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Play a lively song on the speaker to lift the morning’s mood even higher.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Suggest to Agent C and D to make cereal box forts instead of towers.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Lean down to affectionately pet the family dog, including it in the morning's activity.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Encourage Agent B to taste the fruit salad and offer a spontaneous compliment.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Announce a spontaneous picnic in the backyard after breakfast.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Offer to make Agent B's favorite coffee as a kind gesture.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Join Agents C and D in laughter after a cereal box tower collapses, without scolding.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Start a playful cereal box stacking competition with all family members.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a warm, sunlit kitchen, Agent A hums while making pancakes and conversing with Agent B and Agent C, setting up a convivial atmosphere filled with care and shared moments in the morning.",
    "actions": [
      {
        "description": "Squeezes fresh orange juice for everyone.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Initiates a family hug.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Playfully messes up hair of Agent B and Agent C.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Proposes a pancake flipping contest.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.9,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Asks Agent C to share her sketches.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Prepares a special surprise ingredient.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Captures a photograph of breakfast.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Shares an encouraging word with Agent B.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Makes a spontaneous plan for an evening walk.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a celebratory meal in their new home with their partner Agent B and close friend Agent C. Agent A and B cook together using fresh herbs from the balcony garden, while Agent C sets the table for a dinner party. They share dreams, laughter, and anticipation for the enjoyable evening ahead.",
    "actions": [
      {
        "description": "Agent A makes Agent B's favorite dish as a gesture of gratitude for their support.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a surprise dessert with ingredients from Agent B's garden.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A leads a toast celebration for the promotion and friendship.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B share a dance in the kitchen.",
        "values": [
          0.0,
          0.5,
          0.0,
          1.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A discusses future travel plans with Agents B and C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent B a relaxing massage after gardening.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A entertains everyone with an amusing work story.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A lights candles to enhance the apartment's ambiance.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A teases Agent C for their meticulous table setting.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a surprise gourmet dinner for a special family celebration, with the support of Agent B, who is playfully setting the table, and Agent C, who is choosing the music. The scene is set for shared experiences and close family bonds as they partake in the preparation and the celebration.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to join in a dance in the kitchen while the last dish is in the oven.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sits down with Agent C to discuss their day, genuinely interested in their school project.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B share light-hearted conversation about past celebrations, reminiscing together.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to teach Agent C how to prepare a family traditional recipe.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A initiates a board game night to continue the family time.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A surprises the family with a hidden stash of fireworks for an after-dinner show.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A encourages each family member to share their favorite memory of the past year.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos with Agent B and Agent C to capture the joyful moments of the evening.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug to express their gratitude towards the family.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, an aspiring chef, is making brunch for his family. Agent B is placing a bouquet on the table while Agent C chats with Agent A about a recent read, in a sunny kitchen.",
    "actions": [
      {
        "description": "Agent A lets Agent C make her own pancake.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A lifts Agent B in a playful embrace.",
        "values": [
          0.0,
          0.5,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent C in a conversation about her book.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A enthusiastically suggests a hike.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A carefully plates the food.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A gathers everyone for a photo.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A starts a spontaneous dance.",
        "values": [
          0.0,
          0.6,
          0.0,
          1.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares his vision of planting a garden.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.4,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A reveals secret ingredients.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is planning a surprise indoor picnic for Agent B on their anniversary. The living room is prepared with food, music, and a photo collage of shared memories. Agent C assists in keeping the event a secret and helps with the preparations.",
    "actions": [
      {
        "description": "Agent A lights scented candles to enhance the aroma.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A plays a specially curated playlist for Agent B.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A guides Agent B to the surprise picnic while holding their hand.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to share memories looking at photos.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A feeds Agent B their favorite dessert with eye contact.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A toasts to their time together with Agent B.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B dance to a meaningful song.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A covers Agent B with a blanket as it grows cooler.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests making the picnic an annual tradition.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is making brunch in a sunlit apartment kitchen while Agent B sets up a board game and Agent C tends to houseplants. They're laughing and conversing, with the day set aside to enjoy their new home together.",
    "actions": [
      {
        "description": "Preparing a family-favorite recipe, inviting siblings to cook together.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Initiating a creative dish competition among the siblings.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Making a nutritious fruit smoothie to share with siblings.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Suggesting a walk in the park for light exercise together.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Playing a cheerful playlist during brunch.",
        "values": [
          0.0,
          0.4,
          0.0,
          1.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Taking a group photo to commemorate their first brunch.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Sharing a childhood photo album with siblings.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Giving a hand-written cooking class invitation to a sibling.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Rallying everyone to participate in the board game.",
        "values": [
          0.0,
          0.5,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a Sunday brunch in a sunlit, cozy kitchen for their family. Agent B, Agent A’s partner, is setting up the dining table, and their child, Agent C, plays outside. The kitchen is filled with the aroma of cooking food, and an upbeat playlist sets a joyful atmosphere, inviting family collaboration and warmth.",
    "actions": [
      {
        "description": "Agent A invites Agent B to join them in the kitchen to finish the salad together.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A lifts the pot lid, tastes the soup, and adjusts the seasoning with a smile.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows wider to let in more air, ensuring the kitchen remains ventilated.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.4,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A calls Agent C and their friend into the kitchen to help set up a drinks station for brunch.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment, embraces Agent B, and expresses gratitude for the help.",
        "values": [
          0.0,
          -0.2,
          0.0,
          1.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares two more plates on the dining table, welcoming Agent C's friend warmly.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A decides to quickly sketch a fun, personalized ‘menu’ for the brunch, adding a creative touch for everyone.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk in the garden after eating, to enjoy the weather and digest the meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are siblings cooking a healthy dinner together in a cozy kitchen, with encouraging participation from Agent C who lounges nearby, playing guitar and joining in the conversation.",
    "actions": [
      {
        "description": "Agent A initiates a playful food plating competition to see who can create the most visually appealing dish.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A suggests going for a brief evening walk together to enjoy the fresh air.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B and Agent C to share their high and low points of the day while they eat.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old photo album to reminisce about past family moments.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "During cleanup, Agent A decides to make it into a game to see who can tidy up the fastest.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a quick session of charades post-dinner for a fun family bonding activity.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "To continue the evening’s momentum, Agent A initiates a round of storytelling, where each person builds upon the last person's tale.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a group workout session for the next morning to keep up with their fitness goals.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.5,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A returns home from work to join Agent B in cooking and Agent C in setting up a lively dinner atmosphere with music and an open window for fresh air. The dinner involves exchanging daily experiences in an aromatic and visually appealing meal setting.",
    "actions": [
      {
        "description": "Agent A starts an impromptu dance with Agent B in the kitchen.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a post-dinner game of charades.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family walk in the park.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a surprise dessert.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A has a heart-to-heart with Agent C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a group hug before bedtime.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A leads a quick family workout session.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.4,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A hugs Agent B while cooking.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A shares an interesting fact for discussion.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult, decides to organize an impromptu indoor picnic in the living room with their partner, Agent B, and mutual best friend, Agent C. The atmosphere is cozy with snacks, soft music, and lit candles after canceling their outdoor plans due to bad weather.",
    "actions": [
      {
        "description": "Agent A offers to prepare a selection of homemade smoothies using fresh fruits.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.3,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing a board game they loved as children.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.7,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old photo album and shares funny anecdotes.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group storytelling game.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A decides to play a round of charades.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a comfortable nook in the tent with pillows.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.2,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a collective art project.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A opens up about aspirations for the future.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.1,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a gentle stretching session.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.2,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a passionate home chef, preparing a surprise dinner for their family. Agent B, drawn by delicious smells, joins in the kitchen, where playful interactions ensue. Agent C brings music into the mix, contributing to the warm family atmosphere with a guitar.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to join the cooking, turning meal preparation into a family activity.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A records the cooking session for a family vlog.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A decorates the table with attention to detail and Agent C’s favorite flowers.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A lets Agent C choose the dinner music playlist.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares a dance with Agent B in the kitchen.",
        "values": [
          0.0,
          0.5,
          0.0,
          1.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A surprises Agent B with a taste test of a special dish.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A starts a fun food decoration contest with Agent B.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A fosters family bonding through shared cooking stories.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A leads a game of charades after dinner.",
        "values": [
          0.0,
          0.6,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A hosts a dinner party, meticulously prepping a meal as she is cheered by the companionship of her friends, Agent B and Agent C. The environment is welcoming with a well-set dining area and a tone of shared memories and joy.",
    "actions": [
      {
        "description": "Agent A meticulously arranges the freshly chopped vegetables into a vibrant salad.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A lights candles around the dining area.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old photo album and shares memories with her guests.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a toast to friendship and good health.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to participate in the dessert preparation.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to discuss his recent sports achievement.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a cooking competition for post-dinner entertainment.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A ignites a dance-off to increase the festivity.",
        "values": [
          0.0,
          0.9,
          0.0,
          1.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a board game for everyone to enjoy.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a Sunday brunch in a sunlit kitchen, with Agent B setting the table and Agent C nearby, engaging in their own quiet activity. The air is filled with the aroma of baking and nature from the open windows.",
    "actions": [
      {
        "description": "Agent A attempts a new pancake recipe for a family surprise.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a kitchen dance with Agent B.",
        "values": [
          0.0,
          0.7,
          0.0,
          1.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to prepare a fruit salad together.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sends a caring message to a distant relative about the brunch.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A places candles on the table to enhance atmosphere.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to share their story, attentively listening.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses fresh herbs from the garden and describes flavors to Agent B.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation on the upcoming week during brunch.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk after brunch.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is prepping breakfast in a family home kitchen while engaging in warm interactions with their family, Agent B and Agent C.",
    "actions": [
      {
        "description": "Agent A initiates a conversation about everyone’s plan for the day, fostering a sense of camaraderie and care.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent B the piece of toast with the most avocado on it.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A decides to clear the table after breakfast, showing consideration.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sits down to assist Agent C with the puzzle.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family walk after breakfast.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares a funny anecdote from the previous day.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to play a board game.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A asks for a summary of Agent B's book.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent C a high five after completing the puzzle.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B, who are siblings, have decided to host a surprise anniversary dinner for their parents. The dining room is warmly lit and accompanied by a playlist of 90s music, the epoch of their parents' marriage. A homemade lasagna is ready in the kitchen, and a chocolate cake waits on the counter. The table is arranged with great care, featuring a bouquet of fresh flowers.",
    "actions": [
      {
        "description": "Agent A carefully plates the lasagna, ensuring it looks as appetizing as possible.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A quickly hides behind the kitchen island, preparing to jump out and surprise their parents.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A leads their parents to the table, pulling out chairs for them like a professional host.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A makes a heartfelt toast to their parents' love and longevity.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A captures a group photo of everyone at the table with the anniversary cake taking center stage.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to open a vintage bottle of wine that was saved for a special occasion like this.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing a game where everyone shares their favorite memory of the family, contributing to the nostalgic atmosphere.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A encourages their parents to share the first dance of the evening.",
        "values": [
          0.0,
          0.2,
          0.0,
          1.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a cooking enthusiast who has just returned from a morning jog and is now bustling in the kitchen, preparing a surprise brunch for his family. Agent B, his partner, and Agent C, their teenager, are engaged in their own activities, with an air of anticipation for the family meal.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to help with the brunch preparations to turn the cooking into a family activity.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A plants a kiss on Agent B's cheek as a token of affection while they laugh together.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A orchestrates a taste test of the fresh muffins with Agent C, sharing the first bites and waiting for their reaction.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table with care, placing everyone’s favorite dishes in front of their usual seats.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A surprises Agent B and Agent C with a new recipe they've all been eager to try.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A, feeling the warmth of the morning activities, suggests a family walk after brunch.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to snap a family selfie with Agent B and Agent C while everyone is cooking and having a good time.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows wide to let in fresh air and the sound of birds chirping.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.4,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a friendly pancake flipping competition with Agent C, laughing at the successive attempts.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A hosts a brunch for close friends, involving healthy dishes, fresh air, sunlight, soft music, and personal touches, creating a warm atmosphere aiming to bond with guests Agent B and Agent C in their home.",
    "actions": [
      {
        "description": "Agent A initiates a group toast to celebrate their collective achievements.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a light-hearted game after the meal to continue the jovial gathering.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out an old photo album to reminisce and share past memories with Agent B and Agent C.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A leads a group clean-up effort after the meal, turning the mundane task into a fun and interactive dance session.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent B and Agent C personalized gifts as a token of appreciation for their friendship and support.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a brief outdoor group exercise in the backyard following the meal.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.3,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a moment of silence to acknowledge the hard work and perseverance of each other.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A crafts a special non-alcoholic cocktail for each person, tailoring to their taste preferences.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to help prepare a dessert, turning the process into a collaborative and learning experience.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A prepares a surprise brunch for Agent B and involves Agent C, the teenage child, in creating a warm and enjoyable morning experience on the patio.",
    "actions": [
      {
        "description": "Agent A hugs Agent B tightly as they arrive at the brunch table.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a toast to family and the beautiful day ahead.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to share what they look forward to most in the upcoming week.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shares a fun anecdote from the past to evoke collective laughter.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to try cooking one of the simpler brunch dishes next time.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes candid photos of Agent B and Agent C enjoying brunch.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk after brunch for some fresh air and digestion.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A offers to clean up the dishes, insisting Agent B and Agent C relax.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a surprise dessert to celebrate Agent B's recent work accomplishment.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, with their children Agents B and C, fills their home kitchen with the warm atmosphere of a Sunday morning baking session, inviting positive anticipation for the cookies to come out perfectly.",
    "actions": [
      {
        "description": "Agent A starts an impromptu dance with the children to their favorite energizing song as they wait for the cookies to bake.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small cookie-decorating competition to see who can create the most whimsical design.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a quick game of tag in the backyard while the cookies cool down after baking.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a picnic in the garden for the family to enjoy the fresh cookies together.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites the children to share stories about their best and least favorite moments of the week as they savor their homemade cookies.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A notices Agent C looking tired and offers to read a book to the children in a quiet corner.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.3,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A engages the children in cleaning up the baking mess as a team, making it into a fun and fast-paced challenge.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A creates a small reward system where the kids earn little handmade paper stars for every positive act they do.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "After noticing the neighbors’ children outside, Agent A encourages Agents B and C to share their baked goods with them.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A arrives home to a warm welcome from Agent C, who is preparing dinner, and Agent B, who is excitedly selecting board games. They indulge in heartfelt interactions, shared meals, and enjoyable activities that strengthen their bond.",
    "actions": [
      {
        "description": "Agent A sets the table, carefully choosing cutlery and plates.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a toast to celebrate family togetherness.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes a walk with Agent B, engaging in light-hearted conversation.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A browses through an old photo album with Agents B and C, recalling fond memories.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C with kitchen cleanup after the meal.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A plays a strategic game with Agent B, encouraging Agent B’s decision-making.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A selects a cherished movie for all to enjoy after games.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A ensures Agents B and C have water bottles by their beds for the night.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.2,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A plans a surprise breakfast, making a list of items to buy.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A arrives home from basketball practice and enters a home brimming with life. Agent B is in the kitchen making a smoothie, and Agent C is setting up a board game amid an atmosphere of laughter and leisure.",
    "actions": [
      {
        "description": "Agent A helps prepare smoothies with Agent B.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A helps arrange the living room for a board game with Agent C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk to watch the sunset with Agent B and C.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to a basketball rematch.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.5,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a video call with the extended family.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes creating a family game tournament.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos to document the game night.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers for kitchen cleanup.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.2,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plans a healthy meal prep with Agent B.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.3,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "The scenario unfolds in a bright family kitchen on a leisurely Saturday morning, with a parent (Agent A) who has just prepared some granola, their adolescent child (Agent B) browsing a recipe book, and the other parent (Agent C) completing the breakfast setup. The atmosphere is ripe for a suggestion from Agent A to engage the family in an activity.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C on a family hike.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family board game marathon.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A reminisces about past vacations using an old photo album.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A starts a food fight while making pancakes.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a cooking competition.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A leads a group exercise session.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes writing a short story together.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates building a blanket fort.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A learns to play Agent B's favorite video game.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is organizing a surprise breakfast-in-bed to celebrate Agent B's personal achievement. In the kitchen, Agent A prepares a breakfast tray with a variety of foods and fresh flowers while Agent C sets up a playlist. The family dog awaits excitedly.",
    "actions": [
      {
        "description": "Agent A handwrites a heartfelt note to place on the breakfast tray.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A gently nudges Agent C to wake up and guide them into preparing the table.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.2,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to pick fresh flowers from the garden.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to recall shared memories with Agent B.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A practices delivering a small speech.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A opts to include a small photo album beside the tray.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to wake Agent B with a soft melody.",
        "values": [
          0.0,
          0.1,
          0.0,
          1.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A makes fresh juice instead of using store-bought.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to share breakfast.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A hosts a casual dinner at home for Agent B, a close friend, and Agent C, a sibling. The atmosphere is cheerful with upbeat music and a freshly prepared meal ready on the table. Agent B is selecting songs while Agent C tidies up the living room.",
    "actions": [
      {
        "description": "Invite Agent B and Agent C to join in preparing a dessert together.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Start a lively dance-off in the living room with Agents B and C.",
        "values": [
          0.0,
          0.9,
          0.0,
          1.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Open windows to let in the evening breeze while conversing with the guests.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Share a childhood story with Agents B and C that evokes laughter and fond reminiscing.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Suggest a friendly competition of preparing dishes with Agent B, while Agent C judges the presentations.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Take a moment to express appreciation for Agent B's and Agent C's company and share how much the evening means.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "After the meal, propose a short walk together around the neighborhood.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Offer Agent B the chance to play their favorite song on the sound system.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Declutter the dining area together, turning the clean-up process into a cooperative game.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "On a sunny Sunday morning in a suburban home, Agent A is in the kitchen preparing for a healthy breakfast, with ingredients laid out and a cookbook for guidance. Agent B relaxes at the kitchen table, and Agent C looks for a cereal bowl, humming contentedly.",
    "actions": [
      {
        "description": "Agent A decides to prepare a family breakfast, using the fresh ingredients available on the counter.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A warmly invites Agent B and C to join in the preparation of the meal, suggesting a mini cooking lesson.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a small workout challenge for the family after breakfast to promote a healthy start to the day.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the garden to pick a few fresh herbs to enhance the breakfast flavors, inviting Agent C along.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A cheerfully proposes a game where each family member must share a fun fact or a joke while they eat.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to share a recent accomplishment, and leads a round of applause to celebrate.",
        "values": [
          0.0,
          0.2,
          0.0,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes initiative to plan a light-hearted family outing for after breakfast, considering everyone's preferences.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A offers to teach Agent C how to make a new healthy smoothie recipe, utilizing fruits from the garden.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A composes a colorful breakfast setting, carefully arranging the dishes to create a visually appealing meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a substantial breakfast in the kitchen, Agent B is setting the dining table, Agent C is selecting lively music, and Agent D is perusing a family album. Everyone is contributing to the atmosphere of a cozy family morning gathering.",
    "actions": [
      {
        "description": "Brings freshly squeezed orange juice to the table.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Initiates a group hug with the family.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Encourages conversation about each person's day.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Suggests a family walk after breakfast.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Plates and serves food aesthetically.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Takes a moment to express gratitude for family time.",
        "values": [
          0.0,
          -0.3,
          0.0,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Organizes a game of charades for the family.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Makes a new entry in the family album with Agent D.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Invites the family to learn a new dance.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A hosts a board game night with her friends, Agent B and Agent C. They enjoy homemade food, the warmth of the gathering, and the comfort of their long-standing bond.",
    "actions": [
      {
        "description": "Agent A enthusiastically starts the board game night.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A opens a window for fresh air.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.4,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares homemade snacks with her friends.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes a group photo.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A leads a quick stretching break.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A talks about their hopes for the future.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal story.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.5,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A gets blankets and pillows for comfort.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the furniture for a dance moment.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult, steps into the family kitchen one evening where Agent B and Agent C, their siblings, are engaged in a lively cooking session. The kitchen is filled with the rich aroma of baking spices and colorful fresh vegetables and grains. Agent B is chopping vegetables, while Agent C stirs a simmering stew. Agent A smiles and participates in food preparation.",
    "actions": [
      {
        "description": "Agent A offers to help with the chopping task to speed up the dinner preparation.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A challenges to a light-hearted contest of kneading dough.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates setting the table with colorful plates and cutlery.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A huddles for a quick group photo to capture the cooking venture.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts a playful food trivia game while cooking.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old family cookbook to try a new recipe.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets up an indoor picnic area to enjoy the meal.",
        "values": [
          0.0,
          -0.3,
          0.0,
          1.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A leads a toast to celebrate the teamwork before eating.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites sharing stories over the meal prepared together.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young father, just returned home after a long day at work. He steps into the vibrant family living room where Agent B, his spouse, is assembling ingredients on the kitchen counter for dinner and Agent C, his teenage child, is sitting at the dining table, headphones on, working on a creative art project. The windows are open, wafting in the late afternoon breeze and flooding the room with the golden hue of the setting sun. Sounds of soft music are emanating from the speaker, and the aroma of freshly brewed coffee fills the room. There's a palpable sense of peace as each person is busily engaged in their individual task. Agent A smiles contentedly as he watches his family, unwinding from the day's demands. A playful idea crosses his mind as he gently approaches Agent B and whispers something, causing them both to glance towards Agent C with a mischievous twinkle in their eyes.",
    "actions": [
      {
        "description": "Agent A decides to initiate a surprise family art night, encouraging everyone to create a piece of artwork together.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A starts a playful food fight with Agent B while cooking, lightening the atmosphere.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table, placing a new plant centerpiece he picked up, to enhance the family dining experience.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A chooses a family-favorite upbeat playlist to play during dinner preparation.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares an amusing story from his day at work, eliciting laughter around the table.",
        "values": [
          0.0,
          0.2,
          0.0,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to teach Agent C a cooking technique, making dinner preparation a bonding activity.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A pours Agent B a cup of the freshly brewed coffee, sharing a quiet moment together.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old photo album, reminiscing about past family vacations.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a fitness instructor, has prepared dinner, with family gathered in a warmly lit dining area. A playlist sets a lively atmosphere while everyone enjoys the home-cooked meal. Agent C captures the moment for her blog, and Agent D shares amusing anecdotes.",
    "actions": [
      {
        "description": "Agent A leads siblings in a toast to celebrate their time together before everyone starts eating.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to discuss her latest blog post ideas while enjoying their meal.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers the last piece of dessert to Agent D.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.4,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game where each person shares the funniest moment of their day.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a post-dinner walk around the neighborhood as a family.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old photo album to reminisce on past family gatherings.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to dance in the living room to their favorite song.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C collaborate on the dishes and clean-up.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent B a back massage after noticing they're a little stressed.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A has prepared brunch and invited Agents B and C to dine together on a Sunday morning. The ambiance is pleasant, with food, music, and the presence of a pet dog adding to the environment.",
    "actions": [
      {
        "description": "Agent A pours orange juice for Agent B and C, then raises a toast to a great day ahead.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A picks a book from the shelf to recommend to Agent B after noticing the one they're currently reading.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside a small plate of food for the dog to enjoy outside.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.4,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join in cooking an experimental brunch recipe they recently discovered.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a group photo with Agent B and C at the table before they start eating.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A brings extra chairs to the table, making space for everyone to sit together comfortably.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.3,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A opens the window wider to let more fresh air in.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.2,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk in the garden after brunch to enjoy the lovely weather.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plans a short nap after the hike to recharge before movie night.",
        "values": [
          0.0,
          0.8,
          0.0,
          -0.3,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is in a home setting with Agents B and C, the aroma of a wholesome meal fills the kitchen while Agent B looks through recipes and Agent C sets up for crafting. The agents share a comfortable atmosphere, poised for collaborative activities.",
    "actions": [
      {
        "description": "Agent A includes Agent B in meal preparation, sharing family cooking techniques.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug with Agent B and Agent C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to pick music to play in the background.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to experiment with the new recipe.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside time for crafting with Agent C after meal prep.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A creates an indoor picnic area after activities for a meal.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests walking outside after lunch for fresh air.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a brief family yoga session for well-being.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.3,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites sharing of daily stories during the activities.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young parent, is in the kitchen preparing a meal with Agents B and C, their family, in a warm and laughter-filled home as evening settles.",
    "actions": [
      {
        "description": "Agent A chooses a recipe that involves everyone, like making homemade pizza from scratch, allowing for individual topping choices.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game where each person shares one highlight of their day while cooking.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk to a nearby park to enjoy the evening breeze after dinner.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old photo album post-dinner to reminisce together.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a quick board game while the meal is simmering.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A offers to teach Agent C a particular cooking technique used that evening.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small taste test game for the new dish with Agents B and C before serving.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plans a surprise dessert requiring a team effort for preparation.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agents B and C on their mealtime setup and music choice to boost the mood.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, is in the kitchen of his family home, baking a pie. His mother, Agent B, is gardening outside, visible through a window, while his father, Agent C, reads at the dining table. The table is nicely set for a meal.",
    "actions": [
      {
        "description": "Agent A brings the pie to the table and invites Agents B and C to try it.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a comfortable space in the living room for them to relax after eating.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B about her day in the garden and listens attentively.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A shares an interesting fact he learned in one of his college courses with Agents B and C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family board game night for the evening.",
        "values": [
          0.0,
          0.4,
          0.0,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers to clean up the kitchen after the meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.4,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old photo album to look through with his parents.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A encourages his father, Agent C, to share stories from his youth as they eat.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A picks a bouquet of flowers from the garden to surprise Agent B.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are siblings who have decided to spend their Saturday renovating the old garden shed into a cozy hangout spot for themselves and their friends, Agent C and Agent D. The morning is bright, and the garden is a vibrant backdrop. Agent A is sharing their design ideas, Agent B chooses paint colors, Agent C tunes an old guitar, and Agent D sets up a picnic area.",
    "actions": [
      {
        "description": "Agent A begins the day by offering a detailed tour of the shed, sharing their vision for the renovation.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A coordinates with Agent B to choose a vibrant color palette for painting the shed walls.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A offers to climb up a ladder to fix a broken windowpane, enhancing the comfort of their new space.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.4,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A and the others start painting the shed walls, turning the task into a playful competition to see who can be most creative.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up string lights around the interior of the shed, giving it a warm and inviting glow.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old record player and puts on some cheerful music to set a light-hearted mood.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the furniture they built together with the others, deciding on the best layout for hangouts and activities.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C as they tentatively play a new song on the guitar, making everyone smile.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A lays out a blanket and joins Agent D on the ground for the picnic, laughing and sharing stories.",
        "values": [
          0.0,
          -0.4,
          0.0,
          1.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home, Agent A, a loving parent, is finishing up preparing a wholesome dinner. Agent B and Agent C, A's two adolescent children, are engaged in a lively game of charades in the kitchen. The family shares laughter and looks forward to a hearty meal that Agent A has prepared. The setting suggests busy family activities and a nurturing environment.",
    "actions": [
      {
        "description": "'Agent A' plates the dinner, arranging the food appealingly before announcing that it's ready.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.3,
          0.1,
          0.0
        ]
      },
      {
        "description": "'Agent A' initiates a toast to celebrate a personal accomplishment of 'Agent B'.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "'Agent A' proposes playing a favorite family board game after dinner.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "'Agent A' shares an old, cherished family story that brings waves of laughter around the table.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "'Agent A' invites 'Agent B' to assist with dessert, suggesting they make fruit kebabs together.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "'Agent A' turns on some light music, setting a relaxed mood for the family to enjoy during the meal.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "'Agent A' hugs 'Agent C' after a minor kitchen mishap, providing comfort and a light-hearted tease.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "'Agent A' incorporates a fun trivia quiz about the ingredients in the meal, engaging everyone's attention.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "'Agent A' suggests a post-meal walk to a nearby park for some fresh air and family bonding time.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager with a passion for culinary arts, plans a surprise brunch for their parents' anniversary, with Agent B, their sibling, helping eagerly. Agent C, a close cousin, joins them. The kitchen is alive with activity, ingredients ready, and jazz music playing.",
    "actions": [
      {
        "description": "Agent A carefully teaches Agent B how to flip pancakes on the skillet.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that Agent C zest some lemons for the fresh lemonade.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A samples the salad dressing and asks for Agent B and C’s opinion.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes pictures of their cooking process to capture the memory.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the music to everyone’s favorite tunes.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a taste-test game for the new recipes.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to garnish the dishes.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug after cooking.",
        "values": [
          0.0,
          -0.3,
          0.0,
          1.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a voting system for the dishes.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "A parent wakes up, joins their teenager in morning stretches, helps their partner set the table, initiates a family discussion, proposes a walk, surprises with movie tickets, encourages a cooking session, leads a gratitude exercise, mediates a game tournament, takes a moment to meditate, and ends the day with storytelling.",
    "actions": [
      {
        "description": "Joins in morning stretches.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Helps set the breakfast table.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Initiates a conversation about the day’s plans.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Suggests a family walk in the park.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Surprises family with movie tickets.",
        "values": [
          0.0,
          0.2,
          0.0,
          1.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Organizes a collaborative cooking session.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Leads a gratitude circle.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Hosts a board game tournament.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Meditates to recenter.",
        "values": [
          0.0,
          -0.5,
          0.0,
          -0.4,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a pleasant kitchen atmosphere, Agent A is preparing brunch, Agent B is setting the table to music, Agent C is making fruit salad, and Agent D is taking in the scene. They share a sense of comfort and enjoyment, reinforced by a restful night and the anticipation of a shared meal and activities.",
    "actions": [
      {
        "description": "Agent A offers to make Agent D's favorite pancake.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a toast to celebrate the gathering during brunch.",
        "values": [
          0.0,
          0.3,
          0.0,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A pulls up an extra chair, inviting Agent D to join them at the table, rather than staying apart.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A starts a casual game of charades after the meal to keep the lighthearted mood alive.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to share a recent accomplishment in school, expressing pride and interest.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to save the last pancake for Agent C, who was too shy to take the last piece.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the dishes without complaint, allowing Agents B, C, and D to continue their conversation.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.1,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A creates a fun playlist of everyone’s favorite songs to play in the background during brunch.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a walk in the nearby park after brunch as a family activity.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is hosting a small dinner party at his home with Agents B and C. The dining table is adorned with vibrant dishes, and calm music fills the ambiance. Agent B is preparing a salad, while Agent C chooses a soothing playlist. Words are unnecessary among them to feel at ease.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to join in on a group exercise routine after dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to play a cooperative board game after their meal.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a deep conversation.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a group stargazing session outside after dinner.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to bake a surprise dessert.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A brings out photo albums.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.8,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers a toast.",
        "values": [
          0.0,
          -0.4,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to serve the meal personally to Agent B and C.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plans a friendly culinary competition with playful rules for dessert.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a nutrition enthusiast who is blending a vibrant, nourishing smoothie in the kitchen. Agent B, their partner, lounges at the kitchen table, scrolling through a playlist to select the perfect soundtrack for their evening. Agent C, their teenage child, flits between the kitchen and living room, setting up the table for dinner while also organizing a family board game for later enjoyment. The aroma of the smoothie blends with the sound of laughter as a song from Agent B’s playlist fills the room, and Agent C playfully debates the best game strategy.",
    "actions": [
      {
        "description": "Agent A pours the smoothie into three glasses, offering one to Agent B and Agent C.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to choose a song that energizes them.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to share any new interests they’ve discovered recently.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A leads a toast to the family's collective health before they drink their smoothies.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a light-hearted competition during the board game with a creative penalty for the loser.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to join in on setting the table, turning it into an impromptu dance while doing so.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal anecdote related to a song that starts playing, reminiscing with Agent B.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.3,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to open the windows to let fresh air circulate in the dining and living areas.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.1,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A plans a surprise post-dinner walk for the family to a nearby scenic overlook.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a salad in the sunlit living room, Agent B is making smoothies, and Agent C sets the dining table. The household is filled with laughter and chatter, with an open window inviting a fresh breeze and natural light.",
    "actions": [
      {
        "description": "Agent A offers a taste of the salad to Agent B and Agent C to get their opinion.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages everyone to join in a light dance to the upbeat music playing in the background.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests moving the lunch outside to enjoy the beautiful weather in the garden.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a toast to family and good times as they begin their meal.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A leads a conversation about planning a group trip to a local park or attraction.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a collective cleanup after the meal to maintain the home's pleasant atmosphere.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.3,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes a group photo to commemorate the joyful gathering.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a spontaneous game involving creative storytelling, including everyone at the gathering.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A crafts a special, personalized drink for Agent B, considering their favorite flavors.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a surprise breakfast for their special someone, Agent B. The kitchen is filled with the aroma of pancakes and coffee. Agent C, their roommate, is still asleep, and Agent A is being careful not to make too much noise. There is a bouquet of fresh flowers on the dining table and a gentle melody playing in the background.",
    "actions": [
      {
        "description": "Agent A whispers a cheeky joke to Agent B as they serve the pancakes.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game where they and Agent B have to eat pancakes with unusual toppings.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a small treasure hunt around the kitchen for Agent B, with clues leading to their favorite morning snack.",
        "values": [
          0.0,
          -0.5,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to prepare a second round of Agent B's favorite coffee blend after noticing their delight with the first cup.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join the breakfast, offering a plate of food to make their morning brighter.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A sits closely next to Agent B, sharing moments from their dreams last night.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the breakfast dishes alone, allowing Agent B some quiet time to wake up fully.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.1,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A playfully challenges Agent B to a game of tic-tac-toe on a napkin, with each round resulting in the winner telling a fun fact about themselves.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A writes a heartfelt note and slips it into Agent B's work bag for them to find later.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are cooking together in a sunny kitchen while Agent C is seated at the kitchen island. The house is filled with light and music, creating an ambiance of warmth. The agents engage in playful and cooperative activities while preparing their meal.",
    "actions": [
      {
        "description": "Agent A initiates a spontaneous dance with Agent B.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk after dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A playful fruit tasting with Agent B.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes an indoor picnic.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent C on their work and dance break suggestion.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A plans a surprise movie night.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent B a warm hug.",
        "values": [
          0.0,
          0.2,
          0.0,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shares a childhood story.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a sunny, serene kitchen, Agent A, a parent, is leaning against the kitchen island, while Agents B and C, their children, are engaged in playing with cards and sketching, respectively. They occasionally share their progress, laughing and conversing softly.",
    "actions": [
      {
        "description": "Agent A begins preparing a nutritious meal for the family, asking for help from Agents B and C.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a walk to the local park after lunch.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A decides to initiate a game of charades with Agents B and C.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agents B and C a creative challenge.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A turns on lively music for a family dance-off.",
        "values": [
          0.0,
          0.6,
          0.0,
          1.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A expresses genuine interest in the children's activities.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A hugs each child, sharing love and appreciation.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agents B and C to invite friends for a picnic.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          -0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a quiet storytelling time.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult, is finishing up a meal at the dining table with a sense of warmth in the home as the evening sun pours through. Agent B, their partner, is clearing dishes, Agent C, their preteen child, is sketching, and Agent D, the grandparent, shares laughs in the living room. Fresh air streams in from the open balcony door.",
    "actions": [
      {
        "description": "Agent A offers to wash the dishes, allowing Agent B to rest.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages with Agent C about their sketch and suggests adding colors.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a board game night for the family to enjoy collectively.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to accompany Agent D for an evening walk outside.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to bake a dessert together for the family.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old photo album to reminisce with the family.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent D to teach them an old family recipe.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C with homework, making the task more engaging.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A leads a light workout session in the living room for the family.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.3,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In the living room, Agent A organizes an indoor picnic, Agent B is absorbed in a book, and Agent C plays with a puzzle. Freshly baked cookies waft from the kitchen.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to join the picnic.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A converses lively with Agents B and C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group board game.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests collaborative storytelling.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers to solve the puzzle with Agent C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A demonstrates a yoga pose.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.4,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking turns reading aloud.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes building a makeshift fort.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A prepares more snacks.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A returns from work to a family dinner at home with Agent B, their spouse, and Agent C, their child, all preparing to share a home-cooked meal.",
    "actions": [
      {
        "description": "Agent A helps set the table and lights the candles for a warm ambiance.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A cuts and serves the pie they baked together over the weekend.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a toast, expressing appreciation for Agent B’s efforts in preparing the meal.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A discusses planning a family day out with Agent B and Agent C, igniting excitement.",
        "values": [
          0.0,
          0.4,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares a funny story from work, sparking laughter around the table.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A listens attentively, offering guidance as Agent C discusses a challenge faced at school.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A suggests a family board game night.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to wash the dishes, giving Agent B a needed respite.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.3,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A snuggles with Agent C at bedtime, reading their favorite story.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a renowned chef, returns home to find the house filled with the aroma of freshly cut herbs and warmed by preheated ovens. Agent B, her husband, has prepared a basket of fresh garden produce, and Agent C, their daughter, is ready to assist in cooking. The home is a haven of food and fondness as they plan to spend the evening cooking together.",
    "actions": [
      {
        "description": "Agent A decides to make a family favorite recipe using the garden produce.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to prepare the meal together, guiding her through the process.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A plans a spontaneous dinner outdoors to enjoy the garden ambiance.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A opts to teach Agent C a new cooking technique during their food prep.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A tells stories of past family cooking adventures while they cook.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to appreciate Agent B’s effort and kisses him lightly.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A decides to leave the dishes unwashed for a while to join the family at the dinner table immediately.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that they take a walk in the garden after dinner.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a playful food plating competition with Agent C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a home kitchen, Agent A is cooking, Agent B sets the table, and Agent C is chatting after soccer practice. They interact warmly as they prepare for dinner.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to add their favorite spices to the stew.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk to the park after dinner.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A leads a toast to celebrate the family's achievements.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares a surprise dessert with stories of its making.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A engages the family in a playful food plating competition.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C have a friendly arm-wrestling match.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a board game night after dinner.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares an anecdote from their teen years.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.3,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug before the meal.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, comes home to find Agent B attempting to cook a family recipe and Agent C working on a puzzle. The home is lively with cooking activities and music.",
    "actions": [
      {
        "description": "Agent A decides to join Agent B in the kitchen and help him with cooking, opting to make the meal together.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts a friendly competition with Agent B to see who can chop vegetables faster.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A decides to document the cooking process with photographs to capture the fun moments.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Observing that Agent B is overwhelmed, Agent A takes over some tasks to ease his workload.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent C in conversation about the puzzle, reminiscing about the family trip.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A involves everyone by brainstorming ideas for adding a personal twist to the recipe.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to surprise Agents B and C by playing a song on the guitar, recalling memories.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A convinces others to take a break and dance to a catchy tune on the radio.",
        "values": [
          0.0,
          0.8,
          0.0,
          1.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A turns the meal preparation into a teaching moment, explaining nutritional benefits.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a father preparing a weekend barbecue, is joined by his children Agent B and Agent C in the backyard. Agent B plays guitar while Agent C sets up a table with games, as they all enjoy the sunny day filled with food, laughter, and music.",
    "actions": [
      {
        "description": "Agent A grills various types of food to cater to everyone's preferences.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a dance with Agent B.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "The family shares laughter over past BBQ stories.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a collaborative game involving teamwork.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A relaxes to enjoy Agent B's music.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A leads a toast to family togetherness.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts a friendly cooking competition with his children.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes an impromptu talent show.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes photographs of his children.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, an avid home chef, has invited friends Agent B and C for a lively cooking day at home, with the kitchen prepped for a collaborative cooking experience.",
    "actions": [
      {
        "description": "Agent A decides to prepare a nutritious three-course meal with Agents B and C contributing to the cooking process.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plans a moment to share cooking tips with Agent B while they chop vegetables, simplifying the process.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a challenge for who can whip up the best garnish, adding an element of friendly competition.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A selects a vibrant, upbeat song to dance to along with Agent B and C while waiting for the meal to cook.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.9,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to taste-test dishes as they cook and share feedback to refine their culinary skills.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a quick group photo to capture the enjoyable cooking session to remember the day.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a round of sharing favorite food-related memories while they dine on their creations.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.4,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to try a new recipe that seems a bit complex, showing confidence in their abilities.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "After the meal, Agent A invites everyone to relax with a homemade dessert they have prepared in advance.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a young adult seated at the kitchen table, finishing a jigsaw puzzle. Agent B is assisting, while Agent C prepares a meal. Natural light and the scent of a home-cooked meal create an inviting atmosphere.",
    "actions": [
      {
        "description": "Agent A helps Agent C with preparing the meal, suggesting a new recipe they recently learned about.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table, carefully arranging the dishes to create an appealing presentation.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A raises a toast to celebrate the simple joy of having dinner with loved ones.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game night, picking out board games that are favorites.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A playfully teases Agent B about their competitive nature in an affectionate manner.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A encourages everyone to share stories about their day, fostering dialogue.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up after the meal, turning the clean-up process into a group activity.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers to finish up the cleaning to allow Agent C to rest.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.3,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a group walk post-dinner to enjoy the twilight.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A prepares a nutritious brunch for the family, with gentle sun and fresh air coming through the kitchen window, and background music setting a serene atmosphere. The table is set playfully by Agent B and the children, with fresh flowers and creatively folded napkins, emphasizing a family-oriented and cheerful environment.",
    "actions": [
      {
        "description": "Agent A begins a tickle fight with Agent C, causing laughter and physical play.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent D to a playful challenge of creating the most creative pancake shapes.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A leads a moment of gratitude for each family member, fostering a heartfelt interaction.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Meal preparation becomes a fun game with everyone adding their favorite ingredient to the salad.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent B is prompted by Agent A to share a personal weekly story, deepening the family bond.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "A spontaneous game of charades is initiated by Agent A while waiting for brunch to cook.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes an after-brunch walk to the park to enjoy time together outside.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "A new board game is introduced by Agent A for post-meal entertainment.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Each family member receives a warm hug from Agent A, conveying love and care.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is hosting a casual Sunday brunch at home with her close friends, Agent B and Agent C. The setting is lively, and the environment is filled with the aroma of fresh waffles, the sound of friendly conversation, and bright sunlight. Agent A adds a fruit salad to the mix, while Agent B shares an entertaining story about his recent experience.",
    "actions": [
      {
        "description": "Agent A decides to make homemade smoothies for everyone, using fresh fruits and asking for their preferred choices.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a game of charades after brunch to continue the lively atmosphere.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A creates a shared photo album online and invites Agents B and C to contribute.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a future group trip based on Agent B's hiking story.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A embraces Agent B in a warm hug as he recounts a tough moment during his hike.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a toast to celebrate their long-standing friendship.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A shares an anecdote from her own experience related to Agent B's hiking story.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.3,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A circulates an idea for a collaborative project that all friends can engage in.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk in the nearby park after brunch.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a surprise breakfast for Agent C's birthday, while Agent B, the other parent, assists and shares a tender moment. They set the table with care, focusing on making the experience special for their child.",
    "actions": [
      {
        "description": "Agent A hugs Agent B, reinforcing their bond.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A whispers a joke to Agent B, lightening the atmosphere.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A appreciates the quiet morning, birds in the garden.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.5,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A skillfully flips pancakes, humming to music.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a treasure hunt for Agent C.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decorates the top pancake carefully.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to taste the batter.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.4,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A places a crafted birthday card by the plate.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A lets Agent C choose the day’s activities.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A arrives home and is greeted by the sight and smells of Agent B cooking dinner and Agent C working on a school project. The open window lets in a spring breeze, and the family dog, Agent D, waits expectantly in the room.",
    "actions": [
      {
        "description": "Agent A changes into casual clothes to unwind after a day's work.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.4,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B in kitchen prep work.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a short family workout session.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.6,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A supports Agent C with their school project.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A carefully sets the mood for dinner with music.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sparks engaging dinner conversation.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a post-dinner board game night.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A brings a refreshing drink to Agent B.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A plays with Agent D, including the pet in the family time.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.4,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a young father who has just finished preparing a sumptuous homemade brunch on a bright Saturday morning. The scent of freshly baked bread and sizzling eggs fills the air of the kitchen. Agent B, his partner, is setting up the table with utensils and a vase of fresh flowers they picked together from their garden. Meanwhile, Agent C, their teenage child, tunes the guitar in the living room, practicing chords of a new song they learned recently.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to join him in the kitchen for a family meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent C on how quickly they’re learning the guitar.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family day out after brunch, such as a hike or picnic.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old family photo album to share memories with Agent B and Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A gets ingredients ready for baking cookies after brunch and asks for his family’s favorite flavors.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a board game challenge after the meal.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a friendly cook-off with Agent B for the next day and decides who will cook which course.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets the mood by playing some light, cheerful music during the meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          1.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A gathers the family in the living room after brunch for a group cuddle on the sofa.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.9,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a sunlit kitchen, Agent A enjoys breakfast with Agent B and C, sharing nourishment and positivity while making plans to engage in both individual and shared activities throughout the day.",
    "actions": [
      {
        "description": "Agent A suggests a walk after breakfast for some fresh air and a bit of physical activity for everyone.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A cleans the dishes and encourages B and C to pick some tunes for them to enjoy while they tidy up.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about plans for the day, showing genuine interest in B and C's activities.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a quick board game before everyone gets on with their day.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make a batch of smoothies, asking B and C for their preferred flavors to personalize their drinks.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A decides to water the garden, asking B and C if they'd like to join and help.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A, after the walk, sets up a stretching session in the living room for some light exercise.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to prepare a light snack for B and C to enjoy later in the day.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small picnic in the backyard for the three of them to savor their midday meals together.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is located in a sunny home kitchen with Agents B and C. The environment buzzes with the warmth of kinship and the smell of a hearty breakfast, presenting the possibility of various family-oriented activities.",
    "actions": [
      {
        "description": "Inviting Agents B and C to create a collaborative storybook using their drawings.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Proposing a game involving a collective pancake stack building challenge.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Offering to take a short walk to enjoy the outdoors.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Organizing a light yoga session for the household.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Preparing a special family recipe for lunch together.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Leading a discussion on planning a weekend getaway.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.8,
          0.0
        ]
      },
      {
        "description": "Initiating a playful pillow fight in the living room.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Arranging a competitive board game tournament.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Setting up a makeshift photo studio to take family portraits.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A gathers with Agent B and Agent C in the family kitchen for brunch preparations. The atmosphere is welcoming with sunlight, a breeze, and fragrant aromas.",
    "actions": [
      {
        "description": "Agent A prepares and shares a smoothie.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B for a workout.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows wider.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.3,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A organizes an indoor picnic.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a game marathon.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A plays music.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a cooking contest.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares a photo album.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to prepare a meal together.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a home kitchen, Agent A and Agent B are preparing a meal together, sharing stories and jokes in a lively and warm atmosphere, with the windows open to the spring breeze.",
    "actions": [
      {
        "description": "Agent A suggests to Agent B to create a new recipe together, experimenting with the ingredients they have on hand.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to prepare a surprise dessert to delight the family members with after dinner.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B plan an impromptu dance-off in the living room to their favorite music playlist.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A takes the lead in initiating a clean-up game post-meal to see who can tidy up the fastest, with a playful reward for the winner.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A fosters a moment of sharing by proposing that each family member tells a story or recent experience during the meal.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to go on a walk with the dog after dinner, benefiting from the evening air.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to join them in a session of light stretching or yoga in the living room for relaxation.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.3,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a board game night after dinner, selecting games that are known family favorites.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A convinces Agent B to tackle a challenging puzzle together, setting it up on the dining table.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, after a jog, joins Agent B and C for brunch on a patio, filled with hearty food and cheerful setup.",
    "actions": [
      {
        "description": "Agent A prepares special smoothies for everyone.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a game of charades.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a group photo.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers and applies sunscreen to Agent B and C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A encourages a discussion about future plans.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares an anecdote from their jog.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A refills Agent B's favorite fruit in the bowl.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a post-brunch walk.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A has returned home and spends a Saturday morning sharing breakfast with their family. The kitchen is lively with music, cooking, and conversation, creating a warm and engaging environment.",
    "actions": [
      {
        "description": "Agent A starts a spontaneous game of charades after breakfast.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites the family for a hike to explore a nearby nature trail.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests organizing a family photo.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A offers to wash the dishes, turning it into a playful water fight.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out an old board game to play with family.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a heart-to-heart conversation with Agent B.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with an upcoming school project.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sits outside with Agent D, listening to their stories.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.4,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B prepare a surprise snack.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A has planned a family Sunday brunch with care, ensuring the dining setting is inviting and everyone is involved in preparing it. The scent of freshly baked goods permeates the home, and there's an overall atmosphere of cooperative spirit as they look forward to the meal.",
    "actions": [
      {
        "description": "Agent A proposes a toast to celebrate family achievements.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to try a smoothie recipe.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A playfully throws a dish towel to Agent B for food plating.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A gathers everyone for a group photo with the meal.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A leads a game of \"highs and lows.\"",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a spontaneous dance.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A embraces Agent B warmly after brunch prep.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.4,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal story, fostering dialogue about memories.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk in the park post-brunch.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.5,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing dinner in the kitchen, Agent B is playing guitar in the living room, and Agent C enters the house after a jog. The atmosphere at home is warm and aromatic with food and music.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to join in cooking, turning meal preparation into a group activity.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A turns on upbeat music in the kitchen to enhance the cooking experience.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A decides to bake a surprise dessert for everyone.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a spontaneous mini-dance party in the kitchen.",
        "values": [
          0.0,
          0.5,
          0.0,
          1.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to express appreciation for the company and strengthen their bond.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A engages in conversation about favorite memories, reflecting on past joyful moments.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game of guessing the spices in dinner.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to create a new recipe with input from others.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests they all eat outside on the patio to enjoy fresh air and sunset.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "A parent and cooking enthusiast prepares a morning meal, playfully engaging with their family in a kitchen filled with laughter, warmth, and shared experiences.",
    "actions": [
      {
        "description": "Agent A decides to flip pancakes in an exaggeratedly flamboyant style to make the others laugh.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent B a spontaneous hug from behind as they pass by to grab more plates.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a friendly food arrangement competition to see who makes the most creative pancake presentation.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A jokingly serves a purposely under-decorated pancake to Agent D, who wanted to sleep in, eliciting playful banter.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A insists everyone talks about the highlight of their past week, leaving no one out of the conversation.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A starts a casual family meeting to discuss plans for the upcoming holiday while everyone enjoys breakfast.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A purposefully makes too many pancakes, knowing that Agents C and D love to have leftovers for a late-night snack.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares a funny and embarrassing childhood story of their own to make Agents C and D feel better about a recent awkward school event.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A enlists Agent C's help in preparing a special smoothie for Agent B who's been feeling under the weather.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a teenager in a household, contemplating post-lunch activities with their family; with each member engaged in their own peaceful pursuits.",
    "actions": [
      {
        "description": "Agent A invites their family to play a game together, fostering a spirit of togetherness.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to clean up the dining area, contributing to the family's environment.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent D in enhancing the music playlist.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A actively engages with Agent B by reminiscing over family photographs.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A refreshes themselves with a walk and shares the experience with their family.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests preparing a snack for everyone to delight in later.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes time to appreciate Agent C's artwork.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family storytelling moment with Agent B's book.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets up an indoor scavenger hunt for family enjoyment.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B, celebrating a special occasion at home, engage in activities that involve reminiscing, sharing affection, and creating new memories within their personal space.",
    "actions": [
      {
        "description": "Agent A proposes a toast to shared memories and future adventures.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A clears the dinner table for a spontaneous dance with Agent B.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A relives shared experiences by looking through an old photo album with Agent B.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A performs a cherished song on the guitar for Agent B.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B for a starlit walk outside.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A turns cleaning into play while tidying up the kitchen.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.6,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A presents Agent B with a handwritten letter filled with gratitude and love.",
        "values": [
          0.0,
          -0.3,
          0.0,
          1.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to create a dessert together in the kitchen.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a snug movie-watching spot for them to cuddle.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A wakes up to a lively household where a special brunch is being prepared by Agent B, with Agent C setting up the table. A playful dog and a sunny garden complete the warm scene.",
    "actions": [
      {
        "description": "Agent A helps Agent B with flipping pancakes while making jokes.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A creates a variety of smoothies for everyone at brunch.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A surprises the family by baking their favorite cookies.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decorates the table with fresh garden flowers.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A takes a run in the garden with the dog.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.6,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A captures brunch preparation moments for a family album.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A challenges everyone to a pancake topping art contest.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A tells Agent C to relax while she arranges the table.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.4,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A returns home for the weekend, greeted by her family and immediately immerses in the familial atmosphere, filled with conversation, warmth, and an ongoing board game.",
    "actions": [
      {
        "description": "Agent A offers to set the remainder of the table to aid Agent D.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a walk after dinner with the family along the beach.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to join her brother Agent B in his game.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to help Agent C finish preparing the meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family photo viewing after noticing the photo albums on the bookshelf.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests initiating a family ritual of sharing the highlights and challenges of their week over dinner.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help her brother with his homework later that evening.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a puzzle for the family to work on together later that night.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A plays her brother’s favorite music playlist to elevate the mood.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.9,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, lounges in the living room with Agent B, her partner, Agent C, her best friend, and Agent D, her younger brother. Agent B tidies the kitchen, Agent C strums a guitar, and Agent D brings a board game to play. The environment is filled with the aroma of food, laughter, music, and sunlight.",
    "actions": [
      {
        "description": "Agent A sets the dining table while humming.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A takes a playful selfie with everyone.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A serves fresh lemonade.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests moving the game outside.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages in playful banter with Agent D.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B clean up.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A composes a song with Agent C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A learns a new board game from Agent D.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, Agent B, and Agent C gather in an apartment for a dinner party, enjoying each other's company in a warm and inviting atmosphere, with pleasant activities planned.",
    "actions": [
      {
        "description": "Agent A proposes to start the board game while they wait for the food to finish cooking in the oven.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a toast to celebrate their enduring friendship, making sure everyone's glass is filled.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a group photo to commemorate the evening.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to serve the meal to Agents B and C, attentively filling their plates.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal anecdote that is both amusing and revealing, contributing to the light-hearted mood.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to swap favorite songs with Agent B and Agent C, playing DJ for the night.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A leads the group in a playful competition of who can tell the funniest joke.",
        "values": [
          0.0,
          0.5,
          0.0,
          1.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages a round of storytelling, asking Agent B and Agent C to share a memory.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A asks for feedback on the meal, sincerely interested in Agent B and C's thoughts and suggestions.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy living room, Agent A plays guitar while Agent B listens and hums, and Agent C cooks a wholesome dinner in the open kitchen.",
    "actions": [
      {
        "description": "Agent A offers to help Agent C with cooking dinner.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family board game after dinner.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A has a heartfelt conversation with Agent B.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B to play a tune on the guitar.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously sets up the dining table.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A does the dishes after dinner.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A looks at family albums with B and C.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B cooking skills.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plans an indoor camping night.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A prepares a family breakfast, Agent B sets the table, Agent C suggests a new pancake flavor, and Agent D anticipates food, with an open window bringing fresh air and sunlight.",
    "actions": [
      {
        "description": "Agent A presents the pancakes with excitement about the new flavor.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a funny pancake shape game.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A prepares the suggested pancake flavor.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A lets Agent D outside to play.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.4,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A encourages sharing daily anticipations.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family walk.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A reveals a special pancake ingredient.",
        "values": [
          0.0,
          -0.3,
          0.0,
          1.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A turns on enjoyable music.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a culinary enthusiast, is in a lively kitchen with fresh air flowing through large windows. The aroma of baking bread fills the room, and Agent B is reading at the island. Agent C is preparing a salad for brunch, where Agent D will soon join the group. Agent A is excited to share the freshly made bread.",
    "actions": [
      {
        "description": "Agent A carefully takes the bread out of the oven and places it on a cooling rack.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.3,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A turns to Agent B and invites them to help set the table for the upcoming meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent C a taste test of the bread once it has cooled down.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A opens more windows to allow more fresh air into the kitchen.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to choose a new playlist that better suits the lively mood in the kitchen.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A engages in lighthearted banter with Agent B while arranging the dishes on the table.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A affectionately hugs Agent C from behind, expressing gratitude for the effort put into making the salad.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A decides to make fresh mint lemonade as an addition to the meal.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C share a playful dance in the kitchen to the music.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A arrives home from school and is greeted by the warm setting of their household, featuring delightful aromas and an inviting atmosphere created by the family members’ individual activities. The family engages in various tasks separately, yet the environment suggests a coming together for shared experiences.",
    "actions": [
      {
        "description": "Agent A decides to join Agent C on the floor and help with making the card.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table for dinner, placing the utensils and the homemade meal onto it.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A grabs a soccer ball and invites Agent C to play a game in the garden.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sits by the open window for a few minutes, taking in the fresh air and sounds from outside.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.3,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B if there's anything that can be done to help with baking the cookies.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the kitchen to fill a glass of water from the pitcher to stay hydrated.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A pulls up a chair next to Agent B to learn more about baking and possibly decorate some cookies.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A brings the cookies and meal outside to have a family picnic dinner in the garden.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a 20-minute power nap to recharge after the school day.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.2,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In the cozy confines of their sunlit kitchen, Agent A attentively prepares family brunch, while Agent B plays the guitar and Agent C arranges flowers. They enjoy the breezes and sounds of nature from the garden.",
    "actions": [
      {
        "description": "Agent A decides to flip the pancakes using an intricate wrist-flick technique, aiming to impress Agents B and C.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.3,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A begins a game of guessing the herbs and spices added to the meal with Agents B and C, relying only on the aroma and taste.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes the initiative to teach Agent C how to execute a recipe, sharing personal culinary tips and tricks.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A, with a spontaneous burst of joy, sweeps Agent B into an impromptu dance around the kitchen.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a blind taste test challenge for Agents B and C, using the freshly prepared brunch items.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to share stories about their most memorable meals while they eat.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A orchestrates a group cleanup effort after the meal, turning the task into a playful competition.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a food presentation contest, judging based on creativity and aesthetic appeal before they dive into eating.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A promotes a brief session of light stretching exercises together after the brunch to aid digestion.",
        "values": [
          0.0,
          0.3,
          0.0,
          -0.2,
          -0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agents A, B, and C gather in the family room for a smoothie-making session with fresh ingredients, open windows, sunlight, and light music.",
    "actions": [
      {
        "description": "Agent A proposes a family game where each member creates a unique smoothie recipe.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help mix the ingredients.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to record the smoothie-making process and family chat.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a quiet moment with Agent B, providing a shoulder rub and conversation.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a spontaneous dance-off with Agent C.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the dining area for dinner, involving the family.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests each family member shares their favorite moment of the day.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A notices Agent B's stress and offers support.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.3,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C take a walk outside for fresh air.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.4,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, and Agent B celebrate their anniversary at home with a prepared meal, surrounded by the laughter of their playing children, Agents C and D, on the back porch.",
    "actions": [
      {
        "description": "Agent A raises a toast to Agent B for their many years together, holding a glass of wine with a warm smile.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a special dish in the kitchen for Agent B that requires attention and care in its assembly.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B exchange heartfelt gifts that hold personal significance to their relationship.",
        "values": [
          0.0,
          -0.1,
          0.0,
          1.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug with Agent B and the children, bringing everyone close together in a warm embrace.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a comfortable lounging area with cushions and blankets for a family movie night.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A surprises Agent B with a scrapbook filled with memorable photos and notes from their ten years together.",
        "values": [
          0.0,
          -0.5,
          0.0,
          1.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A, noticing Agent B looks a bit cold, fetches a cozy sweater and gently wraps it around their shoulders.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers a dance to Agent B in the living room to a song that was played on their wedding day.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a middle-aged parent, prepares a Sunday breakfast in a sunny, spacious kitchen, humming a familiar tune. Agent B, the spouse, is setting the table, occasionally exchanging a playful smile and joining in the melody. Agent C, their teenager, is busy arranging the terrace chairs outside for a planned family meal under the open sky. The smell of fresh pancakes wafts through the air, mixing with the light fragrance of blooming flowers from the garden.",
    "actions": [
      {
        "description": "Agent A decides to surprise the family by making their special recipe smoothie.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a spontaneous dance with Agent B in the kitchen.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A calls Agent D, a close relative, to join them for breakfast and share the morning.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a morning walk with the family after breakfast.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.3,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a group hug with Agent B and Agent C before eating.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A brings in fresh berries from the garden to add to the pancakes.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares funny anecdotes from their youth with Agent B and Agent C.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent C some kitchen tasks to teach cooking skills.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to sit next to Agent C, showing interest in their school projects.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "The living room of a cozy suburban home is bathed in the soft glow of the afternoon sun. Agent A, a devoted parent, is lounging on the couch, surrounded by books and board games. Agent B, their partner, leans against the kitchen counter, chopping fresh vegetables and fruit for a nutritious snack, while the smell of baked bread wafts through the air. Agent C, their child, is sprawled on the floor, absorbed in drawing an intricate family portrait with colorful crayons and paper. The atmosphere is comfortable and welcoming, punctuated by the occasional laughter and chit-chat, as the family unwinds on a peaceful weekend.",
    "actions": [
      {
        "description": "Agent A decides to join Agent C on the floor, picking up crayons to add to the family portrait.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A gets up to help Agent B in the kitchen, suggesting they try a new recipe together for dinner.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a spontaneous game of charades, drawing both Agents B and C into a playful competition.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A wraps up Agent C in a big, warm hug after complimenting the child's drawing skills.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.9,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a board game on the coffee table, inviting everyone for a round of play.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A reaches for their phone to capture a candid photo of the family enjoying their day together.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a short outdoor stroll to enjoy the fresh air and stretch their legs.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about everyone’s favorite memories, listening attentively and sharing their own.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that they all participate in baking a new dessert recipe, making sure everyone has a role.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young parent, swings open the back door of the family home to reveal a sunlit garden where Agent B and Agent C, A's spouse and child respectively, are playing. They've spread out a variety of colorful fruits and a pitcher of water on a blanket for a spontaneous picnic.",
    "actions": [
      {
        "description": "Agent A decides to join in the game by tossing grapes to Agent B and laughing together.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A captures the fun moments on a camera to create lasting memories.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A picks up a slice of watermelon and shares it with Agent C, enjoying the juicy refreshment together.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to race to the nearest tree and back to exercise a bit.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.5,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B to lie on the blanket and cloud-watch, commenting on the shapes they see.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A gathers the family to take a group photo, ensuring everyone is close and smiling.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about each other's day, promoting open dialogue and bonding.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A hugs Agent C after the child shares a story about their day at school.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a mini competition of who can make the funniest fruit face, creating a game for them.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.8,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, prepares a wholesome meal with roommates Agent B and Agent C, filled with laughter, cooking, and shared stories, in a warm and music-filled kitchen.",
    "actions": [
      {
        "description": "Agent A proposes to play a board game after dinner to continue the bonding experience.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a group fitness challenge for the following week to keep each other motivated.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about rotating cooking days to explore more recipes together.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.6,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to join them for a weekly grocery run to choose ingredients for future meals.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to choose the next playlist to enhance the atmosphere for their next gathering.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to clean up the kitchen post-dinner as a show of gratitude for the shared company.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.3,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers leftover food to Agent C to take to their room, knowing they often skip meals when studying.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.2,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A creates a chat group with Agents B and C for coordinating activities and maintaining communication.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A gets out their favorite dessert recipe, suggesting they all bake it together later in the week.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a kitchen with natural light streaming through open windows, Agent A prepares a meal with fresh vegetables and spices. Agent B washes fruits, while Agent C selects a recipe. The room buzzes with activity and the scent of freshly prepared food.",
    "actions": [
      {
        "description": "Agent A prepares a nutritious family dinner.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a cooking competition.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a surprise picnic.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A has a dance-off while cooking.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A appreciates family's company.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.6,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to finish cooking alone.",
        "values": [
          0.0,
          0.3,
          0.0,
          -0.2,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C create new recipes.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets a call with a relative.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A creates a meal plan.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.1,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A arrives home to find Agent B preparing dinner, with Agent C setting the table and Agent D listening to music.",
    "actions": [
      {
        "description": "Agent A makes a healthy smoothie for the family.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C fold napkins into shapes.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a post-dinner family walk.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares a light-hearted story from their day.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent D to play a new song.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a game of charades.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B's cooking.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests creating a new recipe together.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to wash dishes after dinner.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.2,
          0.4,
          0.0
        ]
      }
    ]
  }
]