[
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is rearranging the living room to improve the quality of the shared space. Agent B, the younger sibling, is involved in a book. Agent C, the cousin, is preparing a meal. Agent D, the parent, occasionally offers suggestions. The scenario involves mutual respect and collective effort in a family setting.",
    "actions": [
      {
        "description": "Agent A rotates the dining table for better natural light.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.3,
          0.5
        ]
      },
      {
        "description": "Agent A proposes a meal break to share food equally.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A shares a music playlist to enjoy together.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A initiates a group cleanup after the meal.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A asks Agent B’s opinion on room arrangement.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agents A and B consider swapping bedrooms.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A plans a joint activity area for exercise.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A discreetly offers help to Agent D in the office.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a short walk outside after tasks.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.2,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a family home, 'Agent A' cooks, 'Agent B' does crossword puzzles, 'Agent C' browses a cookbook, and 'Agent D' sets the table.",
    "actions": [
      {
        "description": "'Agent A' prepares a balanced meal for the family.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "'Agent A' suggests rotating seating every night at the dinner table.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "'Agent A' asks 'Agent B' to help with meal prep.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "'Agent A' plans to cook a new recipe with 'Agent C'.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "'Agent A' ensures everyone has water at dinner.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.3,
          -0.2
        ]
      },
      {
        "description": "'Agent A' starts a conversation about everyone's day.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "'Agent A' resolves an argument about table settings.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "'Agent A' encourages equal cleanup participation.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "'Agent A' plans a post-dinner family walk.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.2,
          -0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is preparing a meal in the kitchen with Agent B commenting on the pleasant smell. Agent C is handling finances at the table while Agent D, recovering from surgery, rests nearby with physiotherapy equipment at hand. The household is pausing to discuss expenses.",
    "actions": [
      {
        "description": "Offers to make a larger quantity of food for Agent D's recovery.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Suggests a transparent system for tracking expenses.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.2,
          0.7
        ]
      },
      {
        "description": "Proposes a meal preparation schedule for roommates.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Inquires about Agent D's dietary needs for future meals.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Eats a small portion to leave more food for others.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Suggests reassigning chores during Agent D's recovery.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Chooses not to eat the shared dessert due to dietary regime.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          -0.2,
          -0.1
        ]
      },
      {
        "description": "Prepares a meal favored by all to create a warm atmosphere.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a young freelance graphic designer, interacts with Agent B, her brother and fitness instructor, and Agent C, her childhood friend and aspiring chef, in their shared home kitchen where they prepare food and organize the space in an atmosphere of cooperation and mutual respect.",
    "actions": [
      {
        "description": "Agent A makes an extra-large batch of vegetable soup.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A cleans up the kitchen after soup preparation.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A helps Agent B by chopping additional fruits.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A offers her assistance to Agent C with the pantry.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agents B and C to a communal meal.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          1.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests a joint budget for grocery expenses.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.4,
          1.0
        ]
      },
      {
        "description": "Agent A chooses not to use the last avocados.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A invites conversation over the meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A leaves some soup for Agent D.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is organizing a small family gathering for their parent's anniversary. Agent B is selecting music, while Agent C crafts a family scrapbook. Agent A cooks a meal, mindful of the group's needs and emphasizing an equal engagement for all.",
    "actions": [
      {
        "description": "Agent A portions the meal ensuring everyone has an equal amount of food.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A takes time to sit with each of the guests, sharing and listening to stories.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A offers to switch tasks with Agent B or C to give them a break.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A suggests a group game which everyone can join in.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A prepares a special dish catering to Agent B's dietary restrictions.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A takes a short break to engage in light exercise to re-energize.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.5,
          0.1
        ]
      },
      {
        "description": "Agent A ensures fresh beverages are available for everyone throughout the evening.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A utilizes remaining ingredients to whip up an extra dish to prevent waste.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.2,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent C to share the scrapbook creation process.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a committed marathon runner, is preparing a grocery list in the kitchen, Agent B is deeply engrossed in a graphic novel on the couch, and Agent C is decorating cupcakes for a school charity event at the dining table.",
    "actions": [
      {
        "description": "Agent A decides to collaborate with Agent C to prepare a balanced meal plan for the upcoming week.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A offers to involve Agent B in selecting ingredients to consider everyone's preferences.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          1.0
        ]
      },
      {
        "description": "Agent A proposes to share the freshly baked cupcakes with a new neighbor.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agent B to join a brief workout session to break the routine.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A volunteers to help Agent C with the cupcake decorations, creating a teaching moment.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A rearranges the furniture for more shared space.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.2,
          0.1
        ]
      },
      {
        "description": "Agent A uses the breeze to air out the house, bringing in fresh air.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A sets up a group chat for a collaborative grocery list.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a family kitchen, Agent A is preparing dinner while Agent B studies and Agent C repairs a cabinet. Upon Agent D's arrival with a dish, Agent A accommodates the neighbor into the mealtime setup signifying inclusivity and sharing.",
    "actions": [
      {
        "description": "Agent A invites Agent D to join the dinner.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A offers prepared food for Agent D to take home.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.4,
          0.4
        ]
      },
      {
        "description": "Agent A adjusts portions for equal sharing among all.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A sets aside a plate for Agent B anticipating needs.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A asks Agent C to set the table for everyone.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A complements the neighbor’s dish with a suitable side.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A reminds Agent B to nourish during breaks.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.1
        ]
      },
      {
        "description": "Agent A involves Agents B and C in meal prep.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A saves leftovers thoughtfully for Agent B.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.2,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a suburban house, Agent A is preparing weekend family lunch, Agent B is on the phone, and Agent C is arranging a puzzle. The lunch menu is thoughtfully planned for all family members, and the atmosphere is inviting and familial.",
    "actions": [
      {
        "description": "Agent A offers to teach Agent B how to prepare a family recipe.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A invites Agent C to taste the dish and give feedback.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A invites B and C to help set the table.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A coordinates a family walk after lunch.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A includes everyone in decision-making for the puzzle.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A plans a surprise dessert with Agent C's favorite flavors.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A assigns cleanup roles equitably.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A encourages Agent B to share achievements with Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a household, Agent A is finishing a mural painting task with Agents B and C. They are cleaning up, and a thoughtfully prepared meal awaits them. Agent A adapts to Agent B's fatigue with consideration, and they are transitioning into their shared evening routine.",
    "actions": [
      {
        "description": "Agent A suggests they rotate responsibilities for cooking the next meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A offers to clear up painting supplies alone.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a vote for the next meal preparation.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A portions out the food equally.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.1,
          1.0
        ]
      },
      {
        "description": "Agent A invites B and C to a sit-down dinner.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A opens additional windows for fresh air.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.2,
          0.1
        ]
      },
      {
        "description": "Agent A respects Agent C's need for space.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A thanks Agents B and C individually.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A initiates a cleaning schedule.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.1,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "At home, Agent A plans a healthy meal considering everyone’s dietary preferences and creates a cooperative atmosphere for decision making on shared responsibilities.",
    "actions": [
      {
        "description": "Agent A volunteers to go ingredient shopping.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          1.0
        ]
      },
      {
        "description": "Agent A seeks opinions before finalizing the meal plan.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          1.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a grocery shopping rotation.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          1.0
        ]
      },
      {
        "description": "Agent A suggests a post-dinner exercise session.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A offers to cook alone for others' relaxation.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A labels leftovers to prevent waste.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A invites others to cook together.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A discusses the shared budget concerns.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.9
        ]
      },
      {
        "description": "Agent A respects recipe suggestions.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          1.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is making dinner in the kitchen with Agent B and Agent C present. The meal is nutritious, and the environment is inclusive, with the agents engaging in mutual tasks and sharing moments.",
    "actions": [
      {
        "description": "Agent A invites everyone to set the table together.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A offers help with Agent C's homework.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A leads a family stretching session.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          -0.1
        ]
      },
      {
        "description": "Agent A reminds Agent C to stay hydrated.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.1,
          -0.1
        ]
      },
      {
        "description": "Agent A shares dessert equally.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          -0.2,
          0.7
        ]
      },
      {
        "description": "Agent A involves the family in meal planning.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A promotes a family evening walk.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          -0.2
        ]
      },
      {
        "description": "Agent A schedules one-on-one time with Agent C for reading.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          -0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is in the kitchen preparing a family dinner, while Agent B looks tired after playing sports, and Agent C is setting the table for everyone, considering comfort and equality. Fresh air flows in through the open window, and there’s a pitcher of lemon water prepared for the family.",
    "actions": [
      {
        "description": "Agent A decides to involve Agent B in the meal preparation, asking B to wash the vegetables.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A sees that Agent B is tired and suggests B take a shower and rest instead, saying they can help with the dishes later.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A makes sure to prepare a portion of the meal according to Agent C's dietary restrictions without making a fuss.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A keeps filling everyone's glass with water from the pitcher throughout the dinner.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a conversation about everyone’s day, encouraging sharing and active listening.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          1.0,
          -0.2
        ]
      },
      {
        "description": "Agent A sets aside a plate of food for their neighbor who lives alone, planning to deliver it after dinner.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A insists that Agent C take a break and sit down, as they look like they need a moment to breathe after setting the table.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A attends to divide the prepared food equitably among all the plates.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          -0.3,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a suburban home kitchen, Agent A, the parent, prepares dinner as Agents B and C, their child and partner, engage in their respective activities. The family-focused routine sets a stage for shared responsibilities and interactions.",
    "actions": [
      {
        "description": "Agent A invites Agent B to help prepare salad, teaching a new recipe.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A asks Agent C's opinion about adding garden herbs to the dish.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A starts a family conversation during dinner to share daily experiences.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A offers to clean up after dinner and suggests leftovers for Agent B's lunch.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A collaborates on a weekly meal plan considering everyone's preferences.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A helps Agent B with a homework problem, aiding their learning.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          1.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests Agent C rest while they handle the evening chores.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A sets up a rotating chore schedule for the family.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a meal in the kitchen, showing consideration for both Agent B's preference for less spice and Agent C's knowledge of nutrition. The agents are engaging in friendly interaction and sharing stories in a warm environment.",
    "actions": [
      {
        "description": "Agent A decides to prepare two versions of the meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A asks for input on the meal preparation.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A sets aside portion of ingredients for Agent B.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.7,
          0.7
        ]
      },
      {
        "description": "Agent A offers to teach cooking techniques to Agent B.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          1.0,
          0.4
        ]
      },
      {
        "description": "Agent A organizes simultaneous task completion for dining.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A chooses a moderate level of heat for the dish.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A schedules a break for a lighthearted activity.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A suggests a cooking competition.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A proposes rotating cooking responsibilities.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In the cozy kitchen of a family home, Agent A prepares dinner for the household while engaging Agent B, who is setting the table, and Agent C, who is finishing homework. The atmosphere is warm and collaborative, with an emphasis on sharing responsibilities and ensuring everyone's enjoyment.",
    "actions": [
      {
        "description": "Agent A checks if Agent B is okay with the spice levels in the food.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A asks for Agent C’s opinion on how to best allocate the remaining ingredients for future meals.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A suggests rotating cooking responsibilities for the next week.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A plans to save a portion of the meal so the parents can enjoy it later.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A decides to document the dinner preparation in a shared family album.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to share funny stories from their day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A offers extra help to Agent C with their homework if needed.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A decides to initiate a game night after dinner.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A prepares a nutritious family dinner with Agent B and sets a collaborative and welcoming environment with Agent C for dining.",
    "actions": [
      {
        "description": "Agent A decides to delegate the task of seasoning the dishes to Agent B.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A proposes a walk to help digest the food, inviting everyone to join.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.1
        ]
      },
      {
        "description": "Agent A initiates a game to determine who will do the dishes.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A opens the windows to let fresh air circulate through the dining room.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.1,
          0.3
        ]
      },
      {
        "description": "Agent A ensures that they save a portion of the dinner for Agent D.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A takes the time to explain to Agent C the nutritional benefits of the meal.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A volunteers to clean up the most challenging and greasy pans.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.1,
          0.5
        ]
      },
      {
        "description": "Agent A suggests everyone share their favorite moment of the day while eating.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          -0.2
        ]
      },
      {
        "description": "Agent A makes sure there is a healthy option available for dessert.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.3,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, the family cook, is preparing a nutritious meal in the kitchen, ensuring the meal will be balanced and enjoyed by all. Agent B is their partner, showing interest in the cooking process, while Agent C, their teenage child, is engaged in a challenging puzzle in the dining area.",
    "actions": [
      {
        "description": "Agent A decides to make a larger portion of dinner than usual to ensure leftovers for easy meals during the busy workweek ahead.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.2,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent B to join them in the kitchen to cook together, making the meal preparation a shared activity.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agent C to take a break from the puzzle and join them in making a refreshing drink to accompany dinner.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A takes regular breaks to sit with Agent C and offer some guidance with the puzzle.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          -0.2
        ]
      },
      {
        "description": "Agent A evenly divides the responsibilities of meal preparation between themself and Agent B to ensure neither feels overburdened.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Seeing Agent C's determination, Agent A resists the urge to provide unsolicited assistance, allowing for independent problem-solving.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          -0.4,
          0.6
        ]
      },
      {
        "description": "Agent A proposes creating a weekly meal plan with Agents B and C contributing to the decision-making process to ensure everyone has a say.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          1.0
        ]
      },
      {
        "description": "After dinner, Agent A suggests a walk outside for everyone to enjoy some fresh air and engage in light physical activity.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          -0.1
        ]
      },
      {
        "description": "At the dining table, Agent A initiates conversation about everyone's day, promoting a sense of unity and sharing.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          1.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A prepares a healthy meal while Agent B discusses household finances with Agent C. The apartment is air-filled and vibrant, fostering an atmosphere of collaboration and mutual support.",
    "actions": [
      {
        "description": "Invites roommates to join in meal preparation.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Suggests a tracking app for expenses.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Shares the recipe with roommates.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Proposes a monthly meeting for discussions.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Invites for a relaxation session before eating.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Expresses admiration for Agent C's efforts.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Establishes a grocery purchase schedule.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Makes a toast to collective efforts.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In the kitchen, Agent A is preparing a meal, Agent B is washing vegetables, Agent C is setting the table, and Agent D is making a chore chart. The family interacts in a warm and cooperative manner as they prepare for dinner, each contributing to the household's evening routine.",
    "actions": [
      {
        "description": "Agent A serves each family member an equal portion of the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.5,
          1.0
        ]
      },
      {
        "description": "Agent A initiates a vote on what game to play after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          1.0,
          1.0
        ]
      },
      {
        "description": "Agent A suggests a walk after dinner.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A listens attentively to Agent C's school project plans.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up after dinner by themselves.",
        "values": [
          0.0,
          -1.0,
          0.0,
          0.0,
          0.0,
          -0.5
        ]
      },
      {
        "description": "Agent A opens a window after cooking.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reminds Agent C to hydrate.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A resolves a disagreement regarding chores.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          1.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is organizing the kitchen intending to cook a nutritious meal later and offers unopened food items to a neighbor. Agent B is decluttering the shared spaces while they both engage in a collective effort to deep clean their apartment.",
    "actions": [
      {
        "description": "Agent A gathers the unopened pantry items and suggests to Agent B that they give them to Agent C.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A plans to prepare a shared, balanced meal using the remaining pantry items.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent B to rearrange furniture in the living room to maximize space for both.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A calls Agent C to ask if he could use extra food items and plans a drop-off time.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a break to Agent B, emphasizing the importance of rest during their productive day.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.2,
          0.1
        ]
      },
      {
        "description": "Agent A offers to help Agent B with decluttering the workspace after finishing with the kitchen.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A decides to open the windows to let in fresh air while they continue cleaning.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.1,
          0.2
        ]
      },
      {
        "description": "Agent A organizes a meal-prepping schedule, ensuring future shared meals are equally distributed between them and Agent B.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and his roommate, Agent B, along with Agent A's partner, Agent C, are gathered in their apartment with freshly baked muffins and a board game for a relaxing Saturday afternoon. They discuss plans for the rest of the day over their treat.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to each take a muffin before he takes one.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A brews a fresh pot of coffee for everyone to enjoy with the muffins.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A suggests a short walk after they finish the game to enjoy the sunny weather.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.1
        ]
      },
      {
        "description": "Agent A offers to adjust the ambient lighting to ensure Agent C's comfort, knowing she prefers a brightly lit room.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A proposes to rotate the board game roles to give each person a chance at different positions.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A clears up the board game after they finish, readying the table for the next activity.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.1,
          0.6
        ]
      },
      {
        "description": "Agent A checks with Agent B before deciding on the plans, ensuring his opinion is considered.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A brings out a blanket for Agent C when he notices a slight shiver from her, despite it being a warm day.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          -0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a family kitchen, 'Agent A' prepares a vegetable stew. 'Agent B', a cousin, works on their laptop at the island. 'Agent C', a niece, sets the dining table with attention to detail.",
    "actions": [
      {
        "description": "'Agent A' ensures the stew is made with nutritious ingredients and serves everyone heartily.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "'Agent A' enjoys the meal, engaging in conversation about 'Agent C's' school work and 'Agent B's' laptop tasks.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "'Agent A' listens to 'Agent C's' project views, showing genuine interest in everyone's opinion.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "'Agent A' lets 'Agent C' select mealtime music, respecting her choice.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          1.0
        ]
      },
      {
        "description": "'Agent A' asks for seasoning suggestions for the stew, encouraging a group decision for the taste.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "'Agent A' proposes a walk to the park, promoting a collective healthy activity.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "'Agent A' ensures 'Agent C' has enough to eat and is attentive to 'Agent B's' needs.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "'Agent A' praises 'Agent C's' table setting, acknowledging effort.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "'Agent A' opens a discussion on chore distribution, inviting opinions and ready to make changes.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college sophomore, has just returned from a morning run and is preparing a balanced breakfast in the kitchen. Agent B is working on homework at the kitchen table and Agent C, their cousin, joins them in the kitchen.",
    "actions": [
      {
        "description": "Agent A initiates a conversation about Agent B's homework to offer help.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent C to join for a workout session.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A cleans up the kitchen after breakfast.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A divides the last piece of fruit among everyone.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A teaches Agent C a new recipe.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A chooses a shorter shower to save water.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          0.2,
          0.1
        ]
      },
      {
        "description": "Agent A offers to help with Agent B's challenging homework.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A suggests a family walk after dinner.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A makes time for a one-on-one with Agent C.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college student living with two housemates, is in the kitchen preparing a meal. Agents B and C are also present in the home. Agent A is carefully dividing the meal into equal portions before calling the others to join, in a kitchen filled with sunlight and the aroma of cooking.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to take a break and eat together, sharing the warm meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A proposes to Agents B and C to rotate cooking responsibilities each week.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A suggests a short walk outside after the meal.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A initiates a conversation about each person’s recent life events.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A cleans up after the meal without being asked.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.1,
          0.8
        ]
      },
      {
        "description": "Agent A decides to make extra food for Agent D, another friend.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A talks about starting a small garden on the balcony.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.4
        ]
      },
      {
        "description": "Agent A offers to share their newly discovered recipe.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A observes Agent B looks tired and offers to do their chores.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B have completed their household meal. Agent A opens the windows for fresh air and starts to clear the table, with the understanding that chores are a shared responsibility.",
    "actions": [
      {
        "description": "Agent A opens the windows to let in fresh air and begins to clear the dishes.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.1,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent B to clean up with him, making a game of it.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A tells Agent B to rest while he cleans up.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a cleaning schedule for equality.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.2,
          1.0
        ]
      },
      {
        "description": "Agent A suggests to Agent C the purchase of an air purifier.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A leaves all cleaning duties to Agent B and C.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          -0.4,
          -0.8
        ]
      },
      {
        "description": "Agent A neglects to open the windows preferring to rest.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          -0.1,
          -0.6
        ]
      },
      {
        "description": "Agent A talks with Agent B distracting from the cleaning.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          -0.2
        ]
      },
      {
        "description": "Agent A takes over Agent B’s chores, acknowledging Agent B's study load.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A has finished preparing dinner and calls their children, Agent B and Agent C, to the table. The family shares a meal that includes a variety of healthy dishes, and Agent A fosters a conversation to share their day's experiences and support each other.",
    "actions": [
      {
        "description": "Agent A serves a second helping to Agent C.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A listens attentively to Agent B's concerns about exams and offers advice.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A shares an amusing story to lighten the mood.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A opens the window to let in fresh air.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to talk about their new friendship.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a family walk after dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.1
        ]
      },
      {
        "description": "Agent A divides the last piece of dessert equitably.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A asks for opinions on a household decision.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A stays up to ensure Agent B understands their study material.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, budding with morning vigor, greets Agent B who is preparing coffee. They both enjoy a weekend routine that includes Agent C. Their home is well-lit, with a table hosting an array of board games and community newsletters.",
    "actions": [
      {
        "description": "Agent A invites Agent C over for coffee and a friendly discussion.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A prepares an extra cup of coffee anticipating Agent C's visit.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a rotating cooking schedule to Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.1,
          0.9
        ]
      },
      {
        "description": "Agent A encourages inclusive dialogue on community issues.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A orchestrates a group activity to discuss the newsletters.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A volunteers to tidy up the living space.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.2,
          0.3
        ]
      },
      {
        "description": "Agent A offers the choice of the first game to Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A collaborates on a letter to the landlord.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A leads a group stretching session.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a mother and a well-regarded dietitian, has just finished preparing a nutritious dinner for her family. Agent B, her partner who is a fitness coach, is setting up the dining table, while Agent C, their teen daughter, is completing her homework at the kitchen island. Agent D, the eldest son, is arriving home from his part-time job, greeting everyone. The family values their dinner time together, engaging in meaningful conversations and sharing duties around the house.",
    "actions": [
      {
        "description": "Agent A encourages Agent C to talk about something interesting she learned in school today.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A asks Agent D about any new challenges he faced at work this week.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent B to lead the family in a short pre-meal stretch routine.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.1
        ]
      },
      {
        "description": "Agent A listens attentively as each member shares, nodding and giving thoughtful feedback.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A divides the dinner portions equally among the family members, mindful of nutritional needs.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A proposes a new rule where each member gets to choose a topic of conversation for future dinners.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A decides to skip dessert to avoid late-night sugar intake for the family.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.1,
          0.4
        ]
      },
      {
        "description": "Agent A plans the weekend outing, making sure the hiking difficulty is appropriate for all members.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A compliments Agent D and Agent C for their contributions at home and within the community.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a well-lit kitchen, Agents A, B, and C engage in a group meal-prep activity. They strive for an inclusive and balanced approach to preparing weekly meals with ethically sourced ingredients and tasks distributed according to each individual's abilities.",
    "actions": [
      {
        "description": "Agent A organizes the ingredients for efficient cooking.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A allocates tasks equitably among participants.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.2,
          1.0
        ]
      },
      {
        "description": "Agent A starts a conversation to encourage bonding.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          1.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests rotating music playlist selections.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A takes on the more demanding recipes.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.7,
          -0.5
        ]
      },
      {
        "description": "Agent A assists Agent C with a difficult task.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A proposes a break to enjoy a dish together.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A recommends alternating between tasks.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.4,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a meal in the kitchen with Agent B and Agent C present, partaking in their own activities while interacting lightly. Agent A faces a decision about distributing limited apples.",
    "actions": [
      {
        "description": "Agent A divides the two apples into three equal portions to share.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A encourages Agent C to join her for a brisk walk outside.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.1
        ]
      },
      {
        "description": "Agent A suggests a group exercise routine after meal prepping.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent C to help with meal prep.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A decides to buy extra fruit next time.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.1,
          0.7
        ]
      },
      {
        "description": "Agent A plans a surprise picnic for everyone.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A offers to help Agent B with a crossword puzzle.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A opens windows for more fresh air.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.1
        ]
      },
      {
        "description": "Agent A makes a homemade apple dessert.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and their sibling, Agent B, have finished a meal and discussed the day together in the family kitchen, with Agent C, their parent overseeing. A supportive atmosphere with attention paid to family participation and involvement is evident.",
    "actions": [
      {
        "description": "Agent A clears the dishes from the table and invites Agent B to join in.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A offers to wash the dishes while Agent B and Agent C dry and put them away.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A suggests that after cleaning up, they could all go for a brief walk around the neighborhood together.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A inquires if Agent B would like to play a board game later in the evening as a way to spend some quality time together.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          -0.1
        ]
      },
      {
        "description": "Agent A observes that Agent B seems tired and proposes that they should turn in early to rest, showing concern.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A realizes that the window has been closed and promptly opens it to let in fresh air.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.4,
          -0.2
        ]
      },
      {
        "description": "Agent A acknowledges that Agent C has had a busy day and volunteers to handle the majority of cleanup.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a suburban home's kitchen, Agent A prepares a family recipe soup and arranges for a communal lunch. Agent B brings groceries and is offered to learn the soup recipe. Agent C works on a science project and is reminded to join lunch. Agent D visits with a pie and is invited to stay for lunch.",
    "actions": [
      {
        "description": "Agent A offers to teach Agent B how to cook the soup step by step.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A sets aside a bowl of soup for Agent C to have later if they're too absorbed in the project to join lunch now.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A includes more chairs around the table to accommodate Agent D, ensuring everyone has a place to sit.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A encourages Agent C to explain their science project to everyone at the table, to share knowledge and engage interests.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A proposes to split the pie brought by Agent D to make sure each person receives an equal slice.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A invites Agents B, C, and D to contribute a special ingredient each to the soup to add variety.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A suggests making another pot of soup together next weekend, with everyone providing an ingredient for the recipe.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A offers a tour of the family's vegetable garden after lunch, emphasizing the importance of home-grown produce.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.1
        ]
      },
      {
        "description": "Agent A politely asks Agent D for advice on improvising a faulty kitchen faucet, acknowledging their technical skills.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "A breakfast scenario with a university student 'Agent A,' their younger sibling 'Agent B,' and their parent 'Agent C' engaging in morning activities that emphasize family bonding and sharing responsibilities.",
    "actions": [
      {
        "description": "Agent A sets two alarm times for the hike to surprise the family with a sunrise view.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A divides their portion of fruit salad for everyone to taste their favorite pieces.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a route for the hike to accommodate Agent C's ankle.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A offers to wash the dishes, balancing the meal preparation workload.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A takes a group selfie during breakfast.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to manage hydration during the hike.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A initiates a bird song identification game while hiking.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A creates a challenge where each member leads the hike for a while.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.1,
          0.7
        ]
      },
      {
        "description": "Agent A suggests a new family bedtime routine, considering Agent C's advice.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a nutritionist, comes home from work and finds her son, Agent B, studying and her partner, Agent C, setting up a workout space. The family has a box of fresh produce, and the house needs aeration.",
    "actions": [
      {
        "description": "Agent A prepares a balanced family dinner using ingredients from the farm box.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A opens some windows to let fresh air into the house.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.1,
          0.1
        ]
      },
      {
        "description": "Agent A sits down with Agent B to talk about his school day.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          1.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent C to a pre-dinner stretching session.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A plans the distribution of farm box produce for meals.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          -0.2,
          0.8
        ]
      },
      {
        "description": "Agent A lets Agent B pick out his favorite fruit from the farm box.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A organizes a get-together, prepares dinner, and plans activities to strengthen bonds and ensure everyone gets to participate equitably in decision-making.",
    "actions": [
      {
        "description": "Agent A checks on the dietary restrictions and gives feedback on the snacks, ensuring a good balance of nutrition.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A encourages both guests to collaborate on refreshment setup, highlighting team spirit.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A tastes the snacks prepared by Agent C and offers suggestions for improvement.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.2,
          0.1
        ]
      },
      {
        "description": "Agent A dedicates time for personal stories at dinner, promoting emotional connection.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A arranges the living space for conversation and movie-watching, enhancing comfort.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          -0.2
        ]
      },
      {
        "description": "Agent A reminds to include non-alcoholic drinks to accommodate all preferences.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          -0.1,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agent B into the kitchen for cooking and bonding over a new recipe.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a bustling family kitchen at breakfast, Agent A, the parent, prepares a variety of foods while Agent B discusses a school project and Agent C sets the table.",
    "actions": [
      {
        "description": "Agent A makes extra pancakes to ensure there's enough for an unexpected neighbor who often visits.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.4
        ]
      },
      {
        "description": "Agent A assigns clean-up tasks to Agent B and Agent C to contribute equally.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A assists Agent C with setting the table rather than criticizing the effort.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A provides guidance and support for Agent B's concerns about a school project.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A uses the blender to make smoothies, offering a nutritious option and saving time.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.2,
          0.1
        ]
      },
      {
        "description": "Agent A encourages Agent B to have a classmate come over to work on the project.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A adjusts the morning routine for enough breakfast time.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.4
        ]
      },
      {
        "description": "Agent A compliments Agent C on the well-set table.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A creates a schedule to evenly distribute chores among family members.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is in the kitchen, prepping a meal while Agent B, having just woken up, joins. The table is set for three, awaiting Agent C. The kitchen is imbued with the aroma of cooking and natural light from the setting sun.",
    "actions": [
      {
        "description": "Agent A offers to help Agent B with the final preparations for the meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A invites both Agent B and the soon-to-arrive Agent C to contribute a dish to the meal.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A chooses to open the windows to let in more natural light rather than using electric lights.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          -0.2,
          0.4
        ]
      },
      {
        "description": "Agent A equally distributes the household chores related to meal preparation.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A begins a casual conversation with Agent B about their day.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A puts on some soft background music.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A decides not to sample the food until everyone is present.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A actively listens to Agent B’s recount of a recent difficult experience.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.2
        ]
      },
      {
        "description": "Agent A takes the initiative to set up a recycling station for the meal preparation waste.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.3,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is preparing breakfast after a run. Agent B is fixing something in the kitchen, and neighbor Agent C comes to return a book.",
    "actions": [
      {
        "description": "Agent A offers to make breakfast for Agent B and Agent C.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A volunteers to help Agent B with fixing the faucet.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent C to join for breakfast.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A packs extra breakfast for a sick classmate.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A cleans up the kitchen after cooking.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A prepares a nutritionally balanced meal.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.1,
          0.2
        ]
      },
      {
        "description": "Agent A uses a recipe for Agent B’s dietary needs.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.6
        ]
      },
      {
        "description": "Agent A divides the last coffee equally among the mugs.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A creates a rotating cleaning schedule.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.1,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a shared apartment, Agent A leaves their home office to join their roommates. Agent B is decorating the living area with new plants, and Agent C is creating healthy smoothies in the kitchen. They exchange support and acknowledgement for each other's activities, aiming to contribute to their shared home.",
    "actions": [
      {
        "description": "Agent A arranges a collective break time so all roommates can enjoy a smoothie together.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A offers to share some of the new healthy recipes they discovered recently.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A creates a rotational cleaning schedule for the shared spaces to promote a healthy living environment.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A initiates a conversation about purchasing a higher-quality blender for shared use to provide better nutrition.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.1,
          0.6
        ]
      },
      {
        "description": "Agent A assists Agent B with the heavy lifting of the potting soil.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A proposes a weekend hike for the household to get some fresh air together.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A offers to teach Agent C a few design tricks that could help in promoting their fitness classes.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A suggests implementing a system where they take turns cooking meals to ensure a balanced diet for all.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A contributes to Agent B's gardening project by drawing labels for the new herbs’ pots.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a balanced breakfast in the kitchen, while Agent B works on a puzzle at the table and Agent C lounges on the couch. The house is filled with the comforting scent of coffee and the soft hum of morning conversation.",
    "actions": [
      {
        "description": "Agent A invites everyone to help with meal preparation, creating a community experience.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a communal effort on the puzzle, with each person taking turns.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A shares memories with everyone using an old photo album.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A cleans up after breakfast to distribute the workload evenly.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A includes everyone in creating a meal plan for the next week.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A allows Agent B to place the last puzzle piece, acknowledging their enjoyment.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A encourages group participation in board games for shared entertainment.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A engages with Agent C to foster inclusiveness.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A makes personalized drinks for the group, considering everyone's preferences.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is cooking in the shared kitchen with Agent B showing interest in the process, and Agent C observing from the dining table. There is a warm atmosphere as they share in the preparation of a healthy meal.",
    "actions": [
      {
        "description": "Agent A invites both roommates to join the cooking process, delegating tasks.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A portions out the meal equally among everyone.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A sets aside some soup for a lonely elderly neighbor.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A opens the window to let fresh air into the kitchen.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          -0.2,
          0.1
        ]
      },
      {
        "description": "Agent A organizes a kitchen cleaning schedule for everyone.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.2,
          1.0
        ]
      },
      {
        "description": "Agent A suggests a group exercise after the meal.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.3,
          -0.2
        ]
      },
      {
        "description": "Agent A talks about everyone's day during the meal.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A makes a playlist for cooking and dining sessions.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A creates a communal grocery fund jar.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy home kitchen, Agent A is preparing dinner, entailing a balanced and wholesome meal, Agent B, A's partner, is working at the dining table, while Agent C, their teenager, is lounging on the kitchen island.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to help finish the meal by setting the table.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a group activity after dinner.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A decides to teach Agent C a new kitchen skill.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A discusses everyone's schedules for equitable planning.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A creates a rotating chore chart.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          1.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about organizing shared spaces.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A plans a surprise family outing.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A considers starting a kitchen garden with family.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a new rule where the cook doesn't do the dishes.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In the kitchen, Agent A prepares vegetables for dinner, Agent B cleans the fridge, and Agent C sits at the table observing. Together, they harmoniously engage in dinner preparations, with responsibilities shared and decisions made collaboratively.",
    "actions": [
      {
        "description": "Agent A prepares a balanced meal with wilting vegetables.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.2,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent C to bond over salad making.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A ensures an equitable cooking workflow for the family.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A apportions tasks considering preferences and abilities.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A selects fresh vegetables for Agent C to use.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A facilitates a menu decision that respects dietary needs.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A encourages Agent C to develop new cooking skills.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A opens windows to improve the cooking environment.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.1,
          0.1
        ]
      },
      {
        "description": "Agent A leaves easy tasks for Agent C to ensure involvement.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a software developer, comes home to find Agent B preparing a healthy vegetable stir-fry. Agent C, a mutual friend, is coming over for dinner with dessert. The atmosphere is comfortable, and the setup promotes a healthy lifestyle and shared experiences.",
    "actions": [
      {
        "description": "Agent A offers to help Agent B with the cooking by chopping vegetables.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A suggests taking the meal outside to enjoy fresh air.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A discusses instituting a weekly joint cooking session.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A declines dessert politely, maintaining health goals.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          -0.2,
          0.2
        ]
      },
      {
        "description": "Agent A proposes a light post-dinner walk with Agent C.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A offers some of his meal portion to Agent C for even servings.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A cleans up after the meal to distribute chores equitably.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A exchanges workout routine ideas with Agent C.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A discusses grocery shopping times with Agent B.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, the protagonist, is planning a group exercise session in the park with his housemates, Agent B and Agent C. They are discussing the day ahead over breakfast, with Agent A showing concern for Agent B's health and Agent C's wish to try new exercise moves.",
    "actions": [
      {
        "description": "Prepare a nutritious breakfast for the group to share.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Encourage Agent B to stay hydrated and offer to make her a herbal tea.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Modify the planned exercise to be suitable for Agent B's condition and include Agent C's new ideas.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.7,
          0.9
        ]
      },
      {
        "description": "Offer to postpone the session if Agent B feels too unwell to participate.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Delegate some exercise leadership to Agent C to help him feel involved.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Encourage a discussion about how each housemate feels today to ensure a supportive environment.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      },
      {
        "description": "Check the air quality before heading out and suggesting an indoor alternative if needed.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Organize a group activity after the exercise that everyone can enjoy, like a board game.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Propose a healthy meal plan for the week, with contributions from all housemates.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "A teenager, Agent A, decides to prepare a special family dinner, including everyone’s favorite dishes. Agent A sets the table, opens the windows for fresh air, cooks a balanced meal, and calls the family to dine together. This effort is aimed at appreciation and deepening family bonds.",
    "actions": [
      {
        "description": "Agent A personally invites Agent B and Agent C to the dinner table.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A pours water for everyone before starting the meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A expresses gratitude to Agent B and Agent C.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a conversation about everyone’s day.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          1.0,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agent C to try a new dish.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A cleans up after dinner, sharing chores.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A suggests a family walk after dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A listens actively to Agent B’s work challenges.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A shares an experience from school.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "A teenager has finished a day of virtual schooling and enters the kitchen where his parent is preparing a meal, and his sibling is setting the table. The teenager suggests adding a protein source to the meal and helps correct the mismatched cutlery for dinner settings.",
    "actions": [
      {
        "description": "Agent A offers to finish preparing the meal to allow Agent B a break.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A ensures there is enough water for everyone at the table.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.1,
          0.1
        ]
      },
      {
        "description": "Agent A proposes a walk after dinner for everyone.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A encourages a group decision on which movie to watch.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A aids in setting the table without making Agent C feel incompetent.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.2,
          0.6
        ]
      },
      {
        "description": "Agent A talks through Agent C's difficult day, offering support.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A initiates a quick kitchen clean-up.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.4
        ]
      },
      {
        "description": "Agent A volunteers to create a weekly meal plan.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A opens the curtains to let in natural light for Agent B.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          -0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, after finishing a morning jog, joins Agent B who is preparing a healthy breakfast, and Agent C who brings fresh garden vegetables for a potential picnic or hike. Together they plan a day that is enjoyable for everyone in the house.",
    "actions": [
      {
        "description": "Agent A makes breakfast for everyone, ensuring nutritional balance and catering to preferences.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A actively engages in the conversation with Agent B and C, showing genuine interest.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A suggests using the vegetables brought by Agent C for a salad.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A creates a cooking duty rotation system to share responsibilities.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A ensures equal portions of food at the picnic.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.2,
          1.0
        ]
      },
      {
        "description": "Agent A gently changes the subject if sensitive topics arise.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A volunteers to carry the heavier picnic items, considering the group’s abilities.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A takes the initiative to clean the gear after returning home.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.1,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a culinary enthusiast, is preparing a meal in a sunlit kitchen with roommates Agent B and Agent C. Agent B has just finished a run, and Agent C is engaged in paperwork. They share a space that harbors an understanding of mutual responsibilities and respect.",
    "actions": [
      {
        "description": "Agent A decides to divide the cooking tasks among the three of them.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A offers Agent C a taste of the dish.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A proposes to rotate the cooking responsibilities.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.1,
          0.8
        ]
      },
      {
        "description": "Agent A notices Agent B seems tired and suggests they rest.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a conversation about favorite dishes.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          -0.1
        ]
      },
      {
        "description": "Agent A sets the table to create a pleasant dining atmosphere.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A invites B and C to share stories about their day.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          -0.1
        ]
      },
      {
        "description": "Agent A ensures that the portions distributed are equal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          -0.1,
          0.7
        ]
      },
      {
        "description": "Agent A cleans up after the meal.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          0.3,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a home environment, Agent A completes their evening exercise routine before entering a kitchen where Agents B and C are engaged in cooking and working, respectively. Agent A participates in the collective preparation and consumption of a meal, attends to the needs of the household through collaborative decision-making, and nurtures mutual consideration among housemates.",
    "actions": [
      {
        "description": "Agent A fills up the water pitcher and places it on the table.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A offers help with meal preparation.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A gently reminds Agent C of the mealtime.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A initiates conversation about the upcoming week's meal plan.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A clears everyone’s dishes after the meal.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A opens the windows to let in the cool night air.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.1,
          0.2
        ]
      },
      {
        "description": "Agent A proposes a short post-meal walk.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.7,
          -0.1
        ]
      },
      {
        "description": "Agent A introduces a new board game for the group.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a collective trip to the market.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, prepares hydration and arrangements with their sibling Agent B and parent Agent C for a family gardening day at home, fostering a dynamic of shared responsibilities and collaboration.",
    "actions": [
      {
        "description": "Agent A mixes fruit water, pours it into bottles, and distributes them equally for hydration.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A guides Agent B on planting techniques.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a family rest under the canopy.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A takes over the strenuous work for a tired Agent C.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A documents the family's gardening progress.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A offers to complete the more strenuous gardening parts.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A proposes to share excess seeds with neighbors.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A creates a rotating gardening task schedule.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A calls a family meeting to discuss gardening enjoyment.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, in the kitchen, prepares a family dinner with care, selecting fresh ingredients and initiating a cheerful ambiance with music. Agent B works on homework but remains somewhat distracted by their phone. Agent C sets the table, contributing to the family meal prep.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to join in a quick, playful dance session in the living room before dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A asks Agent B's opinions on which dressing to serve with the salad, providing a choice between two homemade options.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A encourages Agent C to place a favorite toy in the center of the table as a quirky centerpiece.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A decides to prepare a special dish that Agent B mentioned liking in a past conversation.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A inquires about Agent B's homework and offers assistance if needed.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A mindfully portions out the salad to ensure each person receives their favored ingredients in ample amounts.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A proposes to Agent C to create handmade place cards for each family member to add a personal touch to the dinner setting.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent B and Agent C about their day, listening and sharing laughter.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A gently reminds Agent B to take a break from the screen and engage in a light stretching exercise together.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "College student Agent A is in the kitchen preparing a healthy dinner for her roommates. Agent B enters and compliments Agent A's dedication to nutritious meals. Agent C joins them, leading to a discussion on which ingredients to use to satisfy everyone.",
    "actions": [
      {
        "description": "Agent A taste tests the dish and adjusts the seasoning to find a balance that suits everyone’s preferences.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to help with small tasks in the kitchen.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A offers Agent B and Agent C a choice between two different side dishes.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A pulls chairs and sets the table to foster a convivial dining atmosphere.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A proposes they all switch off their phones during the meal to enjoy each other’s company without distraction.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          1.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to divide the food equally among everyone.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          1.0
        ]
      },
      {
        "description": "Agent A suggests that they rotate cooking duties, creating a schedule to share responsibilities.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A takes the initiative to clean up after the meal.",
        "values": [
          0.0,
          -0.8,
          0.0,
          0.0,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a conversation about everyone’s day, expressing genuine interest.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          1.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a weekend family meal in their home kitchen. Agent B, their spouse, has offered to help, while Agent C, their teenage child, sits at the dining table doing homework.",
    "actions": [
      {
        "description": "Agent A encourages Agent C to come over and help with the meal prep, using the opportunity to teach some cooking skills.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A decides to make an alternative dish that doesn't require the limited ingredient, ensuring there's enough for both recipes.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.1,
          0.6
        ]
      },
      {
        "description": "Agent A opens more windows in the house to let in additional fresh air and improve the home environment.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.1,
          -0.2
        ]
      },
      {
        "description": "Agent A takes a break from cooking to assist Agent C with their homework, providing guidance and support.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A suggests to Agent B to take a short break together, just to have a moment of togetherness amidst the busy cooking session.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A realizes they need more of the limited ingredient, and opts to make a quick trip to the store to purchase more, ensuring the dishes are made perfectly.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A lets Agent B decide how to use the limited ingredient, showing trust in Agent B’s judgment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A opts to sit with Agent C after the meal, to spend some one-on-one time discussing the day’s events.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Late afternoon in a family kitchen, Agent A sorts vegetables, Agent B sets the table, and Agent C chops herbs for a communal dinner amidst stories and laughter.",
    "actions": [
      {
        "description": "Agent A divides the meal portions equally.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.1,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a family walk after dinner.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A involves Agent C in seasoning choice.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A offers to clean up the dishes.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A initiates discussion about everyone’s day.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          -0.1
        ]
      },
      {
        "description": "Agent A attentive to Agent B's needs at the table.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.4
        ]
      },
      {
        "description": "Agent A asks the family to vote on the next meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A ensures kitchen window remains open.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          -0.1,
          0.1
        ]
      },
      {
        "description": "Agent A monitors food for dietary restrictions.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.1,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B prepare dinner in their kitchen while their neighbor, Agent C, contributes a homemade pie to their meal. They all involve themselves in the cooking process, sharing tasks and respecting preferences.",
    "actions": [
      {
        "description": "Agent A offers to let Agent B choose the recipe, respecting their shared decision-making.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A suggests dividing the pie evenly, respecting Agent C's contribution.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A encourages Agent B to try a new cooking technique for a shared experience.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          -0.1
        ]
      },
      {
        "description": "Agent A initiates setting the table, consideration for all.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A shares special coffee saved for special occasions.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A shares stories of past kitchen mishaps to bond.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          -0.2
        ]
      },
      {
        "description": "Agent A takes on more meal prep to let Agent B rest.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A checks with both for satisfaction with the meal's taste.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A insists on doing the dishes, allowing Agent B to rest.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          -0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and their sibling, Agent B, are in the kitchen preparing a meal with fresh ingredients. Family members are nearby in the home, creating a sense of warmth and camaraderie. Agent A is dicing tomatoes while considering everyone's taste preferences. Agent B makes light conversation about starting a new dish, contributing to a friendly atmosphere. Agent C, their cousin, adds to the dialogue by suggesting a beloved family appetizer.",
    "actions": [
      {
        "description": "Agent A offers to create a rota for meal preparation sharing.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a family cooking competition.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A takes initiative to clean up the kitchen area.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A suggests taking a walk after eating.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent C to share family stories during cooking.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A carefully listens to Agent B's preference on salt in the food.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A pulls out extra chairs so everyone can sit at the table.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A writes down the newly created recipe.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A ensures the food is portioned equally.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.1,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is hosting a family dinner that includes preparing a nutritious meal with the contribution of all family members in a warm and cooperative environment.",
    "actions": [
      {
        "description": "Agent A asks what everyone would like to drink to accommodate their preferences.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.7
        ]
      },
      {
        "description": "Agent A serves the dishes in equal portions for everyone.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          1.0
        ]
      },
      {
        "description": "Agent A initiates a storytelling game to foster sharing.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A includes Agent C and D in the food preparation.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      },
      {
        "description": "Members take turns carving the main dish.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A includes Agent D in the conversation.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          1.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a discussion on future family dinners.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A proposes shared cleaning responsibilities.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A surprises with a favorite dessert.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A proposes a collaborative cooking challenge where he and his two roommates, Agent B and Agent C, each prepare a dish using available kitchen ingredients for a collective dinner.",
    "actions": [
      {
        "description": "Agent A decides to prepare a healthy salad to prevent waste.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.4
        ]
      },
      {
        "description": "Agent A ensures ample water supply during cooking.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.2,
          0.1
        ]
      },
      {
        "description": "Agent A fetches pots and pans for everyone's use.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A offers to swap an ingredient with Agent C.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a feedback session after dinner.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A opens the windows for fresh air while cooking.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.1,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenage girl, is in the kitchen preparing a meal with her roommate, Agent B, and her cousin, Agent C. They focus on a balanced meal, equal distribution of food, respecting dietary restrictions, and end with a game of basketball.",
    "actions": [
      {
        "description": "Agent A suggests creating a rotating meal plan for cooking duties.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A offers to teach a new recipe.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.1
        ]
      },
      {
        "description": "Agent A initiates clean-up involvement, dividing tasks.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.1,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a walk after lunch.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.4,
          0.1
        ]
      },
      {
        "description": "Agent A encourages sharing a family recipe.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A plans a basketball competition.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A suggests planting a common herb garden.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A finds alternatives for dietary choices.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A organizes a grocery budget plan.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.1,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is prepping for a family dinner at home, with all members contributing to the meal. Agent A is ensuring that the meal is prepared equally and on time while fostering a supportive and convivial environment.",
    "actions": [
      {
        "description": "Agent A decides to create a meal plan that accommodates everyone’s dietary needs and preferences.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A checks to ensure that all agents have an adequate amount of hydration available to them during meal preparation.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A organizes a short break for all agents to sit down together and enjoy a light snack before continuing their tasks.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.8,
          -0.2
        ]
      },
      {
        "description": "Agent A switches tasks with Agent B, noticing they seem tired from chopping vegetables, allowing them to rest.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A opens the windows to let in fresh air, realizing the importance of ventilation while cooking.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.1,
          0.2
        ]
      },
      {
        "description": "Agent A encourages all agents to share stories or favorite memories while they cook.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          1.0,
          0.2
        ]
      },
      {
        "description": "Agent A creates a relaxed playlist that includes favorite tunes of all agents.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A places an extra chair at the dinner table anticipating the possibility of having an unexpected guest.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agents A, B, and C are housemates in a kitchen on a Saturday morning. Agent A is making breakfast, Agent B is returning from a jog, and Agent C is hydrating after a study session.",
    "actions": [
      {
        "description": "Agent A ensures there's enough food for everyone and serves the breakfast equally on three plates.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A invites Agents B and C to join for a short morning walk after breakfast to get some fresh air.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.1
        ]
      },
      {
        "description": "Agent A encourages Agent B to share experiences from the morning run and listens attentively.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.2
        ]
      },
      {
        "description": "Agent A offers a glass of water to Agent C, noticing the signs of dehydration.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A considers sharing an informative article on the importance of hydration with Agent C.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A plans to create a grocery list and asks for input from B and C to accommodate everyone's food preferences.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A proposes preparing a combined study and exercise schedule with Agent C to promote overall well-being.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A comes home with groceries and begins to unpack them while Agent B is tidying the study and Agent C is making a smoothie. Agent A proceeds to unpack a variety of healthy food options, setting the stage for a collaborative family evening.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to join in preparing dinner.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A volunteers to set up the dining table with Agent C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A prepares a recipe learned from a friend, considering family preferences.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A proposes each family member contributes a dish to the meal.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent C to share the smoothie.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a conversation about their day.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A makes an extra dish for a neighbor with leftover ingredients.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A plans a short family walk after dinner.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.1
        ]
      },
      {
        "description": "Agent A lets Agent C choose the dinner music playlist.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A wakes up early and integrates into the family routine of breakfast preparation without disturbing his still-sleeping sibling, Agent B. Agent C and D are present, creating a harmonious environment of equal contribution and shared responsibility.",
    "actions": [
      {
        "description": "Agent A prepares a plate for Agent B lovingly.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A offers to handle Agent B's chore, washing the dishes.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A recommends a collective yoga activity.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A tries new cooking techniques.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A suggests an egalitarian approach to choosing activities.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A ensures Agent B gets her favorite part of the meal.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.6,
          -0.1
        ]
      },
      {
        "description": "Agent A opens windows for fresh air circulation.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A calls a family meeting to discuss chores distribution.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A cleans the shared room proactively.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A prepares a nutritious meal for the household. The kitchen is aromatic with fresh herbs and vegetables. Agent B joins Agent A in the kitchen, helping to set the table. Agent C joins them, and they share their day's experiences. They prepare for a cozy dinner and activities later that night.",
    "actions": [
      {
        "description": "Agent A offers to split the remaining food equally among everyone's containers for the next day's lunch.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.4,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a round-table discussion to determine what movie to watch together.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A decides to go to bed early to get a full night's rest.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.2,
          0.3
        ]
      },
      {
        "description": "Agent A organizes an impromptu light stretching session before the movie.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.5,
          0.1
        ]
      },
      {
        "description": "Agent A opens the windows to let in fresh air while cleaning up.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.2,
          -0.1
        ]
      },
      {
        "description": "Agent A brings out a family album and shares stories, creating a bonding experience.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A carefully divides the leftovers, respecting food preferences.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A ensures Agent C has study materials and offers help.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a suburban home, 'Agent A' is preparing a vegetable stir-fry in the shared kitchen where 'Agent B' and 'Agent C' are present, creating a warm, fragrant atmosphere conducive to shared experiences.",
    "actions": [
      {
        "description": "Offers to help 'Agent B' with meal preparation.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Invites 'Agent C' to join in the cooking.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Sets aside some stir-fry for a neighbor.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Cleans up after cooking.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.3,
          0.4
        ]
      },
      {
        "description": "Insists on cooking alone.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          -0.7,
          -0.5
        ]
      },
      {
        "description": "Divides the meal evenly.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Proposes an exercise routine after dinner.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.2,
          0.3
        ]
      },
      {
        "description": "Opens all windows for natural light.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.1,
          0.1
        ]
      },
      {
        "description": "Keeps the culinary recipe secret.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          -0.6,
          -0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing the weekly family dinner, with Agent B reading nearby, Agent C doing homework at the dining table, and Agent D playing on the kitchen floor. A gentle breeze wafts in as the oven timer dings; the family has a tradition of eating together by 6 PM and sharing household roles.",
    "actions": [
      {
        "description": "Agent A invites Agent C to assist in finishing the meal as a way to teach them some cooking skills.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A pauses to engage in a quick game with Agent D using the building blocks before dinner.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          -0.1
        ]
      },
      {
        "description": "Agent A cleans up the kitchen as they cook, showing respect for the shared family space.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.2,
          0.6
        ]
      },
      {
        "description": "Agent A kindly asks Agent B to set the table, stressing that participation from each member is essential.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A intentionally creates a special plate for Agent D, knowing their preference for less seasoned food.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A checks with Agent C for any dietary changes before serving, acknowledging their recent choice to adopt a different eating habit.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "After dinner, Agent A initiates a family walk to the local park to promote a healthy routine post-meals.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          -0.2
        ]
      },
      {
        "description": "Agent A suggests a post-dinner cleanup where everyone pitches in, promoting a sense of equity in house chores.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.2,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a meal in the kitchen with limited ingredients while Agent B reads at the kitchen table. Neighbor Agent C arrives, needing some ingredients. Agent A suggests sharing the food and later going for a walk for physical activity with an open window providing a breeze in the living area.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to join him in cooking the meal together to foster communal spirit.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "After the meal, Agent A initiates a group cleanup to distribute the workload equitably.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          -0.1,
          0.8
        ]
      },
      {
        "description": "Agent A organizes an after-dinner walk for everyone to participate and rejuvenate.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A suggests establishing a rotating pantry contribution system for future shared meals.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A sets up a resting area with comfortable cushions for everyone to relax after the meal before the walk.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A proposes to start a small garden together to grow their own produce.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.2,
          0.6
        ]
      },
      {
        "description": "Agent A offers to teach Agent B a recipe, turning cooking time into a bonding experience.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A crafts a schedule for regular exercise sessions for the group.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B are cooking in the kitchen, with their child, Agent C, doing homework at the dining table. The family is actively engaging in conversation and the meal preparation is considerate of everyone's preferences and needs.",
    "actions": [
      {
        "description": "Agent A asks for meal preferences.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A sets aside food for their neighbor.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A teaches Agent C a cooking step.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A cleans the kitchen space.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.1,
          0.3
        ]
      },
      {
        "description": "Agent A distributes food evenly.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A holds a taste-test competition.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A discusses a meal plan.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A assists with homework.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A opens windows while cooking.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.2,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a nutritious breakfast smoothie after an early morning jog. Agent B is organizing a recycling area, Agent C is working on a puzzle, and Agent D is watering plants near the living room window.",
    "actions": [
      {
        "description": "Agent A invites Agent C to join them in making a fresh juice, offering to blend in Agent C's favorite fruits.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A arranges a family board game session post-breakfast to promote bonding time.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "After breakfast, Agent A proposes that everyone should take a trip to a local farm for fresh produce.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A decides to schedule individual time with Agent D to assist them with an upcoming school project.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A offers to take over Agent B's recycling duty for the day to allow Agent B some rest.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "During the board game session, Agent A makes sure to enforce the rules to keep the game balanced for all.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A encourages Agent C to take breaks between puzzle sessions and join for a light family workout.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A sets up a schedule for family members to take care of watering the plants.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a suburban home, 'Agent A', a young parent, prepares a weekend family brunch, 'Agent B' organizes the dining area, and 'Agent C' works on a school project. A cozy, welcoming atmosphere with brunch preparations in progress sets the scene.",
    "actions": [
      {
        "description": "'Agent A' offers to help 'Agent C' with their school project once brunch is over.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.1
        ]
      },
      {
        "description": "'Agent A' suggests each person at the table can choose one topic of conversation.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.9
        ]
      },
      {
        "description": "'Agent A' asks 'Agent B' and 'Agent C' about their pancake toppings preferences.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "'Agent A' divides the fruit equally among the plates.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.2,
          1.0
        ]
      },
      {
        "description": "'Agent A' invites 'Agent C' to help prepare the table.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.6,
          0.6
        ]
      },
      {
        "description": "'Agent A' proposes a short family walk after meals.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.4,
          -0.3
        ]
      },
      {
        "description": "'Agent A' nudges 'Agent C' to take a break and help set up for brunch.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "'Agent A' ensures the music volume is comfortable for all.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "'Agent A' offers to swap tasks with 'Agent B'.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a nutritious dinner post-fitness session, with Agent B setting the table and Agent C baking cookies.",
    "actions": [
      {
        "description": "Prepares a larger portion for Agent C who starts early the next day.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Offers to wash the dishes while others finish the dessert.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Opens windows to let in fresh air.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.1,
          0.2
        ]
      },
      {
        "description": "Selects calming music for dining ambiance.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Proposes a rotational cleaning schedule for the home.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.2,
          1.0
        ]
      },
      {
        "description": "Shares personal favorite recipes for future meals.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Softens lighting for a cozy dining experience.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.1
        ]
      },
      {
        "description": "Engages in conversation about everyone's day.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          1.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B, siblings sharing a small bedroom, navigate through a shared space while maintaining mutual respect and cooperation.",
    "actions": [
      {
        "description": "Agent A invites Agent B to split the task of preparing a nutritious snack.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A suggests an early evening walk in the park to Agent B.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A decides to wait to speak about desk sharing until B finishes a section of the puzzle.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a short yoga session with Agent B.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A helps Agent B find a missing puzzle piece.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A asks Agent B to turn down the music.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          -0.4,
          0.3
        ]
      },
      {
        "description": "Agent A plans a desk usage rota with Agent B.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A chooses to use headphones while listening to an audiobook.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.3,
          0.3
        ]
      },
      {
        "description": "Agent A offers to help Agent B finish the puzzle quickly.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A prepares a meal considering everyone’s preferences, Agent B is managing finances, and Agent C discusses community engagement.",
    "actions": [
      {
        "description": "Agent A offers to help Agent B with bills and to split expenses equally.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A shows interest in volunteering with Agent C at the playground.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A saves some meal for their elderly neighbor.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A turns meal preparation into a joint activity.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A opens a window for fresh air.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A plans weekly meals on a shared calendar.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A creates a rotating schedule for chores and budget tasks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.1,
          0.9
        ]
      },
      {
        "description": "Agent A proposes an after-dinner walk for everyone.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.1
        ]
      },
      {
        "description": "Agent A proposes starting a kitchen garden.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, the proactive parent, is bustling around the kitchen, preparing a meal with careful attention to each family member's tastes, while fostering a supportive and collaborative household atmosphere. Agent B is nearby, sorting mail but ready to engage with the family, and their teenage children, Agent C and Agent D, are in the living room, temporarily detached but will soon participate in the dinner preparations.",
    "actions": [
      {
        "description": "Agent A invites Agent C and Agent D to help in cooking.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A sets aside a special portion of the dish adjusted for Agent D.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A compliments Agent B on a recent accomplishment at work.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A discusses Agent C's project.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A asks the family to join in the kitchen for a quick taste test.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A organizes a schedule with Agent B to alternate cooking days.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A offers to teach Agent D a specific cooking technique.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A doubles a recipe, planning to share leftovers with an elderly neighbor.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a discussion about everyone's day.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a suburban home at dusk, four individuals come together in the kitchen. The home chef, their spouse, their teenager, and a close friend work in harmony to prepare dinner.",
    "actions": [
      {
        "description": "Agent A lets Agent C lead the cooking of the next dish.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A proposes a toast at dinner for everyone’s efforts.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A divides the cleaning chores equally after dinner.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A suggests Agent D choose the dessert.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A saves leftovers for everyone’s lunch.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          -0.1,
          0.6
        ]
      },
      {
        "description": "Agent A starts a conversation about each person’s day.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A shares a personal challenge for support.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.1
        ]
      },
      {
        "description": "Agent A plans the next family cooking night.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A delegates movie selection to Agent C.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing breakfast with roommates Agent B and Agent C in a shared kitchen, actively engaging everyone in the process.",
    "actions": [
      {
        "description": "Agent A carefully proportions the food to ensure each roommate receives an equal share.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          1.0
        ]
      },
      {
        "description": "Agent A starts a playful competition with Agent B on who can make the better omelet.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          -0.2
        ]
      },
      {
        "description": "Agent A decides to teach Agent C a new recipe.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A opens the windows to let in fresh air while they cook.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a cleanup relay after the meal.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A diplomatically resolves a small dispute over who gets to use the last eggs.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A encourages Agent C to choose the background music.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A checks with both roommates for dietary restrictions before cooking.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a system for buying communal kitchen staples in turns.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.2,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B, a couple in their early 30s, wake up early on a Saturday morning in their cozy suburban home. Agent A, fully refreshed from a good night's sleep, is in the kitchen preparing a nutritious breakfast. Agent B is already sitting at the kitchen table working on her novel. Agent C, their teen child, joins them, enticed by the smell of freshly baked bread.",
    "actions": [
      {
        "description": "Agent A offers to help Agent C with a tough homework assignment later in the day.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a discussion about everyone's plan for the day to ensure everyone's needs and preferences are considered.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.9
        ]
      },
      {
        "description": "Agent A suggests a family walk after breakfast to enjoy the fresh morning air together.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.6,
          -0.1
        ]
      },
      {
        "description": "Agent A encourages Agent C to express their thoughts on the story Agent B is developing.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A pours water for everyone at the table, making sure they stay hydrated.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.3,
          0.3
        ]
      },
      {
        "description": "Agent A pulls out a board game after breakfast, prompting a friendly, cooperative competition.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A listens and provides undivided attention as Agent B shares her story outline.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A involves Agent C in the breakfast cleanup, emphasizing shared responsibilities.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "‘Agent A’, a passionate home chef, plans a special dinner for her roommate 'Agent B's work promotion. ‘Agent C', a neighbor, contributes a dessert. The setting is a well-equipped kitchen. ‘Agent A’ prepares carefully, providing vegetarian options for ‘Agent B’. ‘Agent D’, another expected guest and significant other to ‘Agent B’, is running late, creating underlying tension.",
    "actions": [
      {
        "description": "'Agent A' decides to start preparing a dish she’s never attempted before to impress her guests and diversify her cooking skills.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "'Agent A' offers a taste test of the new dish to 'Agent B' and 'Agent C’ and asks for their honest opinions.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "'Agent A' sets aside a container of the dinner for ‘Agent D’ as a gesture of inclusion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "'Agent A' makes an adjustment to the menu for timely service, choosing a dish that cooks quickly.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.2,
          0.3
        ]
      },
      {
        "description": "'Agent A' enthusiastically invites 'Agent C’ to assist with the preparation.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "'Agent A' considers 'Agent B’s dietary needs, preparing a vegetarian alternative.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "'Agent A' asks 'Agent C' for help in setting the table.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "'Agent A' prepares a small entree to accommodate the delay.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.2,
          0.4
        ]
      },
      {
        "description": "‘Agent A’ cleans the kitchen and dining area for a pleasant environment.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.1,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A organizes a cooking evening to bring roommates Agent B and Agent C together, utilizing the event to address each individual’s interests and promote a collaborative and equitable household environment.",
    "actions": [
      {
        "description": "Agent A proposes that each roommate cooks a dish that represents their cultural background to share with others.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A suggests a rotating cooking schedule for future meals, ensuring each person has the opportunity to decide the menu.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A checks the pantry to ensure that the meal they plan contains all necessary food groups for balanced nutrition.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          -0.2,
          0.3
        ]
      },
      {
        "description": "During dinner, Agent A asks each roommate about their dietary preferences for future meal planning.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "After cooking, Agent A organizes a sit-down discussion to gauge everyone's satisfaction with the meal and evening.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A encourages a group cleaning session after the meal to promote responsibility sharing.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A introduces a feedback system where each person can suggest improvements for the next cooking event.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A drafts a shared shopping list to maintain the household's nutritional needs.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          -0.3,
          0.4
        ]
      },
      {
        "description": "Agent A reflects on the evening and writes down ideas for more inclusive activities involving the whole house.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A returns home after work and is engaged in family life balance considerations as Agent B prepares dinner and Agent C studies. The family dynamic is filled with potential engagement opportunities, emphasizing shared experiences and responsibilities.",
    "actions": [
      {
        "description": "Agent A decides to help Agent B with cooking.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          -0.3
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A involves Agent C in dinner preparation.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a short family walk.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          -0.1
        ]
      },
      {
        "description": "Agent A ensures everyone has eaten well.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A offers to clean up after dinner.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a chores rotation.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A acknowledges Agent C's hard work.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A checks the house for security.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          -0.3,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a surprise home-cooked dinner for the family, considering everyone’s preferences. Agent B organizes a board game setup in the living room. Agent C offers to help set the table and Agent D joins in after returning from a jog.",
    "actions": [
      {
        "description": "Adjusting portions of the meal to serve everyone equally, focusing on a balanced food offering.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          -0.3,
          0.8
        ]
      },
      {
        "description": "Engaging in conversation with Agent D while multitasking in the kitchen, sharing personal anecdotes.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "Ensuring the family board game has rules that give everyone an equal chance to win.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          1.0
        ]
      },
      {
        "description": "Teaching Agent C proper table setting, showing attention to detail and inclusivity.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Reserving a portion of the meal for Agent B who is set to return late, so they can partake in the family meal.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.7,
          0.7
        ]
      },
      {
        "description": "Ensuring personal and Agent C's hydration for sustained vitality.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          -0.4,
          0.2
        ]
      },
      {
        "description": "Sharing kitchen duties with Agent D, promoting cooperative effort.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.6,
          0.9
        ]
      },
      {
        "description": "Discussing with family members about restocking necessary ingredients and ensuring collective well-being.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.2,
          0.6
        ]
      },
      {
        "description": "Suggesting a family walk for combined fitness and social engagement.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.8,
          -0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a suburban home during the weekend, Agent A decides how to spend time after completing schoolwork. Agent B is tidying the living room, and Agent C reads on the sofa.",
    "actions": [
      {
        "description": "Offer to prepare a meal for the household, considering everyone's preferences.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Suggest a game of charades to engage everyone.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Inquire about Agent C's book to show interest.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "Propose a cleanup challenge with a reward.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Invite Agent C for a jog to enjoy fresh air.",
        "values": [
          0.0,
          1.0,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Organize a movie night allowing each to pick a film.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          1.0,
          0.5
        ]
      },
      {
        "description": "Take over Agent B’s chores for the day.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          0.8,
          0.9
        ]
      },
      {
        "description": "Discuss with Agent B ways to reduce household waste.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Share a personal dilemma with Agent C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager with a passion for cooking, prepares to make a large meal in the kitchen for a family gathering, finds Agents B and C assembling a puzzle where the meal is supposed to be prepared.",
    "actions": [
      {
        "description": "Agent A initiates a conversation with Agents B and C about relocating their activity.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A offers to help finish the puzzle quickly.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A rearranges the kitchen space to avoid disturbing Agents B and C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          -0.1,
          0.4
        ]
      },
      {
        "description": "Agent A chooses to delay cooking until Agents B and C are finished.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          -0.3,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agents B and C to help with cooking.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A sets up a small table for the puzzle activity near them.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.2,
          0.6
        ]
      },
      {
        "description": "Agent A tactfully communicates their plan and seeks group consensus.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A bakes extra cookies for Agents B and C.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy suburban home, Agent A is in the kitchen preparing dinner with attention to each person's dietary preferences, Agent B is interacting softly from the dining table, and Agent C is upstairs, engaged in homework with occasional social texting. The house is filled with the aroma of food, background music, and natural breeze, fostering a rich environment for interaction.",
    "actions": [
      {
        "description": "Agent A invites Agent C to help prepare a part of the meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A creates a plate with a larger portion for Agent C.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          -0.2,
          -0.1
        ]
      },
      {
        "description": "Agent A decides to ask the family about weekly dinner rotations.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A includes a favorite dish of each family member in the meal.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.5
        ]
      },
      {
        "description": "Agent A leaves the leftovers for Agent B.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A refrains from taking the last piece of dessert.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A initiates a family conversation at dinner.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          1.0,
          0.3
        ]
      },
      {
        "description": "Agent A schedules a family outing for a shared physical activity.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.7,
          -0.2
        ]
      },
      {
        "description": "Agent A leads a game night after dinner.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "On a Saturday afternoon, Agent A is preparing a meal in the kitchen. Agent B, busy with sports, is polishing soccer boots, and Agent C is wrapping up a school art project. Agent A engages both B and C in setting up the table, leading to a family dinner preparation where everyone has a role.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to help prepare a salad by washing the vegetables together.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A decides to portion the dessert equally to avoid any feelings of partiality.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.1,
          0.8
        ]
      },
      {
        "description": "Agent A asks for Agent B's and Agent C's preferences on which drinks to serve with dinner.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A involves Agent C in choosing the music playlist for the dinner to include everyone’s tastes.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.5
        ]
      },
      {
        "description": "Agent A encourages Agent B to rest after noticing her tiredness from soccer practice.",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A voluntarily clears Agent C’s art supplies, acknowledging their busy school schedule.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "After the meal, Agent A plans a light family walk to enjoy the fresh air together.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A gently reminds both Agent B and Agent C about the importance of a good night’s sleep for their health and their activities the next day.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.2,
          -0.1
        ]
      },
      {
        "description": "Agent A organizes a small family game to create a shared fun experience.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A has prepared a housewarming luncheon for friends, using local organic goods, and has invited Agents B and C for equal fellowship opportunities. Fresh air fills the room as they chat about community involvement and connect personally.",
    "actions": [
      {
        "description": "Agent A offers to clear lunch for everyone.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.3,
          -0.1
        ]
      },
      {
        "description": "Agent A shares lunch recipes with peers.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A invites both to choose the music.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A suggests visiting the community center.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A listens to Agent B's experiences.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A declines a call during the luncheon.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A proposes a gardening project.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a race at the park.",
        "values": [
          0.0,
          0.9,
          0.0,
          0.0,
          0.1,
          0.2
        ]
      },
      {
        "description": "Agent A provides reusable water bottles.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a dietitian, is cooking a nutritious meal for the family while Agent B works on homework and Agent C sets the table. Tension arises from Agent B's homework frustration, and Agent A plans to lend support afterward.",
    "actions": [
      {
        "description": "Agent A offers to help Agent B with homework, suggesting they work on it together.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A serves equal portions of dinner ensuring everyone receives the same amount.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          0.1,
          0.9
        ]
      },
      {
        "description": "Agent A opens a conversation about everyone's day during dinner to share experiences.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A prepares a fruit salad for a nutritious dessert.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.2,
          0.1
        ]
      },
      {
        "description": "Agent A surprises Agent C by including a desired recipe in next week's meal.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A encourages family to take a walk outside after dinner.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A lets Agent B decide on taking a break before homework.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A suggests playing a game of spotting constellations during the walk.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A stays up late to ensure Agent B understands their homework.",
        "values": [
          0.0,
          -0.7,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing dinner at home with the help of Agent B, Agent C, and Agent D. Upon realizing there is not enough food for everyone, Agent A contemplates the situation, hoping to ensure that all members of the household have enough to eat while keeping the atmosphere warm and equitable.",
    "actions": [
      {
        "description": "Agent A decides to reduce their own portion to ensure everyone has enough food.",
        "values": [
          0.0,
          -0.5,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A suggests creating an extra dish from available ingredients for everyone to have an adequate meal.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A opens a conversation at the table about how to ensure everyone gets enough to eat.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A offers their own share to Agent C without mentioning the shortage to others.",
        "values": [
          0.0,
          -0.6,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A talks to Agent B about preparing separate meals in the future to ensure adequacy.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A intentionally takes the smallest portion without making a mention of the shortage.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A keeps the portions equal, regardless of their earlier realization.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          -0.2,
          1.0
        ]
      },
      {
        "description": "Agent A recalls a recipe that can quickly supplement the main course using the available pantry items.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A apologetically explains the situation to everyone, suggesting a food order for additional dishes.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A arrives home from work to join Agent B, who is preparing dinner, and Agent C, who has just finished working. The apartment setting is cozy, and there's a sense of mutual consideration as they gather in the kitchen.",
    "actions": [
      {
        "description": "Agent A helps Agent B with the cooking by chopping vegetables.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A pours water for Agent C, noting their hard work.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A suggests a game night to bond with B and C.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          -0.1
        ]
      },
      {
        "description": "Agent A offers to clean up after dinner to balance workload.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A recommends a walk with Agent C for relaxation.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          -0.2
        ]
      },
      {
        "description": "Agent A initiates making a shared grocery list for household needs.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A opens windows for fresh air.",
        "values": [
          0.0,
          0.5,
          0.0,
          0.0,
          -0.3,
          0.2
        ]
      },
      {
        "description": "Agent A invites B and C to share personal stories.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B, a couple living together, are joined in their home by Agent C, a neighbor bringing a pie as a housewarming gift. They are preparing dinner and engage in a friendly conversation discussing the neighborhood.",
    "actions": [
      {
        "description": "Agent A shares a recipe with Agent C.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A suggests a future meal preparation together.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A offers some of the meal to Agent C.",
        "values": [
          0.0,
          -0.4,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent C to help with a simple task in meal preparation.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A politely declines Agent C's stay for dinner.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          -0.5,
          -0.2
        ]
      },
      {
        "description": "Agent A inquires about Agent C's dietary restrictions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.7,
          0.7
        ]
      },
      {
        "description": "Agent A asks Agent B privately about their comfort with Agent C's company.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A proposes a neighborly dinner rotation idea.",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A suggests Agent B cuts the pie.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.4,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is cooking a meal in the kitchen while maintaining lively conversations with Agent B and C. Together they balance responsibilities, share space, engage socially, and plan to eat a well-prepared lunch.",
    "actions": [
      {
        "description": "Agent A carefully portions the food onto plates...",
        "values": [
          0.0,
          0.6,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agents B and C to help set the table...",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a short group walk after the meal...",
        "values": [
          0.0,
          0.7,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A shares personal anecdotes...",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A takes an extra moment to present the food aesthetically...",
        "values": [
          0.0,
          0.3,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A encourages a group cleaning activity...",
        "values": [
          0.0,
          0.4,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A proposes a new recipe...",
        "values": [
          0.0,
          0.2,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A offers Agent C a glass of water...",
        "values": [
          0.0,
          0.8,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a round-table discussion...",
        "values": [
          0.0,
          0.1,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      }
    ]
  }
]