[
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A joins Agent B and Agent C for a planned movie night at home, with a cozy setup and snacks prepared.",
    "actions": [
      {
        "description": "Agent A picks a beloved movie for everyone to watch.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A cushions the couch for added comfort.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A finalizes the room's arrangement for the movie.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a restful break to discuss and socialize.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a nostalgic moment by sharing an old photo album.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A provides Agent B with a blanket for added warmth.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A tidily stores the DVDs after use.",
        "values": [
          0.0,
          0.0,
          0.7,
          -0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A offers to accompany Agent C on their way home.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A captures the memory with a group photo.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a working parent who returns home to find a quiet and tidy household. Agent B, their spouse, is cooking dinner, and Agent C, their teenage child, is studying at the table. A new family photo on the mantelpiece and a gentle tune playing sets a peaceful atmosphere. Agent A takes over dinner preparations from Agent B and checks in with Agent C about their studies.",
    "actions": [
      {
        "description": "Agent A reviews Agent C's study material and helps explain a complex topic.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a discussion at dinner about everyone's day.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing a board game after dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B on the dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A wraps up leftovers securely.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A fixes a loose step on the staircase.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a relaxing bath for Agent B.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the next family outing.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A checks the doors and windows before bedtime.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a parent, is seated at the dining table with their children, Agent B and Agent C. It's a chilly evening, and the family has just finished a warm meal. The house is cozy, with soft lighting and gentle music playing in the background, and the scent of home-baked cookies fills the air. Agent A suggests moving to the living room to continue their evening over hot chocolate and a board game.",
    "actions": [
      {
        "description": "Agent A initiates a group cleanup of the dining area to maintain the home environment.",
        "values": [
          0.0,
          0.0,
          0.8,
          -0.3,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests setting up the board game for a family activity in the living room.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A listens attentively to Agent B's project ideas, providing encouragement.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A asks open-ended questions to both children to encourage a shared conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A shares a positive personal experience related to Agent B's project topic.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to assist Agent C with homework after the board game to support their learning.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a surprise reveal of the freshly baked cookies for dessert.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to take a family photo to capture the evening's shared experience.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are preparing a surprise birthday dinner for Agent C. The kitchen is bustling with activity as Agent A chops vegetables and Agent B sets the table, both ensuring a secure environment and a joyful surprise.",
    "actions": [
      {
        "description": "Agent A carefully places the sharp knives out of the way after using them.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A tastes the dish to ensure it is delicious before serving it.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A lights candles on the dining table to create a warm ambiance.",
        "values": [
          0.0,
          0.0,
          -0.5,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A selects a playlist of Agent C's favorite music to play during the dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent B in arranging the flowers in a vase for the centerpiece.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A rehearses a thoughtful birthday toast for Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A clears any clutter from the dining area for a neat presentation.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures that the floor is clean and dry to prevent any slips or falls.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A collects all the ingredients for the dish from the cabinet making sure nothing hazardous is left open or out of place.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.4,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A finishes meal preparation, and the enticing aroma fills the kitchen. Agent B sets the table humming a cheerful tune, Agent C draws on the living room floor. Warm light from the sunset casts a comforting glow inside the home.",
    "actions": [
      {
        "description": "Agent A praises Agent C’s artwork and inquires about its inspiration.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A talks to Agent B about their day while arranging food on the table.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A brings a first aid kit to attend to Agent C's minor scrape.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family board game after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the dining table is neatly arranged with plates and utensils.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.4,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A enhances dinner with soft background music.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A checks locks on doors and windows for security before the meal.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reflects on family unity and expresses gratitude before eating.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to share a story from their day during the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a teenager organizing a surprise birthday gathering in their family home for a close friend. The siblings, along with one parent, prepare the cozy living room with festive decorations and a personal music playlist. The atmosphere is filled with quiet anticipation.",
    "actions": [
      {
        "description": "Agent A reminds others to keep quiet as the guest is arriving soon.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A closes the blinds to keep the surprise.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the decorations are secure.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A finalizes the song selection with the sibling.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A writes a heartfelt message in the birthday card.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up the baking space.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A confirms the arrival time of the honored guest.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A helps move the cake to the celebration area.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy living room, Agent A reads a book on the couch. Agent B cooks in the kitchen, while Agent C sets up a board game. The power goes out, and Agent A lights candles and reassures Agent B. Agent C makes a comfortable space for a candle-lit board game.",
    "actions": [
      {
        "description": "Agent A checks the weather report on their phone to gauge the severity of the storm.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A ensures that all windows are securely shut and that no water is seeping in.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A starts telling a lighthearted story to lighten the mood and entertain Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes that they all play the board game by candlelight to pass the time until power returns.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A goes to comfort Agent B, who is upset about their dinner preparation being interrupted.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.6,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A gathers extra blankets to ensure everyone stays warm in case the temperature drops.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A checks on the neighbors to make sure they are also managing well during the outage.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A decides to make an indoor camp by arranging chairs and blankets for a fun twist to the evening.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A puts on soft music on a battery-operated device to keep the atmosphere calm and pleasant.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a mother in her thirties, is in the cozy living room with Agent B and Agent C. The family enjoys a warm, serene evening together as Agent C works on homework and Agent B prepares dinner.",
    "actions": [
      {
        "description": "Agent A checks the smoke detector to ensure it is functional.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C at the dining table to assist with homework.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family conversation over dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A organizes an indoor camping experience.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family board game night.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family movie night with popcorn.",
        "values": [
          0.0,
          0.0,
          0.2,
          1.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a family photo to capture the evening.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A reads a bedtime story to Agent C.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a blanket fort for Agent C.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.8,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Inside a warm and cozily lit kitchen, Agent A is preparing dinner, carefully chopping vegetables and humming to a familiar tune. The aroma of herbs and spices fills the air. Agent B, Agent A's partner, is setting the table, meticulously placing utensils and folding napkins into neat triangles. Agent C, their teenage child, is on a kitchen stool, scrolling through a playlist to select background music for the meal. All agents are within a conversational distance, occasionally glancing at each other with unspoken understanding and smiling in anticipation of enjoying the meal together.",
    "actions": [
      {
        "description": "Agent A checks the smoke detectors in the house to ensure they are working correctly.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a surprise family game night after dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to assist with cooking to teach them a family recipe.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A puts away sharp kitchen tools immediately after use, to prevent any accidents.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a toast to celebrate a family achievement during dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the furniture to create a comfortable seating area for relaxation after the meal.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.8,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A encourages everyone to share their day's experiences while dining.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a first aid kit to have close by during the dinner, just in case.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A ensures that the walkways in the house are clear of any clutter to facilitate easy movement.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home, Agent A gathers family photo albums and a camera, while Agent B reads a book, Agent C bakes a pie in the kitchen, and Agent D plays outside. The aroma of pie and a sense of calm permeate the home. Agent A and B exchange smiles and Agent C calls out for a family snack.",
    "actions": [
      {
        "description": "Agent A decides to capture the moment by taking a group photograph of the family.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A puts out a blanket on the living room floor for everyone to sit and share the pie together.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates a new album of photos taken during the day.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A arranges for an impromptu indoor picnic.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent D to join the rest of the family for the snack.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about each person's favorite memory.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a game that everyone can participate in.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A ensures that everyone washes their hands before eating.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A takes time to listen to Agent B's interpretation of the novel.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a parent observing Agents B and C, their children, drawing on the living room floor. They are planning to make greeting cards for their grandparents. Agent A ensures the windows are secured with a storm approaching.",
    "actions": [
      {
        "description": "Agent A smiles, nodding in approval, and suggests adding personal touches to the cards by including warm messages inside.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Retrieves the first aid kit from the hallway closet to have it readily accessible in case of minor scrapes during the children's play.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A participates in the drawing, creating a piece that symbolically represents their family unity.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Moves a fragile vase to a higher shelf to prevent it from being knocked over.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.1,
          0.0
        ]
      },
      {
        "description": "Organizes a game where each person shares something they appreciate about the other.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Offers to help Agent B spell some difficult words for the message in the greeting card.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a practice fire drill using the anticipated storm as a teaching moment.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.3,
          0.3,
          0.0
        ]
      },
      {
        "description": "Decides to tell a story about a past family adventure while they work on the drawings, prompting laughter and nostalgia.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Adjusts the room’s lighting to a cozy glow as the sky darkens with the incoming storm.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is fostering a young kitten and playing with it on the rug. Agent B, Agent A's roommate, is reading on the couch. Agent C is in the kitchen making tea. The home is filled with warmth and the soft sound of music.",
    "actions": [
      {
        "description": "Agent A picks up the kitten and checks it for discomfort after playing.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A gets up to close the window when the wind starts to bring in a chill.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to play with the kitten.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a cozy bed for the kitten.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A takes pictures of the kitten and shares them.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A expresses gratitude to Agent C for the tea.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests watching a movie together later.",
        "values": [
          0.0,
          0.0,
          0.5,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the space after playtime.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B about their book.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen preparing dinner, with Agent B organizing the living room and Agent C at the kitchen island doing homework. The household is filled with warmth, and there is an atmosphere of pleasant engagement.",
    "actions": [
      {
        "description": "Agent A carefully checks all the stove knobs to ensure they are turned off after cooking.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game night after dinner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks that the doors are locked before bed.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sits down to help Agent C with her homework.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A discusses holiday plans with the family.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A installs a new smoke alarm in the kitchen.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A comforts Agent C about her exam stress.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A shares family memories using an old photo album.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family walk after dinner.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.7,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a parent, is in the living room arranging cushions on the sofa while Agents B and C, their children, play a cooperative board game. The room is filled with family photos and drawings, indicating a nurturing home environment.",
    "actions": [
      {
        "description": "Agent A prepares a family favorite snack and joins Agents B and C, enhancing the positive atmosphere.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the day and shares stories with Agents B and C, fostering family bonding.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A installs childproof locks on cabinets, reinforcing the secure environment.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A praises Agents B and C's teamwork encouraging a supportive atmosphere.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A kneels to tie Agent B's shoelaces, preventing tripping.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts a game to talk about the best parts of the week, promoting open communication.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos during Agents B and C's play, capturing memories.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small celebration for Agent B's school project success.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a family photo album as soft music plays, while Agent B cooks and Agent C studies at the dining table in their cozy home.",
    "actions": [
      {
        "description": "Agent A sets up a secure corner with soft pillows and blankets for Agent C to take study breaks.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a cup of herbal tea for Agent C.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent C in photo selection for the album.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A has a conversation with Agent B about supporting Agent C.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes a walk with Agent B to discuss family plans.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family game night.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A offers help with Agent C's homework.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.5,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares a funny story with Agent C.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plays Agent C's favorite music.",
        "values": [
          0.0,
          0.0,
          0.2,
          1.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "On a cold winter evening, Agent A, a caregiver, enters the kitchen to find Agent B and Agent C, young siblings, setting the table and sharing a jovial moment. The house is warm and inviting, contrasting the harsh weather outside. Agent A takes part in the dinner preparations, ensuring the family's environment is both secure and emotionally nurturing.",
    "actions": [
      {
        "description": "Agent A reinforces the door locks due to strong wind.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a hot meal that is a family favorite.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A starts a storytelling activity during dinner.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A instigates a sharing game at the table.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.6,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a \"thankful jar\" for the family.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke alarms and detectors.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family movie night.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets up candles and backup flashlights.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent B and C in kitchen help.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.6,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, the parent and homeowner, is organizing a family evening with his two children, Agent B and Agent C, in their living room. He creates a secure and engaging setting for a board game night, facilitates an uninterrupted experience, and focuses on togetherness.",
    "actions": [
      {
        "description": "Agent A checks all the locks on the doors and windows in the house.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a wholesome snack for the family.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A carefully explains the rules of the board game.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A encourages gentle competition and turn-taking.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A listens attentively to Agent C’s stories.",
        "values": [
          0.0,
          0.0,
          0.2,
          1.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A stands up to adjust the room's temperature.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A softly hums along to the background melody.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A insists on a group picture before starting the game.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests using funny accents during gameplay.",
        "values": [
          0.0,
          0.0,
          0.1,
          1.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen preparing a meal while their partner, Agent B, is setting the table. Their children, Agents C and D, are nearby, preoccupied with a book and a puzzle, respectively. The home environment is secure and calm.",
    "actions": [
      {
        "description": "Agent A initiates a group hug with Agent B and Agent D before dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A kneels to help Agent D with the puzzle for a moment, pointing out where a piece might go.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join in the meal preparation.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the family’s plans for the weekend, ensuring everyone's preferences are considered.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A carefully reviews the evening's meal to ensure it meets dietary needs.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A leads a conversation at the dinner table, encouraging everyone to share their day's experiences.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks that the front door is locked after dinner.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A offers to read a book to Agent D before bedtime.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A has prepared a surprise family movie night for Agent B, their spouse, and their children, Agent C and Agent D. They have created a comfortable viewing area in the living room and arranged snacks for everyone. Agent A calls the family to the living room to reveal the surprise.",
    "actions": [
      {
        "description": "Agent A dimming the lights to create a cinema-like atmosphere.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Picking out the most comfortable blanket and gently draping it over Agent B.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Offering to make popcorn for everyone, ensuring that Agent C's and Agent D's favorite seasonings are used.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Initiating a family vote to choose which movie to start with.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Pausing the film at appropriate times for a short family discussion or bathroom breaks.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Encouraging Agent C and Agent D to share their thoughts on the movie's plot.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Snapping a few candid photos of the family enjoying the movie without being intrusive.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Suggesting a brief intermission to stretch and check on everyone's comfort.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Asking Agent B if they need a break from seating and offering a quick massage.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a single parent, returns home after work to find Agent B, their child, doing homework and Agent C, their elderly parent, knitting in the living room. The house is secure and filled with a sense of warmth and familial presence.",
    "actions": [
      {
        "description": "Agent A hangs up their coat and places their keys on the hook by the door.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks on Agent B's homework, offering guidance.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.3,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A kneels down to tie Agent C's loose shoelace.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.1,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a board game to play with Agent B after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C on the couch, flipping through the family photo album.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A checks the oven to ensure the baked goods aren’t overcooking.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reassures Agent C about a minor concern.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A reads a bedtime story to Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A performs a routine check around the house to confirm all windows are secure.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy living room, Agent A plays guitar, creating a warm atmosphere as Agent B listens and Agent C joins, drawn by the music and presence of family. They share a moment of connection as a storm brews outside.",
    "actions": [
      {
        "description": "Agent A teaches Agent C how to play a simple tune on the guitar.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C complete the puzzle.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A puts down the guitar and reads aloud from a book.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes an indoor picnic with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A secures all windows and doors in anticipation of the storm.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A prepares flashlights and candles for possible power outages.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a cooperative board game for everyone.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation sharing fond family memories.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C build a blanket fort for fun.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult, has recently moved in with their partner, Agent B. They are hosting a cozy dinner with their close friend, Agent C, in their new home. The setting is warm and the focus is on enjoying a shared meal and good company.",
    "actions": [
      {
        "description": "Agent A pulls out a photo album to show Agent C, filled with memories from when Agent A and Agent B first met.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks that the oven and all appliances are turned off after dinner.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A leads a toast to their new chapter in life together with Agent B and includes Agent C in their expression of gratitude.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages everyone to move to the living room after dinner to relax on the couches and continue their conversations.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing a familiar board game that all three of them enjoy.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A helps clean up the table and pack leftovers, ensuring that food is not wasted.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A discreetly switches off unnecessary lights in the other rooms to conserve energy.",
        "values": [
          0.0,
          0.0,
          0.5,
          -0.4,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A brings out blankets for everyone, making sure they are comfortable as the evening cools down.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares funny anecdotal stories about the move and the decorating mishaps they had.",
        "values": [
          0.0,
          0.0,
          -0.3,
          1.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy, well-lit dining room, Agent A, a parent, finishes preparing a sumptuous dinner, while Agent B and Agent C, the children, are setting the table. A first-aid kit rests on a shelf, and a photo album lies open on the coffee table with family memories.",
    "actions": [
      {
        "description": "Agent A calls upon Agent B and Agent C to join at the dining table for dinner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A recounts a humorous story from their day, prompting laughter from Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A discusses with Agent B and Agent C the importance of knowing first-aid procedures.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B and Agent C on their initiative to set the table.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B and Agent C to share their school day experiences.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out the photo album to reminisce over past family vacations with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a light-hearted game of trivia during dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a family portrait after dinner to add to the photo album.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A gives a warm hug to Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a middle-aged parent, ensures that all windows are securely closed during a stormy evening, tries to connect with their two children, Agent B and Agent C, in the living room by offering to help with homework, suggesting activities, and preparing to share a meal together.",
    "actions": [
      {
        "description": "Agent A checks the doors are locked providing protection as the night advances.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A begins a gentle conversation with Agent B, suggesting they could have a movie night together later in the week.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the kitchen to serve dinner, calling over Agents B and C with a welcoming tone.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a cozy blanket for Agent C, who seems slightly chilly in the armchair.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B with a tricky homework problem after dinner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B about their music preferences and puts on some background music they both enjoy.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A invites both Agents B and C to join in a board game.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A shares a nostalgic story about one of Agent B’s childhood memories while they eat.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that Agent C teach them a few drawing techniques from their graphic novel.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B, a married couple, are enjoying a quiet evening at home together, sharing activities and a cozy environment enhanced by the sound of rain outside. While Agent B reads a book, Agent A peruses a family photo album in the kitchen.",
    "actions": [
      {
        "description": "Agent A decides to bring two cups of tea from the kitchen and sets down next to Agent B on the couch.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to share a significant, heartwarming story about a photograph in the album with Agent B.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates turning off the overhead lights to enjoy the ambiance create by the rain and soft room lights.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B collaboratively put a puzzle together, reminiscing about past experiences related to the puzzle's image.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests listening to calming music and asks Agent B to choose their favorite playlist.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A opts to prepare a surprise snack for themselves and Agent B, something they both find comforting.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sees that Agent B is nearing the end of their book, and quietly sets up a space on the couch for them to discuss the story.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A carefully selects and presents Agent B with a homemade gift.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A wraps the blanket around both themselves and Agent B to share warmth.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a teenager gathered in the cozy living room with their family including Agent B and Agent C. The weather outside is stormy, and the power has gone out. Agent B lights candles for warmth and suggests a board game while Agent C sets up the game on the coffee table.",
    "actions": [
      {
        "description": "Agent A checks the windows to ensure they are properly closed and locked during the storm.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B set up the board game and reads the rules out loud.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A fetches blankets to keep everyone warm and comfortable.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests each game move be accompanied by a funny anecdote from the player.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A carefully keeps the candles away from flammable materials and checks them regularly.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.1,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent C on their game strategy and luck.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug post-game to celebrate their togetherness.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to clean up after the game.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A encourages family to share what they are grateful for during the power outage.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy home, Agent A prepares dinner, Agent B tidies the living room, and Agent C sets the dining table. The family is readying for a pleasant evening meal together, indicating a time of bonding and attentiveness to each other.",
    "actions": [
      {
        "description": "Agent A initiates a conversation about each family member's day, encouraging sharing and listening.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes playing a cooperative board game after dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A carefully locks all the doors before sitting down for dinner.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A serves equal portions of the meal to avoid favoritism.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a group cleanup, turning a chore into a moment of collaboration.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A turns off distracting devices during dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A oversees that sharp kitchen tools are placed out of reach.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A leads the family in expressing appreciation for the meal and company.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family hug.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young father, is decorating a homemade birthday cake in a cozy, warmly lit kitchen. Agent B, his partner, is arranging the living room to be welcoming for guests. Agent C, their child, is drawing a picture on the sofa for Agent D, whose birthday they are celebrating. The house is filled with a comforting atmosphere and anticipation for the celebration.",
    "actions": [
      {
        "description": "Agent A finishes decorating the birthday cake with a heartfelt message.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A calls guests to check for dietary restrictions.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A admires Agent C's drawing and encourages adding color.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A absorbs the satisfaction of a well-prepared house.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plans to borrow missing candles for the cake.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A checks smoke detector batteries as a precaution.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A shares a laugh with Agent C over the child's artistic creation.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A plays a favorite music playlist to set a festive mood.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, enjoys a weekend evening at home with her family. She sits studying, her mother knits, and her father reads, with a group puzzle waiting on the table.",
    "actions": [
      {
        "description": "Agent A closes her books and suggests starting the puzzle as a family activity.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A makes sure the window is closed before a draft picks up.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.1,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A turns down the radio for Agent C to read without disturbance.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A carefully packs away her mother’s knitting set.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.2,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A prepares hot beverages, ensuring they're not too hot to handle.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A arranges comfortable seating for everyone.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A gathers blankets in case anyone feels cold.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a group photo to capture the moment post-puzzle.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young parent, is preparing a surprise dinner for Agent B, their partner, ensuring all precautions are taken while involving their child, Agent C, in the dinner preparations, creating a warm and inviting atmosphere in the home.",
    "actions": [
      {
        "description": "Agent A double-checks the smoke detectors in the house to ensure they are working properly.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.1,
          0.0
        ]
      },
      {
        "description": "After finishing the cooking, Agent A carefully stores the knife and other utensils out of Agent C’s reach.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A sits with Agent C, admires their drawing, and gently inquires about the details of their artwork.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A playfully sets the table with Agent C, creating a game where each table item is described before being placed.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A lights a candle in the middle of the table, creating a cozy atmosphere for Agent B's arrival.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help taste test the dish to see if it's ready, sharing laughter.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A opens the kitchen window to let in fresh air after cooking.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sends a text to Agent B hinting at a surprise awaiting their return.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A carries Agent C to another room to engage in a different activity while awaiting Agent B.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A observes their partner and child within the home, ensuring everything is under control and enjoying the familial atmosphere.",
    "actions": [
      {
        "description": "Agent A quietly observes Agent B’s cooking process, silently offering help if needed.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A takes a crayon and joins Agent C in drawing.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the baby monitor volume to hear the baby better.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to tell a story about their drawing.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A moves crayons near the edge back to the table to prevent a mess.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.3,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a post-dinner family game.",
        "values": [
          0.0,
          0.0,
          0.3,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A turns down the music as bedtime approaches.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A wraps Agent C in a hug, praising their artwork.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B with dinner preparations.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.5,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a single parent, arrives home from work to find Agent B, their teenaged child, cooking dinner, and Agent C, a close family friend, setting up for a movie night. The kitchen floor is slippery, and Agent B is struggling to open a jar.",
    "actions": [
      {
        "description": "Agent A carefully cleans the kitchen floor to remove the slip hazard.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent B in opening the jar, ensuring that no one gets hurt in the process.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A hugs Agent B as a sign of appreciation for their effort.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes setting the table together before the movie.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A ensures all kitchen appliances are off and doors are locked before the movie.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A fetches extra blankets for everyone's comfort during the movie.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a conversation with Agent C about their day.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.3,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A prepares the living room for an optimal movie-watching experience.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A makes popcorn for everyone during the movie.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is organizing a family game night at home with Agent B and Agent C. The environment is prepped with regard to preventing accidents and providing comfort. Agent A prepares snacks, Agent B selects music, and Agent C explores games to play.",
    "actions": [
      {
        "description": "Agent A brings snacks to the living room.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A helps select a game.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A discusses Agent B's school activities.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A reviews the fire escape plan.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a cooperative game.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A learns a new card game from Agent C.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A arranges seating.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A adds wall hangings.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.4,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories from their childhood.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing dinner in the kitchen, with their spouse, Agent B, setting the table, while Agents C and D are playing in the living room. The house is filled with the aroma of food and the sound of calming music, as the family anticipates enjoying dinner together.",
    "actions": [
      {
        "description": "Agent A ensures the home is secure by checking locks before dinner.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A fosters gratitude during dinner by sharing positive thoughts.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a game night for family bonding.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A supports Agent C's learning by assisting with homework.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A surprises the family with a weekend trip planning.",
        "values": [
          0.0,
          0.0,
          0.6,
          1.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A leads the creation of a family emergency plan.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent D prepare a special family breakfast.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A mediates a conversation about sharing after a game dispute.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.3,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a home family photo session.",
        "values": [
          0.0,
          0.0,
          0.3,
          1.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy, well-lit kitchen, Agent A is preparing a family dinner. A tantalizing aroma fills the space. Agent B, Agent A's partner, is setting the dining table with care, choosing placemats and cutlery. Soft music plays in the background. Agent C, their teenage child, is completing homework at the kitchen island, occasionally glancing up and contributing to the conversation. The family dog is resting by the door. The scene is warm, the mood is gentle and relaxed.",
    "actions": [
      {
        "description": "Agent A turns on the stove's exhaust fan to ensure the kitchen is well ventilated while cooking.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a spontaneous family dance in the kitchen while waiting for the food to cook, prompting laughter and shared enjoyment.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A checks the batteries in the smoke detector as part of regular household maintenance.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent C about their day, showing attentiveness and encouragement.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old family photo album to share stories and memories with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A decides to involve Agent C in the cooking process to teach them a family recipe, fostering teamwork and skill-sharing.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A lights candles and dims the kitchen lights for a soothing ambiance during dinner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A carefully places the sharpest kitchen utensils out of reach when not in use.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A puts their phone away to focus on the family, emphasizing connection without distractions.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is organizing a family game night in their warm and inviting living room. Agent B is preparing refreshments, and the kids, Agent C and Agent D, are choosing the game. There is a pleasant atmosphere of anticipation and comfort.",
    "actions": [
      {
        "description": "Agent A carefully reviews the board game rules to prevent disputes.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A involves everyone in selecting the game.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector to ensure it's working.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent D to share their game selection reasoning.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the room lighting for everyone's comfort.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A secures the space by putting away breakable items.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A offers help and company to Agent B in the kitchen.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a team game to encourage collaboration.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A demonstrates good sportsmanship during games.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a parent, is preparing a special family dinner in a well-equipped kitchen as a storm brews outside. Agent B, their partner, is reading on the sofa, and Agent C, their teenager, is drawing in their room. The ambiance sets a mood for a cozy family evening indoors.",
    "actions": [
      {
        "description": "Agent A checks the smoke detectors in the home to ensure their functionality before starting to cook.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a balanced meal keeping in mind their family's dietary restrictions and preferences.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent B about the book they are reading to share the moment.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help in the kitchen, offering to teach a family recipe.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table with care, including candles for a soothing ambiance despite the storm.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A keeps the kitchen floor dry and clear of obstacles to prevent any slips or falls.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a casual indoor game for the family to play after dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A plans an indoor scavenger hunt for Agent C to play, using clues related to family memories.",
        "values": [
          0.0,
          0.0,
          0.3,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to share stories from their own youth during dinner to encourage conversation.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In the evening, Agent A is cooking, Agent B is arranging the living room, and Agent C is working on school assignments. The household is engaged in preparations for a family movie night.",
    "actions": [
      {
        "description": "Agent A taste-tests the soup, adjusting the seasoning.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A turns down the burner to ensure the soup doesn’t overcook.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A fixes a wobbly chair leg to prevent mishaps.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A plays soft music to create a pleasant dining atmosphere.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A embraces Agent B, expressing gratitude.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers assistance with Agent C's homework.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a post-movie family board game.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A dims the lights for dinner.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to pause their studies.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, their spouse Agent B, and their child Agent C are comfortably spending time together in the living room. The setting is cozy, with a warm fire, quiet activities, and soft music, allowing for relaxation and familial bonding.",
    "actions": [
      {
        "description": "Agent A puts the book down and starts a conversation with Agent B about their day, showing interest in their knitting project.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A gets up to adjust a picture frame on the mantelpiece that was crooked.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.1,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A pauses their reading to help Agent C with their study material.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to make a round of warm beverages for everyone.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A whispers a funny anecdote to Agent B.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.3,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plays a favorite family album.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A carefully adds a log to the fire.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to share what they've been learning.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.5,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a young parent busy arranging photo albums in their new home, Agent B is prepping dinner, and Agent C is sketching in the living room.",
    "actions": [
      {
        "description": "Agent A joins Agent C and begins to draw with them, relishing in the shared quiet moment.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C by enhancing their drawing skills, nurturing their talent.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A locks the doors, thereby securing their home.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent B in conversation about daily occurrences.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A protects fragile photos from potential mishaps.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.3,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A updates and displays the emergency contact list on the fridge.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a playful drawing game with Agent C, filling the room with cheer.",
        "values": [
          0.0,
          0.0,
          0.2,
          1.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the home's security by fitting a new smoke alarm.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B spend quality moments by reminiscing over photographs.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.9,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A finds Agent B sick on the couch with Agent C providing care. The living room is set up for recovery, and Agent A seeks to improve the situation.",
    "actions": [
      {
        "description": "Agent A suggests watching a comedy movie to brighten the mood.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers to prepare a fresh bowl of chicken soup for Agent B.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a comfortable pillow behind Agent B's back to help them feel more at ease.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves a blanket from their room and drapes it over Agent B to provide additional warmth.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A decides to play a board game with Agent B, choosing one that is not too strenuous.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A gently inquires about how Agent B is feeling and listens attentively.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes the initiative to tidy up the living room, creating a more pleasant and orderly space.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A checks the house’s first-aid kit to ensure it is well-stocked and easily accessible.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A plans to spend the night on the sofa near Agent B in case they need anything.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.4,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, reading comfortably in the living room as Agent B cooks and Agent C shares their day, is surrounded by familial warmth. The setting encourages family interactions and shared responsibilities, underlining a secure and heartwarming atmosphere.",
    "actions": [
      {
        "description": "Agent A suggests a board game after dinner to enhance family time.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent B in the kitchen unasked.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help set the table.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A lets Agent C select dinner music.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A discusses vacation plans with the family.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family walk after dinner.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A listens to Agent C's school challenges.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A stores leftovers properly.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A tidies up the living room.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.3,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A completes dinner preparations and creates a welcoming atmosphere in the dining room for Agent B and Agent C. The family enjoys the meal together, sharing stories and engaging in conversation. Agent A ensures the home is secure from the storm and fosters a sense of closeness through various interactive suggestions and supportive gestures.",
    "actions": [
      {
        "description": "Initiates a game about sharing positive daily experiences.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Brings out old photos to share and reminisce.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Reassures the family's well-being by checking home security during a storm.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Offers a private conversation to Agent C who is quieter than usual.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Suggests a group activity to maintain engagement after dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Cares for Agent C's injury while providing emotional comfort.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Expresses gratitude to Agent B for help in cooking.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Surprises the family with a new puzzle as a collective activity.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Adjusts the music to a calmer setting as the weather outside gets rough.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.5,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is relaxing on the couch with their spouse, Agent B. Their young child, Agent C, plays quietly on the rug. The room is warm and cozy. Agent B brings a blanket for Agent A, spreading the sense of comfort. They engage in tender care and attention with each other and Agent C.",
    "actions": [
      {
        "description": "Agent A gently brings Agent C onto the couch to share the warmth of the blanket.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C in building a pillow fort for imaginative play.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a quiet game of pretend with Agent C, giving life to stuffed animals.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A gently declines Agent C's request for a cookie but offers a healthy snack.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.2,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shows interest in Agent B's day, engaging in conversation.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A gives comfort to Agent B with a supportive hand.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A checks the house locks for security.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A reminisces over family holidays with an album.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A reads a storybook to Agent C with funny character voices.",
        "values": [
          0.0,
          0.0,
          0.4,
          1.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a parent, is in the home's spacious, well-lit kitchen prepping dinner. Agent B, their partner, sits at the dining table, and Agent C, their teenage child, is setting up the table for dinner.",
    "actions": [
      {
        "description": "Agent A checks that the smoke detector in the kitchen is working to ensure that it is functional in case of emergency.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A kisses Agent B on the forehead before serving dinner, as a small sign of affection.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A adjusts the lighting in the dining area to a warm hue to create a comfortable ambiance for the meal.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A chooses a recipe that includes everyone's favorite dishes to make the meal enjoyable for the whole family.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A ensures that all the sharp kitchen tools are out of reach from any potential harm to the family.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sits down at the table to share a moment of gratitude with Agent B and C before eating.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates a playful game where each family member shares a funny story from their day.",
        "values": [
          0.0,
          0.0,
          0.1,
          1.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A comes home from work to find their spouse, Agent B, cooking and their child, Agent C, doing homework. The household is filled with a serene atmosphere, warm smiles, and soft music.",
    "actions": [
      {
        "description": "Agent A assists Agent B with meal preparation by offering help.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.3,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets the dining table with care and attention.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A sits with Agent C to work through a challenging homework problem.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to share their school experiences.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A places a fresh bouquet of flowers on the table to beautify the setting.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game night to play Agent C's favorite board game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk after dinner for conversation and light exercise.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A embraces Agent B and Agent C, showing gratitude for their company.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A ensures that the home is secure by checking the locks on doors and windows.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A arranges a cozy indoor picnic with string lights, a comfortable blanket, pillows, a snack basket, and a card game for the family. Agent B selects soothing music, and Agent C prepares the card game, while a storm brews outside.",
    "actions": [
      {
        "description": "Agent A checks that the doors and windows are securely locked.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A places a small first aid kit near the picnic spot.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A dims the lights to enhance the ambiance.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A leads a family card game for everyone's enjoyment.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B and C on their contributions.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal childhood story.",
        "values": [
          0.0,
          0.0,
          -0.3,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug with the family.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.4,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses precautionary plans for the storm.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests sharing things they’re grateful for.",
        "values": [
          0.0,
          0.0,
          -0.2,
          1.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home, Agent A, parent, holding a sleeping toddler, is surrounded by their partner, Agent B, who is engaged with a family photo album, and their eldest child, Agent C, building a card house, with family dog, Agent D, lying close.",
    "actions": [
      {
        "description": "Agent A slowly stands up and gently places the toddler into a crib.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A whispers encouragement to Agent C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with the photo album.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A prepares warm tea for Agent B.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B watch a film on the couch.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family walk.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plays a soft lullaby on the sound system.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C with the card house.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a family board game.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young parent, is in the kitchen preparing a family dinner with a gentle hum of conversation in the background. Agent B is setting the table, while Agent C works on a school project, occasionally seeking Agent A's input.",
    "actions": [
      {
        "description": "Agent A ensures all sharp utensils are out of reach of younger family members.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A adds an extra dish that Agent B enjoys.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C prepare a simple dessert together.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game night after dinner.",
        "values": [
          0.0,
          0.0,
          -0.1,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A listens carefully to Agent C's school project explanation.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a balanced meal for the family's nutritional needs.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A surprises the family with an impromptu storytelling session.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A puts on gentle background music during dinner.",
        "values": [
          0.0,
          0.0,
          -0.3,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk for relaxation after dinner.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, together with her partner Agent B, is in a serene home environment where Agent C is baking pastries and Agent D is assembling a puzzle. Agent A is reminiscing over family photos, filled with memories of shared times.",
    "actions": [
      {
        "description": "Agent A initiates a game of charades with the family.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C in baking, enhancing the experience of making pastries.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers to read a chapter aloud from Agent B's novel.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A brings the family photo album to the table to share with the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A tries to find the correct placement for a puzzle piece with Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A closes and locks an ajar back door, ensuring it is secure.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts on music and invites the family to dance.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A establishes a video call for a virtual family gathering.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a warmly lit kitchen, Agent A prepares a family recipe stew, Agent B interacts with a photo album, and Agent C sets the dining table while Agent D reads in the living room. The atmosphere is cozy with an inviting dinner soon to be served.",
    "actions": [
      {
        "description": "Agent A asks Agent B to join in selecting the evening's music playlist to enhance the mood for dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks and adjusts the fire alarm to ensure it is working properly before starting to cook.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A turns down the flame under the pot to let the stew simmer gently, preventing any overcooking.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.3,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to taste the stew for feedback to improve the flavor.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A carefully wipes down the stovetop and any spills to maintain cleanliness.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A begins plating the food attractively for everyone.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A calls Agent D to join at the table, making sure they are included.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A shares a family story related to the recipe with Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A encourages each person to share a good thing from their day.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "It’s a typical Friday evening. Agent A is preparing dinner as Agents B and C, their children, are setting the dining table. The atmosphere of the home is warm and promotes a strong sense of family unity.",
    "actions": [
      {
        "description": "Agent A initiates conversation during dinner, asking Agents B and C the highlight of their day.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a walk after dinner for fresh air and a look at the night sky.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family game night after dinner, selecting a board game that encourages teamwork.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A checks doors are locked before dinner.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A praises Agents B and C for their effort at setting the table, highlighting cooperation.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a new puzzle for the family to assemble after the game night.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agents B and C in making a special dessert together after dinner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agents B and C a family recipe, sharing related stories.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a family meeting to involve Agents B and C in planning future activities.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.4,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A arrives home to a well-ordered, tranquil environment, warmly greets Agents B and C, and engages in supportive household activities.",
    "actions": [
      {
        "description": "Agent A checks the locks on doors and windows to ensure they are secured.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with a challenging math problem, explaining it patiently.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table with Agent B, making sure to include Agent C's favorite utensils.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A replaces the batteries in the smoke detectors.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a gentle group hug with Agent B and Agent C before they start eating.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A listens attentively to Agent B's account of their day while preparing a cup of tea for them both.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A draws a bath for Agent C, checking the water temperature for comfort.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A tells a story about their childhood during dinner to share a personal experience with Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.4,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family movie night, selecting a film that everyone enjoys.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing dinner in the kitchen with Agent B setting the table. Agent C comes in suggesting a board game after dinner, while Agent A offers the idea of making it a weekly family event.",
    "actions": [
      {
        "description": "Agent A sets a timer for each dish to ensure they don't overcook.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.3,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the family at dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A reminisces on family memories during dinner.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.5,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to help decorate the dessert.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A introduces a new dish to the family.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing the board game and explains the rules.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A arranges comfortable seating for the board game.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A gives cooperative advice to Agent C in the game.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.4,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing dinner in the kitchen. Agent B wraps gifts, and Agent C does homework. The family engages in small interactions in a warm, secure home environment while a meal is being prepared, and gentle music plays.",
    "actions": [
      {
        "description": "Agent A initiates a conversation with Agent C about their day while continuing to prepare the meal.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A taste-tests the dish he's preparing.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up a water spill on the kitchen floor.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to set the table.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the front door lock.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A selects a playlist for dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with a homework question.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.2,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B on gift wrapping.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A reminds everyone to wash hands before eating.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, settling in the living room picks up a book, while Agent B, Agent C, and Agent D are respectively preparing dinner and playing a board game. A homely atmosphere prevails with familial interactions imminent.",
    "actions": [
      {
        "description": "Agent A prepares a cozy space for Agent B with pillows to relax after kitchen work.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A joins in the board game with Agent C and Agent D to bond and share enjoyment.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A reads a bedtime story to Agent C and Agent D.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B set the dinner table and enhances the evening with fresh flowers.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing a family-favorite playlist during dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A secures doors and windows before bedtime.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A organizes toys and board games, ensuring a tidy space.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a conversation with Agent B, offering comfort.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates viewing old photo albums with the family.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A tucks their child into bed, with Agent B making herbal tea and Agent C knitting in the living room. The setting is a warm, secure home environment where family members are carrying out evening routines that envelop their surrounding with care.",
    "actions": [
      {
        "description": "Agent A carefully makes their way to the kitchen, where they whisper with Agent B to not wake up the child.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.1,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A decides to prepare a surprise home-cooked meal for Agent B to enjoy together once the child has fallen asleep.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C in the living room, asking if they need any supplies for their knitting project and sharing stories.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A discreetly picks up scattered toys around the house, to avoid anyone tripping over them in the night.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A tenderly covers Agent C with a blanket when noticing they’ve dozed off in the recliner.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plans a future family outing, jotting down notes that consider everyone's preferences and needs.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A checks the doors and windows to ensure everything is locked and secure for the night.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A sits with Agent B on the porch for a bit, engaging in a quiet conversation under the starry sky.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A installs a new smoke detector in the house to further ensure the well-being of the family.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B, a married couple, are hosting a small gathering at their home with Agent C, a longtime friend, and Agent D, Agent B's sibling. They engage in a board game and share stories and souvenirs.",
    "actions": [
      {
        "description": "Agent A goes outside to secure the garden furniture from the incoming storm.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make a round of hot beverages for everyone to enjoy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to show more of the souvenirs.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests moving the group activity from the board game to storytelling.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes a group photo to capture the moment of togetherness.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent D with the table setting process, making it a cooperative task.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.4,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A lights some candles to create a warm ambiance as the clouds darken the sky.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A plays a special song that holds fond memories for the whole group.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A returns home to a welcoming environment, with Agent B cooking and Agent C studying. The feeling of warmth and the aroma of dinner set a comforting tone for their arrival. Agent A locks the door and joins in the family’s evening routine, engaging in activities that strengthen familial bonds.",
    "actions": [
      {
        "description": "Agent A joins in to aid with the final steps of cooking dinner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A aids Agent C with homework, offering clarification and support.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family game night to foster enjoyment and unity.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A gives Agent B a comforting shoulder rub as they converse about their day.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a snug reading area for everyone to enjoy.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates regular family discussions to plan and connect.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A embraces Agent C, offering solace during a stressful moment.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A performs a routine security check before the night ends.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, mother, with her children, Agent B and Agent C, is in the living room. Agent B sketches while Agent C plays the piano, as dinner is being prepared and a storm is brewing outside.",
    "actions": [
      {
        "description": "Agent A gathers pillows and blankets to create a cozy fort.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B how to make shadow puppets.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C at the piano for a duet.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A checks doors and windows before the storm.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A brings an emergency kit to the living room.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family game night after dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the dining table specially for the family meal.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug with Agent B and C.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A discusses Agent B's artwork and encourages him.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home, 'Agent A' invites her family for an evening of sharing family stories from photo albums during a thunderstorm.",
    "actions": [
      {
        "description": "'Agent A' retrieves a blanket and drapes it over herself and 'Agent C'.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "'Agent A' suggests playing a family board game.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "'Agent A' prepares hot cocoa for everyone.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "'Agent A' lights candles in anticipation of a power outage.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "'Agent A' turns off the music for conversation.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "'Agent A' positions a flashlight strategically.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "'Agent A' encourages 'Agent C' to share a recent positive experience.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "'Agent A' starts a family storytelling chain.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "'Agent A' brings out a family scrapbook.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy, warmly lit living room, Agent A is seated on a plush sofa, deeply engaged in a novel. Agent B is assembling a family photo album. Faint classical music plays, and the smell of dinner wafts from the kitchen, promising a comforting end to the day. Agent C, a friend, engaged with a laptop, participates in the exchange of smiles and quips.",
    "actions": [
      {
        "description": "Agent A initiates a discussion about an intriguing plot twist.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A checks the locks on the doors and windows as evening sets in.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with the photo album, sharing memories.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make tea for everyone.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal story related to the classical music.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a group board game after dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with a technical laptop issue.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A asks if Agent B needs a break from the photo album.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.3,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent C in a debate about the composer's works.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agents A and B, a married couple, and their child Agent C partake in a family game night in their warm and secure living room. Agent A has recently installed new locks and spends the evening engaging in activities that strengthen their family bond.",
    "actions": [
      {
        "description": "Agent A helps Agent C understand a complex rule of the board game.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A puts an arm around Agent B, giving a gentle squeeze.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A gets up to check if the front door is locked after hearing a noise.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A claps and cheers for Agent C after a good move in the game.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A pauses the game temporarily to grab a first aid kit for Agent C's paper cut.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests creating a weekly game night tradition.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A puts on some soft music in the background.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about each family member's favorite part of the day.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a blanket and wraps it around Agent B.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.5,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a middle-aged parent, is sitting in the living room on a pleasant Sunday afternoon with Agent B, the child, Agent C, the spouse, and Agent D, the teenager. The family is engaging in quiet activities and sharing warm interaction.",
    "actions": [
      {
        "description": "Agent A decides to leave comforting notes in the family photo album for members to find later.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A gets up to assist Agent D with the meal preparation in the kitchen.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a spontaneous group hug with the family.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent C on the meticulousness of the organization.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A brings over a soft blanket for Agent B.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A carefully picks a difficult puzzle piece for Agent B.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A tells a humorous story from the past.",
        "values": [
          0.0,
          0.0,
          0.1,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes out a board game for the family to play.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A finds an old recipe and proposes to cook it together next weekend.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy family home, Agent A reads while Agent B cooks and Agent C concentrates on a puzzle, showing silent coexistence and mutual regard in their independent activities.",
    "actions": [
      {
        "description": "Agent A offers to help Agent B with dinner preparations.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A kisses Agent B's forehead softly before fetching plates.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family game night after dinner.",
        "values": [
          0.0,
          0.0,
          0.3,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A repairs a loose nail on the back door with a toolkit.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about vacation plans during dinner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent C on their puzzle progress.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen after the meal.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to read a bedtime story together.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A reviews work emails but remains detached to keep the evening relaxed.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.5,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A prepares a warm and inviting meal at home for their two children, Agent B and Agent C. The household is steeped in a sense of warmth and the aroma of dinner. The children are nearby, engaged in a quiet game, while a family atmosphere of care and attention pervades.",
    "actions": [
      {
        "description": "Agent A checks the smoke detectors to ensure they are functional.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a first aid kit and places it in an easily accessible location.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside time for a weekly family game night to enhance family bonding.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A installs nightlights in the hallway to prevent tripping when it's dark.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B and Agent C to share their thoughts about their day during dinner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B and Agent C to help with preparing a dish to teach them cooking skills.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A creates a family emergency plan and discusses it with the children.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides against keeping a recently purchased decorative item with sharp edges, considering it unsuitable for the children's play area.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A hugs Agent B and Agent C before tucking them into bed, reinforcing emotional bonds.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a father, is cooking a family-favorite meal, Agent B is setting the table, Agent C is working on a school project at the dining table, and Agent D is seeking help with a puzzle. The kitchen is warm and filled with the aroma of cooking and sounds of a familiar tune.",
    "actions": [
      {
        "description": "Agent A asks Agent D to choose their favorite puzzle piece to place together.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A gently assists Agent C with part of the school project that involves kitchen science.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A inquires about Agent B’s day, showing genuine interest while cooking.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors in the house.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a table decoration competition with the family.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A reads a recipe aloud, asking the family for their preferences.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A checks that the first aid kit is fully stocked.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.1,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A reminds Agent C to take a stretch break.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares a funny family story, sparking laughter.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a young adult reading a novel on the living room sofa, Agent B is sketching at the dining table, and Agent C bakes cookies in the kitchen, with a tranquil and contented household atmosphere.",
    "actions": [
      {
        "description": "Agent A bookmarks their page and decides to join Agent B at the table to look at their sketches.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A gets up and stretches before heading over to the kitchen to see if Agent C needs any help with the cookies.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to play a board game later to enjoy together with Agent C and Agent B.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a light conversation with Agent B about their day and any new ideas they have for sketches.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to teach them how to make cookies another day.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A slowly reads aloud from their novel, sharing an interesting part of the story with Agent B.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out some old photo albums and invites Agent B and Agent C to reminisce over past family events.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C in setting the table for a cozy afternoon snack once the cookies are ready.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make tea to go with the cookies Agent C baked, enhancing the afternoon for everyone.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young parent, has put their baby to sleep and joins their partner, Agent B, and their elder child, Agent C, for a quiet board game night in a warm and cozy living room, ensuring that the environment is peaceful and secure.",
    "actions": [
      {
        "description": "Agent A whispers a suggestion to play a less noisy board game, considering the baby sleeping nearby.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A gently wraps a blanket around Agent C, ensuring they are warm and comfortable.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A glances back towards the nursery, checking on the baby.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A softly plays calming music at a low volume.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A enquires about Agent C's book, showing interest in their child's hobbies.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A dims the lights further to prevent any bright light from startling the baby.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.3,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A cuts slices of apple for the family to share during the game.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to hug Agent B, acknowledging the game set up effort.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A carefully locks the front door before fully engaging in the game.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a parent arriving home greeted by a comforting household environment where Agent B, their partner, and Agent C, their child, are preparing dinner, with the family dog, Agent D, close by.",
    "actions": [
      {
        "description": "Agent A joins Agent B at the stove to help finish cooking dinner.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A picks up Agent C, swinging them around playfully before setting the child down.",
        "values": [
          0.0,
          0.0,
          -0.3,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes extra care to pet Agent D, ensuring the dog feels included in the family's evening.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A talks with Agent B about their day, making eye contact and listening intently.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A grabs a vase and places some fresh flowers from the garden to adorn the dinner table that Agent C set.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A leads a collaborative cleanup, turning it into a light-hearted game with Agent B and C.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a board game for the family to play together after dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with their homework, explaining a difficult math problem patiently.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A inspects the locks on doors and windows as a nighttime routine before going to bed.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "It's a cold and dark evening, and the family is gathering in the living room when the power goes out. Agent A proactively ensures everyone's comfort and entertainment.",
    "actions": [
      {
        "description": "Agent A retrieves flashlights from the storage drawer.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A checks the household emergency kit.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A lights a candle for Agent C's continuance of a school project.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A wraps a shawl around Agent B.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts a game of charades.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests storytelling for bonding.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A shows interest in Agent C's school project.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent D in the kitchen.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B check the breaker box.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a warm, secure living room, Agent A observes Agents B and C, their children, playing a game. With the rain outside, the family engages in activities that deepen their bond while maintaining an environment of comfort and preparation.",
    "actions": [
      {
        "description": "Join the board game.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Fetch and drape blanket.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Prepare and serve hot cocoa.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Propose game night prize.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.2,
          0.0
        ]
      },
      {
        "description": "Reminisce over family videos.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Discuss favorite memories.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.5,
          1.0,
          0.0
        ]
      },
      {
        "description": "Broach sensitive topic.",
        "values": [
          0.0,
          0.0,
          -0.3,
          -0.2,
          0.8,
          0.0
        ]
      },
      {
        "description": "Build pillow fort.",
        "values": [
          0.0,
          0.0,
          0.3,
          1.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Fix electrical socket.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Within a warm home, Agent A creates a nurturing environment through cooking, while Agent B is engrossed in work, offering supportive exchanges with Agent A. Agent C and D are each independently occupied but remain connected as a part of the familial unit, an environment of mutual acknowledgement and subtle interaction pervades.",
    "actions": [
      {
        "description": "Agent A pauses making dinner to sit and engage with Agent B about their day.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A ensures the smoke detector is working before cooking.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A leads a playful game of charades with the family after eating.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A brings Agent D’s preferred blanket to provide added comfort.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A secures the house by locking all doors as night falls.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C about the content of their book.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A includes Agent D in the final steps of dinner prep for a joint activity.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A makes hot cocoa and initiates a family conversation on the day’s highlights.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a parent, has finished preparing a family meal. Agent B is looking through photo albums while Agent C sketches. The atmosphere is filled with nostalgia and warmth, with laughter echoing as memories are shared.",
    "actions": [
      {
        "description": "Agent A organizes an impromptu family game night.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A begins a conversation on family emergency plans.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets a time each week for family creative sharing.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A brings out old albums and home videos for dinner.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A plans a surprise weekend family getaway.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C cook a family recipe together.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A seeks feedback on enhancing household spaces.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A creates a cozy reading nook in the house.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A installs updated smoke and carbon monoxide alarms.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is in the living room going over a scrapbook with Agent B and C. They prepare a board game to play together, adjusting the environment, sharing memories, and promoting enjoyment and togetherness.",
    "actions": [
      {
        "description": "Agent A adjusts the furniture in the living room to prevent accidents.",
        "values": [
          0.0,
          0.0,
          0.7,
          -0.2,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A gives a gentle reminder to Agent C about the rules of the game.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.1,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A lets Agent C win a round in the game.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A pauses the game to fix a snack for everyone.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.7,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares a fond memory related to the game.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to come up with a creative strategy in the game.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests putting on some light music to enhance the atmosphere.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A instigates a group hug after the game.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.4,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes a photo during the game to add to the scrapbook.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, joins their younger sibling, Agent C, at the dining table, offering assistance with homework, while their parent, Agent B, cooks dinner in the kitchen. The cozy, well-prepared household sets the stage for a peaceful evening where the family engages in activities that underscore attentiveness and support.",
    "actions": [
      {
        "description": "Agent A helps Agent C with a difficult math problem.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A shares a humorous story with Agent C to lighten the mood.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table for dinner to assist Agent B.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A carefully cuts and serves a piece of cake to Agent C, considering their preference.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family board game after dinner to enjoy together time.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up spills in the kitchen immediately to prevent slips and maintain a tidy space.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A fetches blankets for the family during movie time for added comfort.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A patiently listens to Agent B recounting an office story, showing attentiveness.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to take a small break from homework to enjoy dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a meal for a family gathering, ensuring the environment is warm and welcoming. Agent B sets the dining area, Agent C creates the perfect playlist, and Agent D shares stories.",
    "actions": [
      {
        "description": "Agent A checks smoke detectors.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A avoids food allergies.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A attends to Agent D's comfort.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A opens windows for fresh air.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.4,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A cooks a recipe with Agent C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside a quiet room.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A plates food attractively.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A makes a grateful toast.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is seated on the couch with a book. Agent B is playing on a tablet on the rug, and Agent C prepares snacks in the kitchen. The living room feels serene with photos, music, and warm daylight. Agent A assists Agent C with the snacks and engages the family in group activities and conversation.",
    "actions": [
      {
        "description": "Agent A puts down the book to help Agent C distribute the snacks and drinks.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a board game from the shelf and suggests playing it together as a group.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A turns off the tablet Agent B is using to encourage a break and family interaction.",
        "values": [
          0.0,
          0.0,
          0.3,
          -0.2,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation on what movies they could watch together later in the evening.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out extra cushions from the storage ottoman to make the seating area more comfortable for everyone.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A decides to lay out a soft, warm blanket over Agent B, who has dozed off on the rug.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A carefully checks that the front and back doors are locked to ensure the household's security.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a light stretching exercise for everyone to do together to re-energize after lounging for a while.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.5,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, with support from Agents B and C, transforms the family attic into a cozy reading nook, emphasizing a thorough approach to renovation while nurturing emotional bonds and creating an enjoyable space.",
    "actions": [
      {
        "description": "Agent A researches and purchases sturdy, secure shelving units.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family meeting to finalize the design plans.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A plays Agent B's favorite music playlist.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A salvages family photos and makes a photo collage.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A designates a corner with classic family board games.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A installs soft, ambient lighting.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.9,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A plans a 'first reading' event with selected books.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In the softly lit living room, Agent A, her brother, Agent B, and their grandmother, Agent C, are gathered during a stormy evening. They are sharing time together completing a puzzle and exchanging playful banter.",
    "actions": [
      {
        "description": "Agent A suggests unplugging electrical devices due to lightning.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make tea for everyone.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories from an old photo album.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A assists Agent C to a more comfortable chair.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests teaming up on the puzzle with Agent B.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A covers Agent C with a blanket when she shivers.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to charades for Agent C's entertainment.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up to avoid tripping hazards.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug during a loud thunderclap.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.7,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is seated on a cozy living room couch, Agent B is knitting on the floor, and Agent C is working on a jigsaw puzzle. Occasional exchanges of smiles and nods fill the room with a soothing classical soundtrack.",
    "actions": [
      {
        "description": "Agent A decides to join Agent C in completing the jigsaw puzzle, assisting in finding the remaining pieces.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A gets up to prepare a hot chocolate for Agent B and themselves.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B on the progress of the blanket, admiring the design and choice of colors.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to share interesting facts they recently read in one of the books from the shelf.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves a throw from the nearby linen closet and drapes it over Agent C’s shoulders.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes a photo of the moment, capturing the coziness of the evening with Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to the family to make plans for a future vacation, initiating a conversation about possible destinations.",
        "values": [
          0.0,
          0.0,
          -0.4,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A gently adjusts the volume of the music to better suit the relaxing mood of the room.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A decides to write down a quote from their book to share with a friend who enjoys literature.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.3,
          -0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In the family home, Agent A is cooking dinner while Agent B reads and Agent C draws. The house is cozy, with a storm brewing outside. The family shares the space, surrounded by warmth and the comforting smell of stew.",
    "actions": [
      {
        "description": "Agent A checks the weather and ensures that the house is secure with the impending storm.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the drawings with Agent C, showing interest in their creative efforts.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A brings the family together for a lively game of charades, creating laughter and fun.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent B in the evening by encouraging them to read a book aloud, enjoying shared storytime.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "To enhance the ambiance, Agent A lights candles, mindful of the weather while ensuring the space is inviting.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proactively cleans the kitchen, minimizing the risk of accidents as the evening progresses.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.1,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent C is encouraged to share their artwork with Agent B, deepening the siblings' appreciation of each other's hobbies.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "A spontaneous dance party is initiated by Agent A, creating an energetic and joyful moment for everyone.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "A special eating area is prepared by Agent A, making dinner more memorable and comfortable.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Inside a cozy well-lit living room, Agent A is sitting on the couch with a book while Agent B and Agent C play with a puzzle on the floor. The atmosphere is tranquil, with a soft glow from the fireplace adding to the ambiance. Safety measures like an accessible first-aid kit and a fire extinguisher are subtly in place.",
    "actions": [
      {
        "description": "Agent A gets up to check if the front and back doors of the house are locked.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent B and Agent C about their day.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agents B and C in completing the puzzle.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a family favorite snack for everyone.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests telling stories while working on the puzzle.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A offers a warm hug to Agent B and Agent C after a mishap.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.5,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to stoke the fire, keeping the room warm.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a soothing playlist of music.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "In their living room, Agent A watches over their children, Agent B and Agent C, who engage in their activities. Agent A creates a secure, nurturing environment for their children, fostering close bonds and shared joy.",
    "actions": [
      {
        "description": "Agent A gathers everyone in the kitchen to work together on finishing a pie.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C get crayons from a high shelf.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A talks to Agent B about their school day.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a crafting space for greeting card creation.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a pillow fort activity.",
        "values": [
          0.0,
          0.0,
          -0.3,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A starts a gentle tickle fight.",
        "values": [
          0.0,
          0.0,
          -0.5,
          1.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detectors.",
        "values": [
          0.0,
          0.0,
          1.0,
          -0.2,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A takes a photo of Agent B and C's work.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A leads a family relaxation session.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.8,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is finishing a birthday cake in the kitchen while Agent B sets up for a movie night. The house smells of baking and soft music is playing. Agents C and D are chatting upstairs, unaware of the surprise waiting for them: a cozy living room with family albums ready for a celebration.",
    "actions": [
      {
        "description": "Agent A carefully stores sharp kitchen utensils and tools after use.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A secures the freshly baked cake on the counter.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A checks smoke detectors before lighting birthday candles.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A surprises Agents C and D with a birthday celebration.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares memories with family using photo albums.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.6,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A shows affection toward Agent B during the celebration.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A expresses heartfelt thanks to each family member.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up after the party for a tidy home.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.4,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "A mother is preparing dinner, the father is assembling a bookshelf, and their daughter sets the table in a home environment. The scene encapsulates a common family evening, filled with routine yet significant activities.",
    "actions": [
      {
        "description": "Agent A oversees Agent B's progress with the bookshelf, offering to lift and secure parts.",
        "values": [
          0.0,
          0.0,
          0.7,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to cook together, bonding over a family recipe.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A prepares refreshing ice water with lemon and mint for the family.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a break for a short, relaxing family chat before dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up a spill immediately to avoid slips.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A checks all doors and windows are locked before dinner.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A starts a sharing of positive daily events during dinner.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A keeps a first aid kit in the kitchen drawer.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A ensures food is not too hot as not to burn anyone.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.6,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a father, is playing a strategic board game with his children, Agents B and C, fostering teamwork and celebrating their achievements in a comfortable, secure home environment.",
    "actions": [
      {
        "description": "Agent A adjusts the loose rug to prevent potential trips.",
        "values": [
          0.0,
          0.0,
          0.7,
          -0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a break to make sandwiches together.",
        "values": [
          0.0,
          0.0,
          0.6,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A listens attentively to Agent C's excitement about the game.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A makes the playing area more comfortable with cushions.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a 'family hug' after the game.",
        "values": [
          0.0,
          0.0,
          -0.1,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A checks the smoke detector's batteries.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B's teamwork.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A discusses sportsmanship after the game.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes a photograph of the children's game.",
        "values": [
          0.0,
          0.0,
          -0.4,
          0.8,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is sorting through old family photographs at the dining table. Agent B is cooking a family recipe in the kitchen. Agent C, their teen child, sits with Agent A and takes interest in the photos. The home is filled with the aroma of food and the warmth of a relaxing evening.",
    "actions": [
      {
        "description": "Agent A explains the history behind a family photo.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help create a family album.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A turns on calming music.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A compliments Agent B and gives a hug.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.8,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent C about their day.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A secures the front door.",
        "values": [
          0.0,
          0.0,
          0.9,
          -0.1,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing a board game after dinner.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A maintains eye contact with Agent B while speaking.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent C in meal preparation.",
        "values": [
          0.0,
          0.0,
          0.4,
          0.6,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is seated in the cozy living room, ready to suggest a board game night to his family. With a warm glow from the fireplace lighting up the secure space filled with lovingly cared-for items, Agent A ensures a tranquil atmosphere for everyone.",
    "actions": [
      {
        "description": "Agent A plays a family favorite melody on the guitar, inviting everyone to sing along.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Before settling for the night, Agent A secures the front door.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.1,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A turns emergency kit preparation into a family activity.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A starts a family decluttering of the living room.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.4,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join the game evening with a jigsaw puzzle piece.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.3,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a warm beverage for the family, considering preferences.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent B in a quiet conversation on the couch.",
        "values": [
          0.0,
          0.0,
          -0.2,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests updating the family emergency plan with recent information.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.2,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares a funny story to bring laughter to the family.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "safety",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a family dinner, with fruit simmering on the stove and Agent C drawing at the kitchen table. Agent B joins them after reading, and they all share a soft laugh in the coziness of the home.",
    "actions": [
      {
        "description": "Agent A turns down the heat on the stove to prevent food from burning.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a group hug with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help set the table.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A listens attentively as Agent B shares an idea from the book.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing a family board game after dinner.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A brings out photo albums to reminisce about family events.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A leads a moment of expressing gratitude with the family.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A directs Agent C to a cooler activity than helping near the stove.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.2,
          0.0
        ]
      }
    ]
  }
]