[
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A arrives home to find a well-prepared dinner setting by Agent B and Agent C, with attention to inclusion and a cordial atmosphere.",
    "actions": [
      {
        "description": "Agent A assists with the table setup, folding napkins.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A dialogs about Agent C’s experiences throughout the day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A voices appreciation for the dinner arrangements.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a post-dinner board game for family time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A ensures dietary preferences are considered for everyone at dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A proposes that dinner responsibilities be rotated weekly.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A shares personal day-to-day occurrences with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A encourages each person to share their day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A cautiously engages Agent C in the ongoing conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is sitting at a kitchen table engaged in a puzzle with his cousin Agent B. The family's warmth is evident in the home, along with the smell of dinner cooking by Agent C, the parent.",
    "actions": [
      {
        "description": "Agent A finds a challenging puzzle piece and offers it to Agent B to place, acknowledging Agent B's skill.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A compliments Agent C on the dinner's aroma, showing anticipation for the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A offers to do the dishes, allowing Agent C to take a break after cooking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A suggests playing music that everyone enjoys for a better atmosphere while working on the puzzle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares an old photo album with Agent B, reminiscing and laughing together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          -0.1
        ]
      },
      {
        "description": "Agent A helps Agent B with a part of the puzzle that they're struggling with, without taking over.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A shares a personal school achievement, inviting celebratory interactions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.3,
          -0.2
        ]
      },
      {
        "description": "After the puzzle completion, Agent A encourages a group photo to commemorate the accomplishment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "A family gathers in the kitchen to partake in their weekly cooking session. Agent A is preparing the ingredients, Agent B is selecting a recipe, Agent C is studying but shows interest in the activity, and Agent D is excitedly sharing their artwork. The scenario is ripe for communal engagement and showcases a harmonious family environment.",
    "actions": [
      {
        "description": "Agent A decides to give Agent D a special task in the cooking process to acknowledge their enthusiasm.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A offers Agent C creative input on the dish, integrating a chemistry concept they've been studying.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.9,
          0.4
        ]
      },
      {
        "description": "When there's only enough of a favored ingredient for one person, Agent A suggests drawing lots to decide who gets it.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A compliments Agent B's recipe choice, highlighting the effort put into finding it.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.3
        ]
      },
      {
        "description": "Upon noticing Agent C's distraction from their studies, Agent A gently encourages a study break to join the cooking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          -0.1
        ]
      },
      {
        "description": "Agent A organizes a family vote on what dessert they should make, ensuring everyone gets a say.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          1.0
        ]
      },
      {
        "description": "Agent A takes photographs with everyone during the cooking session, to add to the family album.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A ensures that everyone has a turn to perform their preferred role in the cooking process.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.8
        ]
      },
      {
        "description": "If an accidental spill occurs, Agent A quickly cleans it without blame and lightens the mood with humor.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.3,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B are siblings sitting in their cozy living room on a lazy Saturday afternoon. Agent C, their cousin, is lounging on a bean bag with a book. A jigsaw puzzle lies on the coffee table, and the room is filled with the soft glow of sunlight and a slight breeze. The atmosphere is comfortable yet idle, hinting at a shared activity that could unify the group.",
    "actions": [
      {
        "description": "Agent A suggests starting the jigsaw puzzle together to have a fun group activity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A asks Agent B and Agent C for their opinion on which section of the puzzle to start with, promoting a group decision.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A offers to put on some light music to create a pleasant atmosphere while working on the puzzle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.5
        ]
      },
      {
        "description": "Agent A ensures Agent C feels included by asking for book recommendations.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.6
        ]
      },
      {
        "description": "When Agent B struggles, Agent A gently assists, maintaining a collaborative spirit.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.8
        ]
      },
      {
        "description": "If a puzzle piece is missing, Agent A encourages appreciation of their work together.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.4,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A plans a small celebration after puzzle completion with a favorite snack.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A praises Agent C's effort on the puzzle and suggests choosing the next activity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A offers to frame the completed puzzle, for collective accomplishment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, the family's parent, has organized a picnic in the backyard. Every family member is getting ready, as Agent B sets up music and Agent C prepares games.",
    "actions": [
      {
        "description": "Agent A asks each family member to choose their preferred snack for the picnic.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A suggests that family members take turns picking games to play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A lets Agent B lead the first board game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A teaches a new card trick to both Agent B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A places the photo album on the table to reminisce.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A sets up a craft area for family creativity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A brings out a variety of cushions for seating.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a group hug.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          1.0,
          0.2
        ]
      },
      {
        "description": "Agent A suggests taking a family photo.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a home environment, Agent A serves as a mediator in a meeting involving Agent B and Agent C to discuss a communal art project, balancing the flow of conversation and ensuring a collaborative atmosphere.",
    "actions": [
      {
        "description": "Agent A suggests starting the meeting by allowing everyone to present their ideas and visions for the art project before any discussion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A compliments Agent B on a specific photo in their portfolio, highlighting its alignment with the project's theme.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A mediates when the discussion becomes heated, reminding everyone of the common goal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A offers to take notes and compile everyone's ideas into a cohesive plan, ensuring all voices are heard.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a break when tension rises, to refresh and prevent any rash decisions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A recognizes Agent B's hesitation to speak and invites them to share their ideas next.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A ensures that all decisions made are agreed upon unanimously.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A takes the lead in dividing tasks, making sure everyone is comfortable and excited about their part.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A tactfully steers conversations if they begin to veer off topic or become nonconstructive.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.2,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "A celebratory family dinner is underway at Agent A's home to mark the end of their semester, with family members actively preparing the setting. Agent A, feeling the warmth of the family gathering, contemplates a way to commemorate the moment.",
    "actions": [
      {
        "description": "Agent A sets the camera on a timer for a group picture to capture the moment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A proposes a toast to commemorate the semester's end and recognize each family member's efforts.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A takes over the dishwashing to give Agent B a break after the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A offers to share their dessert with Agent C, who has finished theirs and still seems to want more.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a board game after dinner, choosing one that all family members enjoy and can participate in equally.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A suggests a small donation to a charity in the family's name instead of more overt celebrations, promoting community contribution.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A decides to create a family memory book, asking everyone to write down their thoughts about the dinner and the closing semester.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A makes sure to evenly distribute the leftovers from dinner, ensuring everyone has their favorite dish to enjoy the next day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.1,
          0.8
        ]
      },
      {
        "description": "Agent A stays up late discussing future plans and dreams, listening attentively to Agent B and Agent C's aspirations.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          1.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In the comfort of their shared living space, Agent A is sketching, Agent B is baking cookies, and Agent C is assembling a puzzle. They are enjoying each other's company, interacting lightly, and sharing their individual activities.",
    "actions": [
      {
        "description": "Agent A shares her sketchbook with Agent B and Agent C for viewing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A praises Agent B’s cookies and recommends a rotating baking schedule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A challenges Agent C to a timed puzzle competition.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.6,
          -0.2
        ]
      },
      {
        "description": "Agent A offers to tidy the kitchen afterwards to allow Agent B to relax.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          1.0
        ]
      },
      {
        "description": "Agent A selects a board game for everyone to play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a collaborative group project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A gets a blanket for Agent C when noticing they are cold.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A proposes establishing a weekly puzzle evening.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A provides additional drawing materials for the others.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In the family living room, Agent A is considering college choices, Agent B is discussing a sports tournament, and Agent C reads a novel. There's a strategy whiteboard, homemade cookies, and an atmosphere of familial collaboration.",
    "actions": [
      {
        "description": "Agent A offers their room to Agent C for the summer for improved privacy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A documents Agent B's training sessions for improvement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A bakes extra cookies for both the bake sale and the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a family game night for better bonding.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          1.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes movie marathon turns for everyone's enjoyment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A gives constructive feedback on Agent B's game strategies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A organizes a family outing to celebrate Agent B’s sports efforts.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A aids Agent C in novel analysis with different perspectives.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.7,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is organizing a small family dinner at home to celebrate Agent B's academic achievement. The table is carefully set with consideration for dietary preferences and personal touches to the environment. Agent A selects background music based on Agent B's preference and warmly welcomes Aunt C, ensuring her gift is accommodated.",
    "actions": [
      {
        "description": "Agent A listens attentively to family conversations, engaging with a smile.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A makes sure Agent B is the center of attention at the celebration.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          -0.2
        ]
      },
      {
        "description": "Agent A offers assistance to Agent D to serve his meal with care.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A invites Aunt C to share her travel experiences openly.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A gently mediates the conversation between family members to keep it light.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A takes care of spills or messes without any inconvenience.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          -0.1,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a vote on selecting a family game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A includes everyone in group photos .",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A ensures everyone gets an equal share of dessert.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.1,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A greets the family after work, assists Agent B in cooking, listens to Agent C talk about their day, praises Agent D's drawing, and suggests a family game night.",
    "actions": [
      {
        "description": "Agent A helps serve equal portions of dinner to everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A attentively listens to Agent C and shows understanding for their school experiences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a collaborative board game for family night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A celebrates Agent D's creativity by displaying the artwork.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A resolves conflict during the game by mediating.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.6,
          1.0
        ]
      },
      {
        "description": "Agent A reads a bedtime story to Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A has an end-of-day conversation with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A tutors Agent C in math homework.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "On a relaxed Sunday afternoon, Agent A plays guitar in the living room. Agent B is reading on the sofa, sharing smiles with A. Agent C is sketching, listening to music. Agent D, the neighbor, arrives with a homemade pie.",
    "actions": [
      {
        "description": "Agent A warmly welcomes Agent D and invites them in.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A asks about the pie recipe, engaging Agent D in conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A encourages Agent C to join the conversation and take off their earphones.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a family board game including Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A offers their pie slice to Agent B after noticing theirs is gone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A praises Agent C's artwork and suggests sharing it with Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A leads by example in clearing the table while keeping the mood light.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A rearranges seating for everyone's comfort and inclusion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A entertains the room with a funny story from work.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.5,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is in the kitchen preparing a family dinner, Agent B is reading in the living room, Agent C is setting the table, and Agent D is folding napkins into creative shapes.",
    "actions": [
      {
        "description": "Agent A asks Agent B to taste the dish they are making for feedback.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A encourages Agent C to choose dinner music.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A compliments Agent D on napkin folding creativity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A decides to divide the cooking tasks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.5,
          1.0
        ]
      },
      {
        "description": "Agent A initiates a game for sharing positive daily moments.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A places a handwritten note of appreciation under plates.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          1.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a weekly schedule for meal choices.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A suggests creating a family collage during dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A volunteers to assist Agent C with schoolwork.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          1.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and his housemates, Agent B and Agent C, are gathered in their apartment’s cozy living room one evening. Agent A has just prepared cookies, with Agent B on the couch reading and occasionally engaging in conversation, and Agent C selecting music to set the ambiance. The setting is tranquil and comfortable.",
    "actions": [
      {
        "description": "Agent A offers the first cookie to \"Agent C\" since they chose the music for the evening.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A invites \"Agent B\" and \"Agent C\" to join in the kitchen for a cookie decoration contest.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a game of sharing childhood memories.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          1.0,
          0.5
        ]
      },
      {
        "description": "Agent A volunteers to clean up the dishes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A suggests a rotation system for choosing activities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          1.0
        ]
      },
      {
        "description": "Agent A encourages \"Agent B\" to display family photos.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A checks in with \"Agent C\" to offer a chance to talk.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A sets up a video call with a mutual friend.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A puts together a care package for their neighbor.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B are housemates relaxing at home, engaging in their individual activities while Agent C, an old friend, is visiting. The living room is tranquil, with a nearly completed puzzle on the coffee table, and a shared feeling of contentment permeates the space.",
    "actions": [
      {
        "description": "Agent A sets down the book and suggests that they finish the puzzle together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A gets up to make a round of tea for everyone, catering to individual preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A invites Agent C to participate in the puzzle once settled with their drinks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A carefully distributes the mugs of tea.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A compliments Agent B's knitting project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A asks for everyone's music preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.5
        ]
      },
      {
        "description": "Agent A proposes playing a board game everyone enjoys.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A offers the most comfortable seating to B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A adjusts lighting for activities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.4,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "A young parent decides to have a spontaneous board game night with their family to appreciate each other's company. Each member had different plans, but the environment adapts to the shared activity.",
    "actions": [
      {
        "description": "Agent A asks what game they'd enjoy to include everyone's preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A suggests a game accommodating Agent D's video call.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A invites Agent C to choose snacks for the game together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A waits till Agent B is ready to talk about the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A helps to tidy up the room for a comfortable game space.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.5
        ]
      },
      {
        "description": "Each family member adds a personal rule to the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A suggests the board game as a creative break for Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A explains the game rules for everyone's understanding.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A leads a conversation about everyone's week.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy suburban home, Agent A sits at the dining table surrounded by family. Agent B is wrapping up dinner preparations, Agent C is completing homework, and Agent D is setting the table. The atmosphere is warm with the aroma of dinner inviting a sense of togetherness.",
    "actions": [
      {
        "description": "Agent A offers to help with the last touches of the meal prep.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent C to assist with homework difficulties.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A suggests family take turns sharing highlights of their day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A compliments Agent D on setting the table properly.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A invites everyone to choose a movie to watch together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A proposes everyone picks a dish for next week’s meal plan.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A allows Agent D to choose the evening's music playlist.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A ensures leftovers are evenly distributed for everyone’s lunch.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A mediates a disagreement over dessert choices.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.5,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a surprise dinner for his parents' wedding anniversary, Agent B seeks to use the kitchen simultaneously, and Agent C observes, looking for ways to be involved.",
    "actions": [
      {
        "description": "Agent A suggests a schedule...",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A offers some of his cooking...",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.5
        ]
      },
      {
        "description": "Agent A sets up a workspace...",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A asks Agents B and C...",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A decides to use less expensive...",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A cleans up his cooking...",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A intentionally makes a larger quantity...",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A compliments Agent B...",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A and Agent B negotiate the sharing...",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B invite their elderly neighbor, Agent C, for a shared weekend dinner at their home. They plan the evening with attention to C's preferences, including a dish she enjoys, and create a warm atmosphere to make her feel included and valued.",
    "actions": [
      {
        "description": "Agent A brings out a photo album after dinner to share memories with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A gets a blanket for Agent C when they notice she is shivering slightly.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A ensures that Agent C gets an equal chance to serve herself from the dishes before they do.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A actively listens and asks follow-up questions when Agent C shares stories, showing genuine interest.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agent C to assist in choosing the dessert, providing her the opportunity to make a decision.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A carefully avoids sensitive topics that might upset Agent C during their conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A complements Agent C on her advice and wisdom, showing appreciation for her insights.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A packs some leftover food for Agent C to take home, so she can enjoy it later.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A offers to help Agent C with any chores or tasks she might have difficulty managing by herself.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In the Williams household, the eldest teenager, Agent A, sets the dinner table while her father, Agent B, prepares dinner and her younger brother, Agent C, arranges his school drawings in the living room. The evening is peaceful, and the aroma of dinner creates a warm ambiance.",
    "actions": [
      {
        "description": "Agent A proposes a new family tradition where each member shares their high point of the day during dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A assists Agent C by giving feedback on his artwork, helping him choose the best drawing to show.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A praises Agent B for the enticing smell of his cooking, anticipating the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a family debate on a mutually engaging topic.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A offers to clean up after dinner, acknowledging Agent B's effort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A suggests rotating evening chore responsibilities among family members.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A creates a gallery space for family members to display personal interests, including Agent C's drawings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.8
        ]
      },
      {
        "description": "Agent A ensures Agent C is included in the conversation by asking for his views.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A encourages the family to collectively participate in a local volunteer event.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A tidies up a shelf of games in a sunlit living room, as Agent B scrolls on a tablet and Agent C prepares snacks in the kitchen. A half-completed puzzle awaits interaction on a nearby table, and the setting is ripe for family bonding and shared enjoyment.",
    "actions": [
      {
        "description": "Agent A suggests to Agent B to put the tablet away and join in finishing the jigsaw puzzle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A asks Agent C if they want to bake cookies together for everyone to enjoy later.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A invites both Agent B and Agent C to play a new board game they haven't tried yet.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A leaves the last few pieces of the jigsaw puzzle for Agent B, knowing it's a part they enjoy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.8
        ]
      },
      {
        "description": "Agent A, noticing Agent B's idle mood, offers to play a game they particularly like to cheer them up.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A decides to help Agent C in the kitchen, making the task faster and more enjoyable.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A proposes that they rotate in choosing the next game to play to make sure everyone's choices are respected.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A praises Agent C on their snack-making skills, showing appreciation for their efforts.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A pulls out a photo album and invites B and C to join in reminiscing over past family gatherings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college student in her twenties, is at home with her roommate Agent B and Agent C, her younger cousin. They're in their living room after dining together. Agent A is considering a board game night, Agent B is tidying up, and Agent C is enjoying an old photo album.",
    "actions": [
      {
        "description": "Agent A suggests they play a board game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A shares stories about photos with Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          1.0,
          0.3
        ]
      },
      {
        "description": "Agent A evenly divides the dessert.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          1.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B with the dishes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A ensures everyone's game preferences are considered.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.8
        ]
      },
      {
        "description": "Agent A agrees to let Agent C keep the photo album.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A explains the board game rules to Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A suggests rotating game choices on future nights.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A checks if tired Agent B wants to play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy kitchen, Agent A is decorating cupcakes with Agent B, a young relative, and Agent C, a neighbor, for a local bake sale. They share laughs and encourage each other’s creativity, ensuring equal access to decorations.",
    "actions": [
      {
        "description": "Agent A gives Agent B and Agent C the first choice of cupcakes to decorate.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A ensures everyone has equal access to various decoration tools and toppings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          1.0
        ]
      },
      {
        "description": "Agent A listens with a bright smile as Agent B describes her idea for a new cupcake design.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A offers to clean up the spilled decorations.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.5
        ]
      },
      {
        "description": "Agent A captures a photo of everyone with their decorated cupcakes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A suggests that Agent C's experience with past bake sales could help price the cupcakes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a friendly competition while ensuring that the end decision is reached democratically.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A applauds both Agent B and Agent C for their efforts regardless of the competition outcome.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A organizes a game night at home with friends, Agent B and new neighbor Agent C, focusing on enjoying the time together and fostering a welcoming and inclusive atmosphere.",
    "actions": [
      {
        "description": "Agent A serves homemade snacks to Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A pours drinks for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A explains a complex strategy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A shares memories from a photo album.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A rearranges seating for better group integration.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A proposes switching games for balance.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A compliments Agent B’s learning curve.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A offers a blanket to Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy, sunlit kitchen, Agent A prepares dinner, while Agent B works on a puzzle and Agent C reads a book. A sense of togetherness permeates as they enjoy their individual activities, yet remain connected through small interactions.",
    "actions": [
      {
        "description": "Agent A offers to serve Agent C's portion of dinner on a tray.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.3,
          -0.2
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to join in cooking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A suggests a board game post-dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A prepares an extra place setting at the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A helps Agent B organize puzzle pieces.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A engages Agent C in a discussion about her book.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          -0.1
        ]
      },
      {
        "description": "Agent A arranges seating for easy conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A equally allocates chores for cleanup.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          -0.2,
          0.8
        ]
      },
      {
        "description": "Agent A plays soft music during dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is setting up a surprise celebration for Agent B to appreciate Agent B’s professional achievement. With the help of Agents C and D, the family prepares the household festively. Agent C selects music, while Agent D decorates a cake, and Agent A places a meaningful gift in the living room.",
    "actions": [
      {
        "description": "Agent A crafts a speech to appreciate Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A assists Agent D in decorating the cake.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A gives feedback on Agent C's music choice for the playlist.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A coordinates a surprise rehearsal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A organizes a video call with relatives.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A evenly assigns the preparatory tasks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A includes a game for all to play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A ensures recognition for everyone's efforts.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A shares cleaning responsibilities post-celebration.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.3,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "A casual board game night at home among friends. Agent A hosts as they engage in a strategic and equitable game, with attention to everyone's comfort and participation.",
    "actions": [
      {
        "description": "Agent A offers to let Agent B go first in the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A pulls out an extra chair for Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A ensures everyone understands the rules before starting the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A compliments Agent C on a clever move.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A evenly divides the snacks amongst all players.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A decides to implement a new house rule agreed upon by all players.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A stops the game momentarily to console Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A suggests they rotate positions around the table after each game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a break in the middle of the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A lounges in the living room with Agent B and Agent C. Agent A considers initiating an activity, keeping in mind everyone's preferences and the desire to make the day enjoyable for all.",
    "actions": [
      {
        "description": "Agent A suggests picking a movie that everyone's been wanting to watch, and they vote to choose one.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          1.0
        ]
      },
      {
        "description": "Agent A begins a conversation about everyone's favorite moment from the previous evening.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A sets up a collaborative art project with sketchbooks and art supplies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          1.0,
          0.4
        ]
      },
      {
        "description": "Agent A plays a tune on the guitar and invites others to join with instruments.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a walk in the garden.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A suggests writing a short story or poem to share for fun.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A organizes a group photo session with creative poses.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A suggests working on a puzzle together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A offers a box of homemade cookies to share.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.5,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and his two roommates, Agent B and Agent C, are cozily gathered on a chilly Sunday afternoon to play a board game in their shared living room.",
    "actions": [
      {
        "description": "Agent A suggests a break from the game to prepare a meal together, making sure everyone's dietary preferences are considered.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A listens attentively to Agent C, who is sharing a personal story, and offers words of comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A compliments Agent B on her strategy, recognizing her skills and supportive environment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agent C to take the lead on the next round to ensure he feels included.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A offers to switch seats with Agent B for comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A initiates a group discussion to reflect on the game's fun moments.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A puts the game away and expresses gratitude to Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A offers to take on clean-up duties to alleviate Agent B’s stress.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy living room, Agent A and their family, Agent B, and Agents C and D, are preparing for a game night, surrounded by board games and cookies, deciding on what to play.",
    "actions": [
      {
        "description": "Agent A decides to let Agent D choose the first game to play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A offers to be the dealer in the card game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A evenly distributes bonus points they received to others.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A balances the teams in a game by pairing differently experienced players.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A takes a group selfie to capture the moment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A suggests a brief intermission for rest and talk.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A initiates a new tradition of 'Game Night Awards'.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A encourages Agent C to share their new idea for a game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A asks open-ended questions about each family member's day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.8,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is organizing a family gathering to celebrate Agent B's graduation with cheerful decorations and a festive mood. Agent C is also present, and Agent D is setting up interactive entertainment for post-dinner activities. Agent A ensures everyone's participation and enjoyment, creating an inclusive and warm atmosphere.",
    "actions": [
      {
        "description": "Agent A invites each person to share a fond memory.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A offers to divide the gifts and greeting cards.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A suggests that Agent B choose their portions first.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A encourages Agent D to partner with Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A mediates a game dispute.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A addresses special dietary needs.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          1.0
        ]
      },
      {
        "description": "Agent A thanks each guest personally.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A joins Agent C in looking at photo albums.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          1.0,
          0.4
        ]
      },
      {
        "description": "Agent A changes the music playlist.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A arrives home to find the family in various activities. Agent B and Agent C are playing a board game, and Agent D is baking cookies. The cozy household is nurturing and equitable participation is visible.",
    "actions": [
      {
        "description": "Agent A compliments Agent D and suggests sharing cookies equally.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a family walk for more time together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A encourages sharing experiences of the day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A ensures both children receive equal time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A appreciates Agent B’s effort for game night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A brings out a photo album to share memories.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A suggests Agent D to decide next game night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a university student, is at their family home during the semester break. They're spending the weekend with Agent B, their sibling, and Agent C, their parent. The morning atmosphere is filled with the aroma of pancakes, and Agent A takes it upon themselves to set the table and distribute food equally, despite Agent B's preoccupation with a work call. Later, the agent suggests a card game for everyone in the cozy and warm living room.",
    "actions": [
      {
        "description": "Agent A helps Agent B catch up on the dining conversation after finishing the work call.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A brings a blanket for Agent C who feels a bit cold in the living room.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A ensures to rotate the role of card game dealer.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A proposes that the game's loser does the dishes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A spends extra time listening to Agent C's stories about their times at university.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A offers Agent B some tips for balancing work and life.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A suggests switching to a game that everyone knows equally well.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A clears the table after breakfast.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A checks with everyone before changing the music volume.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A organizes a family game night at home, inviting Agent B, and children Agent C and Agent D. The evening includes playing board games with rules explained clearly, and breaks with snacks, ensuring a supportive and inclusive atmosphere.",
    "actions": [
      {
        "description": "Agent A suggests sharing personal stories during snack time to bond.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A offers to change team pairings in a cooperative game for variety.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A checks for any dietary restrictions or preferences before serving snacks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A mediates a group discussion to resolve a game rule conflict.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a new rule for inclusivity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          -0.4,
          0.7
        ]
      },
      {
        "description": "Agent A suggests taking a group photo at the end of the night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A encourages shy Agent D to pick the next game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A adjusts game dynamics to level the playing field.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A shows gratitude for everyone's involvement and plans the next gathering.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is organizing a small indoor celebration for their parent's anniversary, involving Agents B, C, and D in preparations and activities, ensuring a comfortable and inclusive atmosphere for everyone.",
    "actions": [
      {
        "description": "Agent A gives a heartfelt toast celebrating their parents' relationship.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A offers to wash the dishes after the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent C to share their achievements.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a game that includes everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.9
        ]
      },
      {
        "description": "Agent A selects and shares the story behind a personal gift.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          1.0,
          0.2
        ]
      },
      {
        "description": "Agent A takes a group family photo including Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A suggests moving to a more comfortable room.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A discretely asks Agent D if they need support.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A ends the celebration at a reasonable hour.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.2,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a celebratory dinner at home for Agent B's work promotion, with Agent C contributing to the setting. They coordinate to ensure the evening is delightful, accommodating each other's tastes and preferences, indicative of their close relationship and mutual respect.",
    "actions": [
      {
        "description": "Agent A offers Agent B the choice of the first serving as a gesture for the evening's celebration.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A initiates a toast to celebrate Agent B’s achievements.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A ensures Agent C’s dietary needs are taken into account during the meal preparation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A encourages everyone to share a cherished memory from the recent past.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A seeks everyone's input to decide on a movie to watch.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A plans to share the meal's leftovers with a neighbor.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A discretely takes care of a minor accident to keep the mood light.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.2,
          0.3
        ]
      },
      {
        "description": "Agent A steps back to allow Agent C to select the evening’s background music.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.6,
          0.6
        ]
      },
      {
        "description": "Agent A initiates a collective embrace with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          1.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is cooking in the kitchen, with the inviting aroma of soup spreading through the home. Agent B is reading in the living room, and Agent C is at the dining table, offering freshly baked bread for the meal.",
    "actions": [
      {
        "description": "Agent A thanks Agent C for the bread and acknowledges the effort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A invites Agents B and C to help with the soup's seasonings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A cleans up the kitchen to maintain a tidy shared space.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A gives the larger portion of soup to Agent B who had a long travel day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A asks Agent C to pick a board game to play post-dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A offers movie selection to Agent B for the night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A evenly divides the leftover soup for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A promotes engaging conversation at dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A organizes kitchen tools and ingredients after cooking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A arranged a weekend dinner at home with Agent B, their partner, and Agents C and D, their children. Each family member contributed to the dinner, and a surprise announcement was planned for dessert time to strengthen the family bond.",
    "actions": [
      {
        "description": "Agent A proposes a toast, acknowledging each family member's contributions to the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.2
        ]
      },
      {
        "description": "During the meal, Agent A makes sure to engage both Agent C and Agent D in conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          -0.1
        ]
      },
      {
        "description": "Agent A, noticing Agent D has less food on their plate, offers some of theirs.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A invites the whole family to play a board game they all enjoy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A compliments Agent B on the meal and suggests alternating cooking responsibilities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A takes the smaller piece of dessert, ensuring others have more.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A shares a personal success story, encouraging others to share theirs.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          -0.2
        ]
      },
      {
        "description": "Agent A steps back to let Agent C make an important game decision.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.6
        ]
      },
      {
        "description": "As the night ends, Agent A expresses gratitude for the evening.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is choosing a board game for family game night, considering all family members' preferences and fostering an inclusive environment.",
    "actions": [
      {
        "description": "Agent A decides to let Agents C and D propose two games each.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A volunteers to put away the board games after playing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent B to share their thoughts on which game would be a relaxing break from work.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a new game that nobody has played before.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A offers to teach the family a classic game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A encourages Agents C and D to teach the rest of the family a game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A carefully notes the night's scores in the notebook.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A reminisces about funny moments from past game nights.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A ensures that the game rules are clear and understood by all.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In the household's living room, after a family meal, Agent A, along with Agent B, and their children Agents C and D, engage in a board game accompanied by a harmonious discussion about taking turns and sharing appreciations.",
    "actions": [
      {
        "description": "Agent A reinforces Agent C for their kind actions with affirmation and physical gesture.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A supports Agent D's involvement by offering a safe space to express themselves.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A promotes collaborative effort by initiating a family clean-up after the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A contributes to Agent B's engagement in the game with supportive strategizing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A enables Agent D's autonomy by allowing them to choose an activity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A searches for a musical choice that suits everyone's taste.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A engages the family in planning a joint outing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is spending a day at home with their partner Agent B, who is cooking, and their two children, Agent C who is working on a project and Agent D who is playing a board game.",
    "actions": [
      {
        "description": "Agent A organizes a family board game tournament with individual game choices.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A engages Agent C in cooking with guidance from Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A involves the family in preparing dinner together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A creates a family storytelling session.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A plans a family mural painting activity for after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A offers support to Agent C on their school project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          1.0,
          0.6
        ]
      },
      {
        "description": "Agent A learns the board game from Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A validates Agent C's project efforts with positive reinforcement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A prepares a family movie night at home, creating a comfortable environment and taking into account everyone's preferences for snacks and movie selection.",
    "actions": [
      {
        "description": "Agent A finalizes the arrangement of the living room to be cozy and inviting.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A considers B's and C's preferences in making hot chocolate for the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A includes B and C in the decision for snack options through a voting process.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.6,
          1.0
        ]
      },
      {
        "description": "Agent A makes cleaning up fun with a quick tidy-up game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A ensures the room is set to everyone's comfort for the movie night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A lets B choose where to sit as a gesture of care.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          -0.2
        ]
      },
      {
        "description": "Agent A makes sure popcorn is equally accessible to everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A gives C the role of managing the movie controls.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is home for the weekend and decides to organize a family board game night. The living room is cozy, and both Agent B, their younger sibling, and Agent C, a visiting cousin, are present and preparing for the evening.",
    "actions": [
      {
        "description": "Agent A suggests voting on which board game to play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          1.0
        ]
      },
      {
        "description": "Agent A proposes setting up a rotating system.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A offers to teach the rules.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A chooses to play a game that is their least favorite.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A invites collaboration on making a custom rule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A encourages Agent B to share their latest life update.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          1.0,
          0.2
        ]
      },
      {
        "description": "Agent A decides to start the game night with icebreaker activities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A ensures that snacks are easily accessible.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A attentively listens to Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          1.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a sunlit suburban kitchen, Agent A is baking cookies with their children, Agent B and C. The environment is supportive and inclusive, with attention to equitable participation.",
    "actions": [
      {
        "description": "Agent A allows Agent B to crack the eggs, taking turns with Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A sets up a decorating station with various toppings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A organizes a taste test, giving each child feedback.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agent B and C to clean up together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A proposes taking pictures of the cookie masterpieces.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A decides to save some cookies for their neighbor.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A carefully mediates a minor disagreement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A notices Agent C struggling and helps them.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A and the children enjoy the cookies together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.9,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, enjoys a Saturday at home with roommates, Agent B and Agent C. The living room is cozy with a coffee table set for games night. Agent A works on a group presentation, Agent B, and Agent C prepare breakfast, and the aroma of pancakes and coffee fills the air.",
    "actions": [
      {
        "description": "Agent A offers to set the table for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A decides to divide upcoming presentation tasks equally.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A proposes a 'breakfast feedback' session for culinary improvement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A volunteers to document the breakfast recipes and moments.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A insists on rotating game master role during games night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A initiates a planning session for afternoon activities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.6
        ]
      },
      {
        "description": "Agent A supports Agent B sharing a newly learned game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A offers her chair to Agent C for equal comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A creates a playful reward system for game winners.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "A father, Agent A, preps a surprise dinner for Agent B, his wife, to celebrate her promotion. The house is cozy, and he has made inclusive choices for the meal. Agent C, their daughter, is aiding him, while Agent D, their son, is due to join after homework.",
    "actions": [
      {
        "description": "Agent A reveals the surprise dinner to Agent B, expressing his appreciation for her hard work.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agent D to join the dinner and share in the celebration, completing the family circle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A encourages open conversation during dinner, allowing each family member, including Agent C, to share about their day and thoughts.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A offers to clear the table, showing consideration for Agent B's need for rest after her day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A suggests playing Agent B's favorite board game after dinner to prolong family time together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A helps Agent D with a difficult problem in his homework, fostering a supportive family environment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A initiates a discussion on how the family could spend their next vacation together, incorporating everyone's interests.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A acknowledges Agent C's contributions to the surprise dinner and thanks her, promoting a sense of appreciation in the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A mediates a minor disagreement between Agent C and Agent D with patience and understanding, aiming to maintain harmony.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is planning a dinner party at her home with Agents B, C, and neighbor D. They collaborate on the menu, balance preferences, and prepare for the evening with a lively and cooperative spirit.",
    "actions": [
      {
        "description": "Agent A suggests they vote on the final menu to ensure everyone has a say.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A decides to prepare one signature dish that each person is particularly fond of.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A creates a grocery list, ensuring to include alternatives for guests with dietary restrictions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A assigns cooking tasks to B and C, considering each individual’s cooking skills and interest level.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agent D to stay and help with the preparations as a way to involve her in the dinner party process.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A takes into consideration Agent B's dislike for spicy food when finalizing the dishes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A establishes a clear plan for setting up the table, giving everyone including Agent C an equal role.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          1.0
        ]
      },
      {
        "description": "Agent A ensures that there is a variety of non-alcoholic beverages available for Agent C and any guests who may not drink alcohol.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          1.0
        ]
      },
      {
        "description": "Agent A reserves a special seat at the dinner table for Agent D, expressing gratitude for her assistance.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a high school senior, has organized a family dinner to celebrate receiving a scholarship to a prestigious university. Agent B, their mother, sets the table while Agent C, their younger brother, compiles a playlist of favorites. A family portrait on the wall symbolizes the family bond.",
    "actions": [
      {
        "description": "Agent A pours water into glasses for everyone, ensuring each glass is filled to the same level.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A offers the first piece of cake to Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A leads a toast to the family's collective effort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A engages in conversations with both Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A cleans up after dinner without being asked.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A suggests playing Agent C’s favorite board game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A helps Agent B with a project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A selects a movie after asking for everyone's opinion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A suggests a compromise to resolve a disagreement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In the kitchen, Agent A discusses with their partner how to make dinner time engaging for the entire family, while their children, Agent C and Agent D, are respectively working on homework and coloring at the dining table. Agent A smiles at the cozy ambiance and makes thoughtful propositions to include everyone in the evening's activities.",
    "actions": [
      {
        "description": "Agent A suggests finishing the board game together after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A decides to assist Agent C with their homework to lighten their load.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A proposes that Agent D pick the dinner music to involve them in the evening's activities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A helps set the table, ensuring that the distribution of chores is even among all family members.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A smiles and listens as Agent D talks about their school day during dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A brings out ingredients for dessert and invites the whole family to participate in baking cookies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A takes the time to teach Agent D a new skill, like measuring ingredients, to support their learning.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A opens a conversation about how each family member can contribute to the household in a way that reflects their abilities and interests.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A encourages a family discussion about how they all felt about the day, promoting a sharing environment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy living room, college student Agent A relaxes with a laptop, while their project partner, Agent B, is focused on research next to them. The scent of cookies fills the air as Agent C, their baking-savvy roommate, smiles from the kitchen. Agent D enters the room, eager for a playful distraction with a board game in tow.",
    "actions": [
      {
        "description": "Agent A suggests pausing their study session to play the board game with Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent B to join the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent C to take a break and play as well.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.4
        ]
      },
      {
        "description": "Agent A proposes a collective study session post-game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A ensures Agent D is comfortable with the game rules.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A shares cookies equally, acknowledging Agent C's effort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A crafts a study schedule respecting everyone's time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A actively listens to Agent B's project ideas.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A tidies up after the game, caring for the shared space.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.3,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B are enjoying a peaceful evening at home when Agent C arrives with a pie and Agent D notifies them of a leak from their apartment.",
    "actions": [
      {
        "description": "Agent A puts the novel aside to focus on and actively engage in the conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A suggests working on the puzzle together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A offers to clean up after enjoying the pie.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A offers to share some intriguing aspects of the novel.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A proposes to exchange favorite books with Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A inspects the kitchen sink for leaks.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.1,
          0.8
        ]
      },
      {
        "description": "Agent A invites Agent D to stay for pie.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A helps Agent D clean the water damage.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A decides to call a plumber to fix the leak.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.1,
          0.2,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a suburban home, Agent A bakes cookies, Agent B reads on the couch, Agent C works on homework, and Agent D plays board games. The smell of cookies fills the air, creating a congenial atmosphere.",
    "actions": [
      {
        "description": "Agent A makes cookies with each family member’s favorite toppings.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A includes Agent D in choosing music for dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A offers to help Agent C with their homework.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agent B to decorate cookies together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A leaves an encouraging note for Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A brings milk for Agent D to enjoy with a cookie.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A challenges Agent D with a tricky move in the board game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A cleans up after baking without making it known.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A organizes a family meeting for weekend plans.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A hosts a family game night with Agent B and Agent C. They play board games, engage in teamwork, and make collective decisions on game tactics.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to share in strategizing for the board game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          1.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to pick the next game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A offers a different seat to Agent B for a better view.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A distributes snacks among everyone equally.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          1.0
        ]
      },
      {
        "description": "Agent A proposes a prize for the team to keep things fun.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests a break for rest and conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A decides to capture the moment with a group photo.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A ensures the competitive spirit doesn't isolate anyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.5
        ]
      },
      {
        "description": "Agent A arranges seats for everyone's comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, and her roommates, Agent B and Agent C, organize a movie night at their rented apartment to unwind after a long week. Despite a previous disagreement, the mood is light, and there is a communal effort to enjoy the evening together.",
    "actions": [
      {
        "description": "Agent A starts the evening by asking Agent B and Agent C for their movie preferences to ensure a shared enjoyment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A makes popcorn, balancing out portion sizes so everyone gets an equal share.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A deliberately brings up a light-hearted memory they all share to create a jovial atmosphere.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A carefully chooses to sit in a spot on the floor to give Agent B and Agent C enough space on the couch.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.5,
          0.4
        ]
      },
      {
        "description": "During the movie, if a roommate gets up, Agent A pauses the movie to ensure they don't miss out.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A hands out cushions and blankets equally among all roommates for comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A makes a playful joke at their own expense to make her roommates smile.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.1
        ]
      },
      {
        "description": "If Agent C seems left out, Agent A engages her by asking about her week and listens attentively.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.9,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy suburban home, Agent A has gathered in the living room with Agents B and C for a family game night. The setting is prepped with board games and snacks, ready for an evening of engagement and shared experiences.",
    "actions": [
      {
        "description": "Agent A decides which board game to begin with, ensuring both children will enjoy it.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A allows Agent B and Agent C to take the lead in the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          -0.2
        ]
      },
      {
        "description": "Agent A gently suggests a better move to Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A shares an anecdote related to the game’s theme.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A brings up humorous memories from past game nights.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A engages Agent C by asking for their opinion on the next move.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A compliments the child about to win on their gameplay.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A pauses to ask if everyone is enjoying the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A emphasizes the enjoyment of playing over winning.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.7,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is in the family kitchen with Agent B and Agent C. Agent A prepares brunch with attention to each family member’s preferences and oversees a discussion between Agent B and Agent C, contributing to a supportive and inclusive atmosphere for a peaceful weekend morning.",
    "actions": [
      {
        "description": "Agent A places the favorite dish of Agent B in front of them with a caring gesture.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A asks Agent C to help serve the drinks, giving them a role in the brunch preparations.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a round-table discussion about how everyone would like to spend the day, ensuring everyone gets to input their ideas.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.9
        ]
      },
      {
        "description": "Agent A suggests a vote on the day's activities to democratically decide what the family will do.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.9
        ]
      },
      {
        "description": "During brunch, Agent A shares a personal story related to Agent B's school project, offering insights and bonding with the children.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A encourages Agent B and Agent C to clear the table together, fostering teamwork and a sense of responsibility.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.3,
          0.5
        ]
      },
      {
        "description": "After brunch, Agent A decides to clean up alone, giving Agent B and Agent C some time to play together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          -0.1,
          -0.2
        ]
      },
      {
        "description": "Agent A includes a surprise dessert that they baked, which is a special treat for the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A discreetly places a small gift next to Agent C's plate to celebrate a recent accomplishment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a comfortable living room as sunlight bathes the space, Agent A sets aside his book, observing his sister practicing guitar and his father taking a break from work. The tranquil scene is disrupted as Agent A decides to engage with his family, drawing them together with his next actions.",
    "actions": [
      {
        "description": "Agent A suggests that they start a family band to enjoy creating music together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a discussion on rotating household chores for equitable participation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A offers help to his father with work to ease his burden.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A invites family to a board game that would require collective problem-solving.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A provides constructive feedback to his sister on her guitar practice.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A plans a family movie night to ensure everyone enjoys and relaxes.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A helps his father find a missing document and advises on organization.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A sets up a shared online calendar to manage the family’s schedules.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A shares old family memories by bringing out photo albums.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          1.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy suburban home on a quiet Sunday afternoon, the living room is filled with the soft hum of music. A teenager named Agent A is deciding on a board game, Agent B is knitting, and Agent C is drawing.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to join in on a board game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A helps Agent B untangle yarns.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A compliments Agent C's artwork and seeks drawing tips.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a humorous addition to Agent C’s portrait.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A offers to make lemonade for the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a game selection schedule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A starts a chat about past weekends favored activities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A suggests adding personal items to the family portrait.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A organizes space for family movie night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.6,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a home environment, Agent A, sitting at a table filled with scrapbooking materials and family albums, is joined by Agent B reading on a bean bag and Agent C playing with a tablet on the couch. The warmth of the family room and the close proximity of the family members suggest a nurturing atmosphere for family interaction.",
    "actions": [
      {
        "description": "Agent A invites both B and C to partake in a scrapbook activity, selecting their most cherished memories.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A proposes a storytelling game to engage the family in a creative narrative.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A includes Agent C in arranging the scrapbook pictures to create a shared task.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A seeks Agent B's preferred method of contributing to the scrapbook.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A acknowledges Agent C's efforts equally to reinforce their sense of contribution.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.8
        ]
      },
      {
        "description": "Agent A introduces a family snack preparation as a cooperative break activity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A carefully addresses the inclusion of a potentially sensitive photo with B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A promotes equality by allocating individual pages to personalize in the scrapbook.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A models respectful interaction among the family during the scrapbook creation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A organizes a surprise birthday party for their friend Agent B, with the assistance of Agents C and D, at home. The living room is well-prepped with personal touches suited to B's tastes for a cherished celebration.",
    "actions": [
      {
        "description": "Agent A warmly welcomes Agent B and reveals the surprise.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A encourages everyone to share fond memories with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A lets each person have a chance to play board games.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A gives Agent B the first slice of cake.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.5
        ]
      },
      {
        "description": "Agent A mediates during a dispute in gameplay.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A adjusts the music volume for all guests' comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A shares party leftovers equally with the guests.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A takes a group photo of the occasion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A has organized a Sunday family game night and invites Agent B and Agent C to decide on a game. The family living room is a warm, inviting space with games, cookies, and music, setting the stage for a pleasant evening with involved and approachable characters.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to choose a game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A shows pride in Agent B’s school achievement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A teams up with Agent C in a game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A discreetly checks on Agent B’s well-being.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A offers alternative snacks to Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A ensures equal turns for everyone in the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A praises both Agents B and C during the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A corrects Agent B with gentleness.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a group photo to capture the night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A sets up a family game night in the cozy living room with board games and snacks, alongside Agent B, a knowledgeable teen, and Agent C, a younger child eager for family time.",
    "actions": [
      {
        "description": "Agent A starts the game night with an ice-breaking session to ensure everyone is comfortable.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A lets Agent C choose the first game to play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A hints at answers to Agent C during the trivia game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          -0.2
        ]
      },
      {
        "description": "Agent A equally divides the snacks for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A applauds both Agent B and C no matter who wins or loses.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A guides Agent B to the correct answer gently after a wrong attempt.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.5
        ]
      },
      {
        "description": "Agent A asks questions that Agent C can answer to keep them engaged.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          -0.1
        ]
      },
      {
        "description": "Agent A suggests a rotating quizmaster role.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A ensures everyone understands and follows the game rules.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.2,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is hosting a dinner party at their home for close friends where engagement and equal participation are noticed as necessary for a pleasant gathering.",
    "actions": [
      {
        "description": "Agent A initiates a game of trivia that includes topics of interest to all.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A serves dessert, ensuring equitable portion distribution.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.3,
          1.0
        ]
      },
      {
        "description": "Agent A engages Agent D by asking about their recent activities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A introduces a collective memory-sharing activity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A involves Agent D with nostalgic photos.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A volunteers for clean-up duties.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A presents personalized gifts to guests.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A makes a toast to honor each friend's uniqueness.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A coordinates a safe return home for Agent D.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.4,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a university student, is organizing books on a shared bookshelf while Agent B, a high school student, reads a graphic novel on the sofa. They coexist amicably in their shared living space, which includes the last of the cupcakes they made together.",
    "actions": [
      {
        "description": "Agent A offers the last cupcake to Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A suggests picking a movie they both enjoy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A asks Agent B about the bookshelf organization.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A decides to make a snack for both.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a conversation about the novel.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A tidies up the living room.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A uses headphones for the lecture.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.5,
          0.5
        ]
      },
      {
        "description": "Agent A shares a funny story from university.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent B to collaborate on schoolwork.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is a young parent who is celebrating the end of the school year with their two children, Agent B and Agent C. They're having a picnic in the backyard to acknowledge the children's accomplishments, with a table full of treats and lemonade.",
    "actions": [
      {
        "description": "Agent A offers to let Agent B choose the first treat from the table as a recognition of their hard work in school.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.5
        ]
      },
      {
        "description": "Agent A asks Agent C to recount their favorite moment from their recital, showing genuine interest and pride.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a toast with lemonade, honoring each child's accomplishments and expressing confidence in their future endeavors.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A invites both children to help prepare a special dish they all love, fostering a collaborative spirit.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a family board game where they can all participate and enjoy each other's company.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A decides to display the children's certificates and trophies in the living room where everyone can appreciate them.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A plans a fun outing as a surprise, taking into account both children's interests and preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A listens attentively as each child shares their dreams for the next school year, offering support and encouragement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          1.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is sitting in the dining room with his family, including Agent B and Agent C, around a table for a family game night.",
    "actions": [
      {
        "description": "Agent A suggests a new rule allowing each player to ask for help once during the game to foster collaboration.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A evenly distributes the game tokens among all players to start the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A decides to let Agent B lead a round of the game, stepping back to support them.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.6
        ]
      },
      {
        "description": "When Agent C makes a small mistake, Agent A reassures them it’s all in good fun and does not keep score of the error.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A proposes that the winner will get the chance to choose a group activity for the next family night.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.7
        ]
      },
      {
        "description": "During the game, Agent A listens attentively to Agent B’s strategy and openly praises their creative approach.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A displays empathy by recognizing when Agent C seems unsure and offers gentle guidance.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.5
        ]
      },
      {
        "description": "After the game, Agent A initiates a group hug to celebrate everyone’s effort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          1.0,
          0.2
        ]
      },
      {
        "description": "Agent A structures the game turns to allow everyone to have an equal number of plays.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.4,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is preparing a family dinner, with the atmosphere filled with positive interaction. Agent B contributes by adding a bouquet to the table, and Agent C arranges the cutlery with care. A sense of involvement and shared satisfaction is evident among the family members.",
    "actions": [
      {
        "description": "Invites Agents B and C to taste test the dish.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.2
        ]
      },
      {
        "description": "Praises Agent C for setting the table and suggests adding candles.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.1
        ]
      },
      {
        "description": "Encourages sharing personal stories during dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.3
        ]
      },
      {
        "description": "Organizes a game of charades with equal turns.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.6
        ]
      },
      {
        "description": "Lets Agent C decide on dessert.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.2,
          0.7
        ]
      },
      {
        "description": "Plans to share food with a neighbor.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          -0.1,
          0.8
        ]
      },
      {
        "description": "Volunteers for kitchen clean-up.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.3,
          0.9
        ]
      },
      {
        "description": "Suggests family meal planning.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      },
      {
        "description": "Leaves an appreciative note for Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "A family spends a tranquil weekend afternoon at home. Agent A casually lounges with Agent B, who's sketching out a design for a gift, while Agent C reads. The air is filled with the aroma of cookies and a quiet sense of shared responsibility within the household.",
    "actions": [
      {
        "description": "Agent A initiates the shelf assembly inviting family involvement.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A helps Agent B with design sketches and constructive feedback.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A sets the table, ensuring an equal share of cookies and milk.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a break for everyone to enjoy cookies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A prepares the workspace for shelf assembly.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A suggests role rotation during shelf assembly.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A lets Agent B choose the room's music.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A encourages playing a board game after assembly.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A listens actively to Agent C's anecdote.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and their housemates, Agents B and C, are in the kitchen of their shared apartment. Agent A is preparing a pizza, Agent B contributes herbs from the garden, and Agent C helps with setting the table. They are sharing stories and preparing to dine together.",
    "actions": [
      {
        "description": "Agent A asks Agents B and C to rate the flavor.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agents B and C to share stories about their favorite meals from childhood.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A encourages Agents B and C to contribute ideas for a weekly shared meal plan.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A ensures everyone gets an equal amount of pizza slices.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A proposes a board game night after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A acknowledges and thanks Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a conversation about everyone's schedules.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A washes the dishes after the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A notices Agent B looking thoughtful and offers an attentive ear.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In the cozy living room, Agent A sits with a photo album while Agent B and Agent C are sorting through family memorabilia on the floor, reminiscing and working on a collage project.",
    "actions": [
      {
        "description": "Agent A shares a childhood story related to a picture in the album.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A suggests taking a family photo to celebrate the moment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A offers to frame Agent B's childhood drawing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agent C to add a story to the collage.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A values the twins' input on preserving memories.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A makes hot cocoa for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A involves the twins in baking cookies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A praises the twins' creativity in the collage project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A listens and validates the twins' memories.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is a college student who, along with their roommate Agent B and neighbor Agent C, engages in cooking dinner and sharing a homemade pie in their apartment. The agents participate in activities that embody camaraderie and consideration for one another.",
    "actions": [
      {
        "description": "Agent A compliments Agent C on the pie and thanks them for their thoughtfulness.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A offers to do the dishes after dinner since Agent B prepared most of the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A initiates a conversation about their academic stresses, opening up to Agents B and C for support.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.4,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A proposes they all take turns cooking dinner on different nights of the week.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          1.0
        ]
      },
      {
        "description": "Agent A suggests playing a board game after dinner to unwind and build rapport.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A ensures Agent C feels welcome by offering them drinks and snacks before dinner is ready.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A remembers Agent B's favorite spice and makes a point to include it in the recipe.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A facilitates a discussion to agree on what type of cuisine they should cook next time.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A encourages Agent C to share a personal story, listening attentively and showing empathy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          1.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy home, Agent A who just completed a demanding project is gathered with family for a celebration dinner. Agent C is also present, having had a recent but unrecognized accomplishment.",
    "actions": [
      {
        "description": "Agent A proposes a toast to celebrate not only their project completion but also Agent C's recent accomplishment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent C to choose the first dish as a gesture of acknowledgment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A offers to share their favorite dessert with Agent C as a way of expressing affection.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A involves Agent B in a discussion to plan a family outing accommodating everyone's interests.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.6
        ]
      },
      {
        "description": "Agent A engages in conversation, showing interest in Agent C's school event.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A helps with serving, ensuring equal portions for the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A complies with Agent C's request to exchange seats, allowing closer proximity to Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A volunteers to do the dishes as an act of service.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A encourages Agent C to share any concerns with the family.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A has organized a family dinner to celebrate Agent B's academic achievement. Agent C, their aunt, is visiting and is made to feel included with dishes from her family recipe book being part of the meal. The setting is warm with a murmur of anticipated conversation around the table.",
    "actions": [
      {
        "description": "Agent A compliments Agent B on their academic success.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.1
        ]
      },
      {
        "description": "Agent A encourages Agent B to share their experience with the group.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent C to start serving the meal to show her inclusion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A passes dishes around to allow everyone to serve themselves equally.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.1,
          0.8
        ]
      },
      {
        "description": "Agent A actively listens and contributes to the conversation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A shares an amusing but respectful anecdote about Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          -0.1
        ]
      },
      {
        "description": "Agent A adjusts seating to make Agent C feel comfortable.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A organizes a board game that everyone enjoys.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A takes a group photo to memorialize the occasion.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a parent, is seated at the dining table with their partner, Agent D, in the kitchen, and their twin children, Agents B and C, playing a board game. They all prepare to enjoy a homemade meal together in their cozy home.",
    "actions": [
      {
        "description": "Agent A praises both children for playing nicely and taking turns during their game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A helps set the table, ensuring each member has the same number of utensils.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.6
        ]
      },
      {
        "description": "Agent A initiates a family discussion about the week's highlights.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A offers to clean up after lunch, acknowledging Agent D's effort in cooking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.4,
          0.5
        ]
      },
      {
        "description": "Agent A plans a family walk after lunch, considering everyone's preferred route.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.5
        ]
      },
      {
        "description": "Agent A encourages the family to play a cooperative board game after lunch.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A starts a round of compliments at the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A proposes a system where each family member gets to pick a weekly movie.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A helps the children with their homework in a supportive way.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.6,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy suburban home, Agent A is hosting a game night with Agents B, C, and D. They are seated in the living room playing a card game that involves creating stories, sharing laughter, and ensuring everyone is involved and heard.",
    "actions": [
      {
        "description": "Agent A rotates the storytelling duties among each child, giving them an opportunity to lead the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A shares a personal childhood story to connect with the children.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A suggests adding a collaborative twist to the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A encourages Agent C to share a story, emphasizing that every contribution is important.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.9
        ]
      },
      {
        "description": "Agent A praises the children for their creativity.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A offers a round of snacks, catering to each child's preference.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A leads a discussion on the lessons from the stories.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A proposes forming teams for support.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a suburban home, Agent A and Agent B prepare for a dinner party; Agent C assists while Agent D brings a pie. They create a warm environment for the dinner.",
    "actions": [
      {
        "description": "Agent A assists Agent B with retrieving dishes using a stool.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A prepares a special mocktail for Agent D to feel included.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.7
        ]
      },
      {
        "description": "Agent A announces a toast to show gratitude towards friends.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A ensures everyone gets an equal piece of Agent D's pie.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A takes over the table setting from Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A asks Agent D to share her pie recipe with everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A starts a group game for everyone to enjoy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A offers Agent C to serve herself first at dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A picks the least comfortable chair for himself.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, the elder sibling, returns home to find Agent B preoccupied and Agent C excited for a board game night. With warmth and engagement, they navigate the evening, focusing on shared enjoyment and respect for each other's comfort and needs.",
    "actions": [
      {
        "description": "Agent A decides to sit down with Agent C and help them choose a board game that everyone would enjoy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A notices that Agent B seems distracted and inquires sensitively if everything is okay or if they'd like to talk.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A proposes that each person gets to pick their favorite game, and they rotate, ensuring an equal chance to enjoy each other’s company.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          1.0
        ]
      },
      {
        "description": "Agent A willingly shares their news from college and asks Agents B and C about their lives, showing genuine interest.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A volunteers to order the dinner and collect it from the doorstep, considering it's their turn since they are the visitor.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A, recognizing that Agent B appears to be under some stress, privately offers support but respects their choice if they prefer not to discuss it.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A reminds Agents B and C to save some of the ordered food for their parents, showing consideration for them.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a home environment, Agent A prepares dinner and sets the table, while Agent B and Agent C are engaged in a card game. Agent D enters, and Agent A offers a welcoming gesture by having Agent D's favorite drink ready.",
    "actions": [
      {
        "description": "Agent A invites Agent D to select the music playlist for dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A divides the meal equally among everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A sets out a special dessert knowing it's a favorite for all.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a game at the table where each person shares their day’s highlight.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A proposes to take a group photo.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A offers to help Agent D with their studies.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A opens up about a personal challenge.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A passes on the last piece of dessert to Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.2,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A focuses on ensuring Agent B feels included.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.8,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "A family is spending a peaceful evening at home, with each individual busy with their tasks. The parent, Agent A, has prepared dinner but realizes it includes a dish that the teenage child, Agent B, does not like. As the family discusses this and their respective days, a warm sense of togetherness is evident.",
    "actions": [
      {
        "description": "Agent A invites Agent B to cook the alternative dish together to learn a new recipe.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A sets up a voting system for choosing the weekly menu to accommodate everyone's preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a family game night after dinner to encourage bonding.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A decides to teach Agent B an efficient study method observed at a conference.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A offers to assist Agent C with work to provide a break from the screen.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A proposes to dedicate one evening a week for family discussions on challenges and successes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A apologizes to Agent B and starts preparing an alternative dish they prefer.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A encourages family members to express gratitude to one another for daily small acts.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy suburban household, Agent A is coordinating a surprise dinner for their parents' anniversary with Agents B and C, by overseeing the kitchen activities and ensuring everyone's contributions are valued.",
    "actions": [
      {
        "description": "Agent A suggests everyone share their favorite memory with their parents during dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A resolves a minor dispute over table settings with a compromise.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A takes photographs of the event to create a photo album gift.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A makes sure there’s a toast option for Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A includes B and C in deciding the dinner music playlist.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A places a gift under the parents' plates for dessert.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A sets aside a dessert portion for a neighbor.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A organizes a post-dinner cleanup with rotating tasks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A creates a “Thank You” card station for parents.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B, siblings, are reorganizing their shared room with the help of Agent C, their parent, and Agent D, their cousin, to create a functional and comfortable space for both while maintaining a respectful and agreeable dynamic.",
    "actions": [
      {
        "description": "Agent A decides to offer Agent B the bigger desk.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A suggests setting up a schedule for using the room when one needs more quiet time for studying.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A brings out a board and asks everyone to write down their ideas for the room layout.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A offers to move their video game console to the communal living area.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A creates a cleaning roster, distributing the chores equally.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A suggests dedicating a shelf on the bookcase exclusively for Agent B's favorite novels.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A proposes a joint study session every week.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A gets extra storage boxes for personal items.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a room reveal celebration once they're done.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.6,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a shared living room, Agent A has recently ordered pizza for the group, and occupants are engaged in individual activities. A new board game is on the shelf, ready for a group activity.",
    "actions": [
      {
        "description": "Agent A suggests setting up the dining table for dinner, allowing everyone to share the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a conversation about everyone's day during dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A volunteers for cleanup after dinner, showing consideration for roommates.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A brings out a new board game and explains the rules, inviting others to play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A proposes rotating game choices on different nights.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A suggests taking a group photo if all agree.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A seeks feedback on the evening's activities for future planning.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A offers to help Agent C with a jigsaw puzzle for a competition.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and their partner, Agent B, are preparing a family dinner in their cozy, warmly lit kitchen. Their young child, Agent C, is at the table, glancing up and smiling. A single piece of cake and a dish in progress set the stage for interactions that imply caring and equitability.",
    "actions": [
      {
        "description": "Agent A adds an extra ingredient into the dish that Agent B enjoys.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A helps Agent C with homework, encouraging problem-solving.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A decorates everyone’s place setting at the dining table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A starts a game of sharing good moments of the day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A accepts Agent B's suggestions on dinner preparation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A ensures the roast is to Agent C’s liking.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a family day out considering everyone's preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A offers to clean up after dinner for Agent B to relax.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a parent, is preparing a weekend family dinner at home. Agent B, their partner, is setting the dining table, while Agent C, their child, is working on a school project. They discuss how to allocate the last piece of dessert.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to share their thoughts on how the family can solve the dilemma of the last dessert piece.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A proposes that they all share the last piece of dessert together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A offers the last piece of dessert to Agent B, acknowledging their effort in setting the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          -0.3
        ]
      },
      {
        "description": "Agent A saves the dessert and suggests using it as a little treat for whoever finishes their chores first the following week.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          -0.2,
          0.6
        ]
      },
      {
        "description": "Agent A sets up a game where the winner can decide what to do with the last dessert piece.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A creates a reward system that includes the last dessert piece for Agent C, tied to an educational milestone, like good grades.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          -0.3,
          0.7
        ]
      },
      {
        "description": "Agent A decides to use the situation as a lesson about sometimes not getting what one wants and reassures Agent C about making a fresh dessert together the next day.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.4,
          0.1,
          0.3
        ]
      },
      {
        "description": "Agent A volunteers to forego the dessert, emphasizing the joy of seeing others enjoy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A puts the last dessert piece away for another day when it can be equally shared.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.2,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a warm, sunlit kitchen, Agent A oversees his children, Agent B and Agent C, as they make birthday cards for their mother, filled with laughter and shared creativity.",
    "actions": [
      {
        "description": "Agent A pours milk for Agent B and Agent C, ensuring both glasses have the same amount.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.1,
          0.8
        ]
      },
      {
        "description": "Agent A suggests placing all the cards in a decorative box they decorate together, as a collective gift.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A proposes to Agent B and Agent C to clean up together, teaching them about sharing responsibilities.",
        "values": [
          0.0,
          0.0,
          0.0,
          -0.3,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to make their mother’s favorite dinner with Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to create a small skit for their mother.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A discusses the importance of appreciation for each other in daily life.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A offers to frame the best card, making a family decision on the best representation of their mother.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.3,
          -0.2
        ]
      },
      {
        "description": "Agent A volunteers to compile a photo album with captions and memories.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a comfortably furnished living room, Agent A, a young adult, is seated with Agents B and C, discussing the evening's plans for a homemade dinner. Each agent shows willingness to contribute, and shared responsibilities are visible through a household calendar.",
    "actions": [
      {
        "description": "Agent A decides to plan the menu considering all dietary preferences and restrictions of Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A leads a game where each person picks a random ingredient for the dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A suggests rotating the roles in the kitchen.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A sets up an anonymous feedback system for the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          -0.1,
          1.0
        ]
      },
      {
        "description": "Agent A creates a shared shopping list.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A organizes the kitchen space for everyone's comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.2,
          0.6
        ]
      },
      {
        "description": "Agent A decides to teach a recipe to Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A encourages Agent B to display their artwork in the dining area.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agents B and C to share stories from their day while they cook together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.9,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B are siblings who share an apartment. The setting is their living room, where they discuss rebalancing household chores due to Agent B's new job and Agent C joins them for a group project discussion.",
    "actions": [
      {
        "description": "Agent A creates a new, updated chore schedule.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A suggests organizing a study group.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A offers to take up a little extra workload at home temporarily.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          -0.2
        ]
      },
      {
        "description": "Agent A sets up a rotating responsibility system.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A leads a discussion to encourage open communication.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A proposes hosting a small gathering with friends.",
        "values": [
          0.0,
          0.0,
          0.0,
          1.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A suggests setting aside a dedicated time for relaxation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          1.0,
          0.2
        ]
      },
      {
        "description": "Agent A initiates a conversation to redefine personal boundaries.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A volunteers to handle grocery shopping for the week.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.3,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, is organizing a surprise birthday party at home for their parent, with a focus on equitable participation and a warm atmosphere that strengthens family bonds.",
    "actions": [
      {
        "description": "Agent A gives Agent B the task of setting up the dining area, ensuring everyone has a place.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A allocates time for each family member to speak at the party.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A asks for Agent C's opinion on the playlist.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A places a selection of games for all age groups to enjoy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          -0.1,
          0.2
        ]
      },
      {
        "description": "Agent A creates a homemade card and includes Agents B and C in the message writing.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A sets aside a quiet space in the house for breaks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.3,
          0.4
        ]
      },
      {
        "description": "Agent A decides to record a video message from all attendees.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A discusses the cleaning up responsibilities with Agents B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.1,
          0.8
        ]
      },
      {
        "description": "Agent A ensures the food menu accommodates dietary restrictions.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.2,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is spending an evening at home with housemates Agent B and Agent C. The living room is cozy, with a shared workspace on one side and a soft couch with a coffee table on the other. A board game is laid out on the workspace, while Agent B is working on a design project and Agent C is cooking in the kitchen.",
    "actions": [
      {
        "description": "Agent A suggests taking a break to play the new board game together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a cooking rotation plan.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A helps clean up after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A encourages Agent B to share their design project.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A documents the evening with photos.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A respects Agent B's choice to work or play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A plays music everyone enjoys.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A engages in conversation post-game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A seeks group consensus for activities.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.4,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, seated at a kitchen table with Agents B and C, who are working on a puzzle. A warm atmosphere is present with the smell of cookies and a flyer about civic responsibility nearby. Agent B and Agent C have differing views on puzzle piece turns, with each encouraging the other to proceed.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to take a break and share some of the cookies they baked.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A decides to initiate a family discussion about the upcoming community election.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a system for Agent B and Agent C to alternate turns adding puzzle pieces.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A recognizes Agent B's effort on the puzzle and compliments them.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A asks Agent B and Agent C if they want to spend time together attending a community event featured on the flyer.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A proposes a future family game night where everyone can share ideas for games to play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A takes photographs of the puzzle progress to document their collective efforts and preserve the memory.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A expresses pride in how well Agent B and Agent C are collaborating on the puzzle.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A notices that Agent C is using an old, slightly chipped mug and replaces it with a new one, ensuring that everyone has a decent mug for their tea.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is organizing a family dinner at home. Agent B, their spouse, and Agent C, their teenage child, are present. Agent D, who is a close family friend, is also visiting. An array of dishes is set on the table, which Agent A spent the afternoon preparing, including a specialty dish Agent C loves and a meal accommodating Agent D’s dietary preferences. They share stories and inquire about each other's well-being with warmth.",
    "actions": [
      {
        "description": "Agent A offers the specialty dish to Agent C, ensuring they get the first serving.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A checks with Agent D if the food meets their dietary preferences before they begin eating.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A initiates a conversation about favorite family memories.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A proposes a toast to appreciate everyone's presence and the shared meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A asks each person to share one positive aspect of their day.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A pays attention to everyone's portion sizes to avoid any dish running out before everyone is served.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A shares an interesting but not widely known fact about the origin of one of the dishes.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A involves Agents B, C, and D in planning the dessert course, asking for their preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A expresses gratitude to Agent B for their help in the preparation.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a middle-aged parent, stands in the spacious family kitchen, where the aroma of a freshly baked pie fills the air. Agent B lounges at the dining table with their tablet, while Agent C energetically races around. The kitchen is inviting, and laughter resonates within the walls. Agent A reviews a sheet of colorful paper with a list of household chores and names assigned to each task.",
    "actions": [
      {
        "description": "Agent A divides the last slice of pie equally between Agent B and Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A initiates a discussion at the table, affirming each family member's contribution to the home.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A turns the music on for Agent C to dance, observing and smiling warmly.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent B to help with the next meal's preparation, suggesting a recipe both enjoy.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A shares a story about their own childhood with Agent B and C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          1.0,
          0.4
        ]
      },
      {
        "description": "Agent A sits down to help Agent B with a difficult homework problem.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A keeps a promise to Agent C by playing a scheduled board game together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.9,
          0.8
        ]
      },
      {
        "description": "Agent A thanks Agent B for their help, acknowledging their effort in front of Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A listens to Agents B and C's ideas for a new family activity.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B, college roommates, are in the kitchen cooking dinner when Agent C, their neighbor, joins them with a pie. They share stories and prepare for a collective meal, demonstrating care and equal contribution.",
    "actions": [
      {
        "description": "Agent A invites Agent C to join them for dinner to return the kindness.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A volunteers to do the dishes after the meal, allowing Agent B some time to relax.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A allocates portions of the stew equitably among their dinner plates.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.3,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A initiates a game of cards post-dinner to continue the good spirits.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A asks everyone to contribute a personal story during the meal.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A proposes that they all cook dinner together once a week to strengthen their bond.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A offers some of the stew to Agent C to take home as a sign of goodwill.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A apologizes to Agent C when he accidentally spills a bit of stew on their pie, making amends by offering extra stew.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.2,
          0.7,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is in her family home's living room, having just returned home for a short visit. Her younger brother, Agent B, is working on a complex puzzle, and their mother, Agent C, is organizing family photos.",
    "actions": [
      {
        "description": "Agent A offers to help Agent B with the puzzle, suggesting they work on it together.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A asks Agent C if she would like any help with arranging the photographs or any other tasks.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A decides to make dinner for the family, considering everyone's preferences.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A brings out old board games for all family members to play.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A suggests creating a photo album to give as a gift.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A offers to share recent stories from college with Agent C.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A listens as Agent B explains the puzzle solutions he figured out.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A proposes an evening walk in the park after dinner.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.7,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "happiness",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A organizes a video game tournament at home, ensuring everyone understands the rules and has fun. Agent B and Agent C are the younger siblings participating, and Agent D, the parent, is present, observing the event. Agent A has set up the game and organized a favorite treat for the winner.",
    "actions": [
      {
        "description": "Agent A encourages Agent B after losing, with guidance to improve.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A gives Agent C extra time in the game.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A discusses with Agent D about inclusive tournament ideas.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A introduces consolation rewards for all players.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.8,
          0.4,
          1.0
        ]
      },
      {
        "description": "Agent A acknowledges Agent C's skillful game move.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A shares game skills with Agent B.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A ensures equal play turns for everyone.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.4,
          0.3,
          1.0
        ]
      },
      {
        "description": "Agent A adjusts game volume for Agent D's comfort.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A prepares refreshments for the participants.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.9,
          0.7,
          0.5
        ]
      }
    ]
  }
]