[
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home, Agent A is preparing a dinner featuring exotic herbs, with Agent B examining the herbs and Agent C caring for the potted plants.",
    "actions": [
      {
        "description": "Agent A samples a new spice mixture to perfect the recipe for the evening's meal.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a lively discussion with Agent B about the origin of the exotic herb.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A collaborates with Agent C to adapt the flavors in the dish to complement the scent of the herbs.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to redesign the dining setup to create a more interactive and cozy atmosphere for the guests.",
        "values": [
          -0.3,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A goes through an old family cookbook to find a traditional dish that would surprise Agent B and Agent C.",
        "values": [
          0.9,
          -0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to a friendly cook-off using unusual ingredients from Agent C's garden.",
        "values": [
          0.4,
          0.7,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B document their cooking experience to share with others who could not attend the dinner.",
        "values": [
          0.5,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to teach Agent C a cooking technique that uses freshly plucked herbs.",
        "values": [
          0.6,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A reminisces with Agent B and Agent C over a photo album that features past culinary adventures.",
        "values": [
          0.3,
          -0.5,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home, Agent A prepares a surprise gourmet dinner for Agent B and discusses fond memories with Agent C who stops by with wine.",
    "actions": [
      {
        "description": "Agent A tastes the sauce, adding herbs to enhance its flavor.",
        "values": [
          0.2,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A writes a heartfelt note to place at Agent B’s table setting.",
        "values": [
          -0.1,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sends a quick message to Agent B, teasing about a surprise awaiting downstairs.",
        "values": [
          0.6,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the living room furniture to create a more romantic dining atmosphere.",
        "values": [
          -0.2,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A lights candles and dims the lights in anticipation of Agent B’s arrival.",
        "values": [
          -0.2,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C reminisce over old photos, laughing over fond memories.",
        "values": [
          0.5,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A inquires about Agent C's recent vacation, eager to hear stories.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent C to taste test and give feedback on the dish.",
        "values": [
          0.4,
          0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Actively listening, Agent A comforts Agent C through a personal concern they share.",
        "values": [
          0.3,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, an enthusiastic home chef, is in the kitchen with his housemates, Agent B and Agent C, preparing a new recipe from an old cookbook, while B blends fruits and C observes, all surrounded by the aromas and chaos typical of culinary exploration.",
    "actions": [
      {
        "description": "Agent A rearranges the kitchen.",
        "values": [
          0.5,
          0.6,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests cooking without recipes.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A uses exotic spices for scent guessing.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a taste-testing competition.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares historical facts about recipes.",
        "values": [
          1.0,
          -0.1,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A teaches a new cooking technique.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A records the cooking process.",
        "values": [
          0.6,
          -0.2,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves an unfamiliar gadget.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a discussion on childhood meals.",
        "values": [
          0.7,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a bright kitchen, Agent A, a teenager, is making an unfamiliar dish from an old family cookbook as Agent B, his cousin, watches with interest, and Agent C, the sibling, sets the table creatively.",
    "actions": [
      {
        "description": "Agent A adds an untested spice mix to enhance the dish.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B compete to create an inventive garnish.",
        "values": [
          0.6,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a tasting station for sauce variations.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages storytelling about memorable meals while cooking.",
        "values": [
          0.5,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A leads a blind ingredient guessing game with the dish.",
        "values": [
          0.7,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A explains the history of the dish being prepared.",
        "values": [
          0.9,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a themed dining experience around the dish.",
        "values": [
          0.4,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates a scrapbook page of the cooking experience.",
        "values": [
          0.6,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invents a new dish from leftovers with Agents B and C.",
        "values": [
          0.8,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a parent, has prepared an in-house camping environment with a tent in the living room. Agents B and C, A's children, are contributing by adding storybooks and flashlights, while a movie night with popcorn is on the agenda.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to help themselves in assembling a pretend campfire.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a shadow puppet show with their hands.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests simulating nighttime outdoors using the lights and teaching about the stars.",
        "values": [
          0.5,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a house-wide treasure hunt for the children.",
        "values": [
          0.9,
          1.0,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to share camping stories from their own childhood.",
        "values": [
          0.4,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches how to make campfire snacks.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A creates a reading nook in the tent and encourages Agents B and C to read aloud.",
        "values": [
          0.9,
          -0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A brings a globe for a game about geography and cultures.",
        "values": [
          1.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a comfortable space for bonding and deep conversations.",
        "values": [
          -0.1,
          -0.5,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student interested in cooking, enters the kitchen to find Agent B preparing a surprise dinner for their parents' anniversary. The kitchen is bustling with activity and filled with a blend of exotic aromas.",
    "actions": [
      {
        "description": "Agent A decides to join Agent B in the kitchen, offering to assist in preparing the surprise dinner.",
        "values": [
          0.4,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A begins to sort through the ingredients, setting up the mise en place for ease of cooking.",
        "values": [
          0.2,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent B in a conversation about the new dish being prepared, asking questions about the recipe and its origin.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes improvising a small part of the recipe with an unexpected ingredient they recently learned about.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A carefully records each step of the cooking process, documenting the shared experience with Agent B.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shows Agent B how to safely use a particularly sharp knife to chop vegetables efficiently.",
        "values": [
          0.3,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A passes some of their harder-earned culinary tricks to Agent B, explaining why certain techniques work better.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A tastes the dish in progress and provides thoughtful feedback, encouraging Agent B's efforts.",
        "values": [
          0.4,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B adjust the seasoning of the dish together, making it more suited to their parents' taste preferences.",
        "values": [
          0.3,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are in the kitchen, preparing to cook with a variety of ingredients. Agent C, their parent, joins to assist, while Agent D, a family friend, observes the busy scene.",
    "actions": [
      {
        "description": "Agent A decides to start a cooking vlog and captures the process of making the new dish.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A draws up a menu for the week featuring exotic dishes from different cultures.",
        "values": [
          0.7,
          0.6,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B plan a small surprise dinner party for Agent C’s birthday.",
        "values": [
          0.4,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A creates a garden corner on the balcony to grow fresh herbs.",
        "values": [
          0.7,
          0.8,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A reorganizes the kitchen, setting up dedicated stations.",
        "values": [
          0.3,
          0.7,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A embarks on a challenge to cook a meal using only leftover ingredients.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A starts a family cookbook, asking for heritage recipes.",
        "values": [
          0.5,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B engage in a friendly cooking competition.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to cook breakfast every morning for a week.",
        "values": [
          0.2,
          0.9,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are in their shared apartment where the living room is used for various activities. The environment is cozy, and there are several stimuli for interaction.",
    "actions": [
      {
        "description": "Agent A grabs a novel from the shelf that she hasn’t read yet and begins discussing the plot with Agent B.",
        "values": [
          0.7,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a board game from the shelf that they haven’t played, proposing to learn and play it together.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B plan a cooking experiment with new ingredients to create a unique dish.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests rearranging the furniture in the living room.",
        "values": [
          0.5,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A fetches the guitar and starts to play a tune, inviting Agent B to sing along.",
        "values": [
          0.4,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a memory box filled with photos.",
        "values": [
          0.6,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a video call with an overseas friend, including Agent B.",
        "values": [
          0.7,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A kneels down to join Agent B in completing the puzzle.",
        "values": [
          0.5,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A brainstorms DIY decorations for their space.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A brings home a variety of plants and eagerly begins to care for them. Observing that some plants are struggling, A seeks to use new knowledge from a book to resolve the issues. Roommates Agent B and C engage with A, discussing the plants and sharing homemade tea. Agent A is excited to share this new passion with B and C, fostering a deeper connection among them through this shared interest.",
    "actions": [
      {
        "description": "Agent A rearranges the plants to optimize their light exposure.",
        "values": [
          0.7,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the needs of each plant species with roommates.",
        "values": [
          0.8,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A waters the plants that need attention.",
        "values": [
          0.4,
          0.5,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A carefully trims dead foliage to encourage plant health.",
        "values": [
          0.5,
          0.3,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A starts documenting plant progress in a journal.",
        "values": [
          0.9,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A involves roommates in repotting a plant.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a trip to a botanical garden with B and C.",
        "values": [
          1.0,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A tries creating plant food from compost with Agent C's advice.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A and C work on aesthetically arranging the plants.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a university student residing in a shared apartment with two housemates, Agent B and Agent C. Agent A comes home to find Agent B experimenting with a new recipe in the kitchen, while Agent C is sitting cross-legged on the living room floor, surrounded by paints, brushes, and canvases. The aroma of exotic spices fills the apartment, and low, ambient music accompanies the gentle clinking of brush against canvas. Agent A, intrigued by both activities, pauses to take in the colorful canvases before considering joining Agent B in the kitchen. The environment is ripe for learning and interaction, with different activities beckoning Agent A’s engagement.",
    "actions": [
      {
        "description": "Agent A decides to join Agent B in the kitchen and asks if they can help with the meal preparation.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes interest in one of the spices, inquiring about its origin and flavor profile.",
        "values": [
          1.0,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a plating design idea to Agent B that they learned in a culinary presentation workshop.",
        "values": [
          0.7,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game with Agent C where they both paint their interpretation of a shared memory.",
        "values": [
          0.9,
          0.7,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings a new board game to the living room and invites Agents B and C to play after dinner.",
        "values": [
          0.6,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers to document Agent C's painting process with their camera to share on social media.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A opens a cookbook to a random page and challenges Agent B to add that dish to tonight’s menu.",
        "values": [
          1.0,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to arrange the kitchen space for a more enjoyable cooking experience and social interaction.",
        "values": [
          0.5,
          0.8,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent C that they exchange canvases for a few brush strokes, to meld their styles.",
        "values": [
          0.9,
          0.5,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a shared apartment, Agent A pauses their studies to engage with roommates Agent B and Agent C, who are cooking and exploring music, respectively, in a cozy common room. The environment reflects a blend of their personal interests.",
    "actions": [
      {
        "description": "Agent A inquires about Agent B's recipe, asking questions about its origin and ingredients.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent C to explore the vinyl collection and suggests new music to experience together.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a refreshing beverage for all, considering everyone's preferences to enjoy together.",
        "values": [
          -0.3,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a creative brainstorming activity to repurpose unused apartment spaces.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A captures the shared living dynamics through a spontaneous indoor photography session.",
        "values": [
          0.2,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A leads the organization of a collaborative cooking event, each person contributing a dish.",
        "values": [
          -0.2,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a deep sharing session to trade insights and stories from their week.",
        "values": [
          0.5,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A encourages organic cooking experimentation with ingredients from Agent B's plants.",
        "values": [
          0.9,
          -0.1,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, along with Agent B and Agent C, engages in activities at home, which include playing chess, baking cookies, sharing family stories, dancing, storytelling, puzzling, mock interviewing, taste-testing, building domino setups, and playwriting.",
    "actions": [
      {
        "description": "Agent A proposes a chess tournament with Agents B and C.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to bake cookies alongside B and C.",
        "values": [
          0.3,
          0.6,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories with B from the photo album.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A has C create dances to a playlist.",
        "values": [
          0.6,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A engages everyone in a storytelling game with objects.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites B and C to complete a puzzle.",
        "values": [
          0.4,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a mock interview with B and C.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A hosts a taste test game using snacks.",
        "values": [
          0.5,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A, B, and C build and topple a domino setup.",
        "values": [
          0.7,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, returns home for the holiday season and finds his sibling (Agent B) and parent (Agent C) busy in the kitchen with baking and reminiscing over old family recipes. The environment smells of gingerbread, evoking warmth and past holiday traditions.",
    "actions": [
      {
        "description": "Agent A pulls up a chair next to Agent B to help with the gingerbread house, suggesting new design ideas.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A rummages through the pantry to find additional ingredients for an exotic recipe he has in mind.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves an old family photo album from the living room shelf and begins reminiscing over past holiday memories with Agent B and Agent C.",
        "values": [
          0.4,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a bake-off challenge to Agent B using a recipe neither has tried before.",
        "values": [
          0.9,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A searches online for a unique gingerbread recipe from a different culture to share a new experience with Agents B and C.",
        "values": [
          1.0,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a video call with a distant relative to ask about their own holiday traditions and recipes.",
        "values": [
          0.8,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to clear the table and organize the collected recipes into a family holiday cookbook for future reference.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A gets out a new kitchen gadget that they recently acquired and invites Agents B and C to learn how to use it together.",
        "values": [
          0.6,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to share stories about past holidays as they sift through the recipes, seeking a deeper connection and understanding.",
        "values": [
          0.4,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a suburban family home, Agent A is in the kitchen preparing a surprise dinner for his parents, adding his own twist to a recipe. Agent B, his older cousin, lounges in the living room with a novel. Agent C, a parent, arrives home to witness the connection between the two spaces.",
    "actions": [
      {
        "description": "Agent A decides to experiment by adding an exotic spice from the rack to the dish.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A cheerily calls out to Agent B, asking for a taste-test of the new recipe in progress.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously arranges the dining area to create an inviting ambiance for dinner.",
        "values": [
          0.3,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent C about their day, while continuing to stir the pot.",
        "values": [
          0.4,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join in the cooking process, teaching them the recipe step by step.",
        "values": [
          0.7,
          0.6,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes a quick break to share a funny cooking anecdote with Agent B and C, seeking a moment of laughter together.",
        "values": [
          0.2,
          -0.1,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A consults an online culinary forum for a unique garnishing technique, enhancing the dish's presentation.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A searches the pantry for a special ingredient he recalls from a cooking show to add to the meal.",
        "values": [
          0.9,
          0.5,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent C a carefully prepared appetizer to enjoy while they wait for the main course.",
        "values": [
          0.2,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are in the kitchen tending to a small indoor herb garden. Agent A finds an old cookbook with intriguing recipes while arranging the garden and becomes interested in learning more about the herbs and their uses. Agent B also shows enthusiasm for cooking and helps cultivate the herbs.",
    "actions": [
      {
        "description": "Agent A asks Agent B to join in planting a new herb.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes notes about the growth process of each herb.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A crafts a small sign with the name of a new herb.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to prepare a meal using some herbs.",
        "values": [
          0.5,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to rearrange the kitchen space.",
        "values": [
          -0.3,
          0.8,
          0.0,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A researches online about the best ways to nurture plants.",
        "values": [
          1.0,
          -0.1,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets reminders to water the herbs.",
        "values": [
          -0.2,
          0.6,
          0.0,
          0.0,
          -0.5,
          0.0
        ]
      },
      {
        "description": "Agent A starts a blog to document the gardening journey.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sketches out a plan to expand the indoor garden.",
        "values": [
          0.6,
          0.7,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home, Agent A, lounges on the sofa with a sketchpad. Agent B is surrounded by an eclectic mix of art supplies, and Agent C relaxes with headphones on. The comfortable setting is filled with the potential for interaction and exploration.",
    "actions": [
      {
        "description": "Agent A decides to start a new sketch inspired by the colors around Agent B.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join in a collaborative drawing session.",
        "values": [
          0.3,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shares an old family album with Agents B and C.",
        "values": [
          0.5,
          -0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A asks to learn more about Agent B's art project.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a homemade snack for everyone.",
        "values": [
          -0.2,
          0.8,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages in an impromptu dance-off with Agent C.",
        "values": [
          -0.1,
          1.0,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B plan a mural for their shared bedroom.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with a challenging part of a video game.",
        "values": [
          -0.3,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests building a fort out of blankets and pillows.",
        "values": [
          0.6,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a 25-year-old young adult, joins Agent B and Agent C in the kitchen on a Sunday afternoon. Agent B is experimenting with a new recipe, and Agent C is sorting through old family photos. The room is filled with warmth, the scent of baking, and background music.",
    "actions": [
      {
        "description": "Agent A sifts through a cookbook, exhibiting an interest in the range of recipes.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with complex recipe tasks.",
        "values": [
          0.4,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C about the stories behind old photographs.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A curates a music playlist for a more enjoyable atmosphere.",
        "values": [
          0.5,
          0.6,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to a cooking competition.",
        "values": [
          0.6,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A captures photos of the family for a newsletter.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a taste-testing session after cooking.",
        "values": [
          0.2,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing a board game while waiting for the oven.",
        "values": [
          0.1,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decorates the table for the meal as a special occasion.",
        "values": [
          0.2,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, after a run, enters the home where Agent B is constructing a 3D puzzle and Agent C cooks a new recipe. Agent A is drawn to both, sensing opportunities for interaction and learning.",
    "actions": [
      {
        "description": "Agent A decides to help Agent B with the 3D puzzle, offering strategies they've read about in a book.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A samples the dish Agent C is preparing and offers feedback based on a cooking show they recently watched.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A begins to suggest a workout routine to Agent C, noticing their interest in maintaining a good physical condition.",
        "values": [
          -0.2,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A takes out the scrapbook, inviting Agents B and C to reminisce and add more memories to it.",
        "values": [
          0.3,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a challenge for all three to complete a section of the puzzle before the dish is ready, integrating a sense of playfulness and teamwork.",
        "values": [
          0.5,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A starts a spirited discussion on the benefits of different tea varieties, educating and sharing knowledge with the others.",
        "values": [
          0.8,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B rearrange the living room furniture to better accommodate their mutual space for activities.",
        "values": [
          -0.3,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A curates a playlist of energizing music to set the mood for the evening's activities.",
        "values": [
          0.1,
          0.9,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to document the ongoing activities by taking photos, enhancing the scrapbook with fresh memories.",
        "values": [
          0.2,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a storyteller and avid gardener, finds an ancient-looking map and with friends Agent B and C, explores the potential hidden parts of the garden, with a shared sense of discovery and togetherness.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to help decipher symbols on the map, potentially leading to a hidden part of the garden.",
        "values": [
          0.9,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a magnifying glass and begins to examine the intricate details and patterns on the map.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A suggests organizing an impromptu backyard exploration following the map.",
        "values": [
          0.7,
          0.8,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes notes and sketches portions of the map for cross-reference with gardening books.",
        "values": [
          1.0,
          0.3,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A calls upon a nearby friend who is knowledgeable in local history to join and provide insights.",
        "values": [
          0.6,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to prepare a small picnic to carry along for the exploration with Agents B and C.",
        "values": [
          -0.4,
          0.5,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A crafts a makeshift flag out of an old curtain and a broomstick, declaring the initiation of their adventure.",
        "values": [
          -0.3,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to document their findings and process on video.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A builds a temporary display shelf using recycled materials to showcase any artifacts.",
        "values": [
          -0.5,
          0.6,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, is at home for the weekend and discovers a puzzle and a new recipe. Agent A's sibling, Agent B, is engrossed in reading a novel on the couch.",
    "actions": [
      {
        "description": "Agent A proposes continuing the jigsaw puzzle and invites Agent B to join in, fostering collaboration.",
        "values": [
          0.7,
          -0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A picks up the recipe book and begins to collect ingredients to cook the new dish.",
        "values": [
          0.6,
          0.8,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent B about the novel, showing interest in the story.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk outside to enjoy the morning together.",
        "values": [
          0.3,
          0.9,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a camera to document the cooking process.",
        "values": [
          0.5,
          0.4,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a workout session in the living room with Agent B.",
        "values": [
          -0.1,
          1.0,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A offers a different perspective on a challenging section of Agent B's novel.",
        "values": [
          0.6,
          -0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A begins experimenting with puzzle techniques.",
        "values": [
          0.8,
          -0.4,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A starts a competition with Agent B to create the most creative dish.",
        "values": [
          0.5,
          0.7,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student living in a shared apartment, has just finished a long day of classes. The shared living space is filled with Agent B's paintings, one of which catches Agent A's attention. Agent B engages Agent A's attention by asking him to guess the hidden object in a painting. New books on a variety of subjects are on the coffee table, and Agent C is practicing guitar.",
    "actions": [
      {
        "description": "Agent A proposes they play a game where they both add something unique to the canvas without seeing what the other adds until they are both done.",
        "values": [
          0.7,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to research the object hidden in the painting to guess its significance.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A cooks a new recipe from one of the recently acquired cookbooks to share with Agent B and C.",
        "values": [
          0.4,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a friendly debate on a thought-provoking topic from one of the new books.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to join him in creating a collaborative piece of art or music.",
        "values": [
          0.5,
          0.4,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a tripod and camera to create a time-lapse of their communal art project to document the process.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C for a basic guitar lesson, hoping to understand the chords to a song they all like.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A explores the possibility of organizing a small art exhibition at their apartment for friends.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A reorganizes the living room to make more space for their artistic and musical activities.",
        "values": [
          0.3,
          0.8,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a parent, is working on preparing dinner with Agent B lounging in the living room and Agent C working on school assignments at the dining table.",
    "actions": [
      {
        "description": "Agent A decides to experiment with a new recipe they saw online that challenges their cooking skills.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets a plate of freshly cut fruit next to Agent C while asking about their day at school.",
        "values": [
          -0.2,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join in the kitchen and help with meal preparation as they share stories from their day.",
        "values": [
          0.3,
          0.6,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Seeing Agent C focused on their homework, Agent A carefully chooses not to interrupt but gives a supportive thumbs-up from the kitchen.",
        "values": [
          -0.5,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that the family eats dinner outside to enjoy the beautiful weather and change of environment.",
        "values": [
          0.5,
          0.3,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A proposes a family board game to spend quality time together.",
        "values": [
          0.5,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "As Agent B mentions a funny anecdote from a photo, Agent A listens attentively and contributes their own memory related to the photo.",
        "values": [
          0.6,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A saves some of the special dish they made to share with a neighbor who loves trying new cuisine.",
        "values": [
          0.2,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Observing Agent C's engagement with their homework, Agent A expresses pride and reinforcement by displaying their work on the refrigerator.",
        "values": [
          0.1,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A finds a box of old items and maps in the attic, which sparks an interest to learn more about them. Agent C, reading in the living room, is invited to explore the box's contents. Agent B, preparing dinner, is unaware of the discovery. The scene is set for further discovery, learning, and family interaction.",
    "actions": [
      {
        "description": "Agent A carries the box down to the living room to show Agent C and explore the contents together.",
        "values": [
          0.7,
          -0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sits down next to Agent C, taking out objects from the box one by one, discussing what each item could be.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A persuades Agent B to join them after dinner to hear stories about the items in the box.",
        "values": [
          0.6,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A unfolds one of the maps and plots a plan to explore the landmarks mentioned on it over the weekend.",
        "values": [
          1.0,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A takes a few objects and attempts to restore or clean them to see if there are any hidden details.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A uses their phone to research one of the more intriguing items to learn about its history.",
        "values": [
          1.0,
          -0.4,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C experiment by trying to recreate one of the crafts detailed in an old instruction sheet found in the box.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to display some of the items in their room as decoration and remembrance of this discovery.",
        "values": [
          0.3,
          -0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shares photos of the items on social media to see if friends have any knowledge about them.",
        "values": [
          0.4,
          -0.2,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home at twilight, Agent A inspects a new plant species in the living room, while Agent B works on a puzzle and Agent C reads a novel. Agent D is upstairs, and someone has baked cookies in the kitchen. There is a sense of engagement amidst the agents.",
    "actions": [
      {
        "description": "Agent A examines the plant's leaves to determine health and watering needs.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A takes plant cuttings and shares the process with Agent B.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agents B and C about plant care requirements.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sketches a design for a greenhouse, including Agent C's ideas.",
        "values": [
          0.7,
          0.6,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A prepares and applies a nutrient mixture for the plant.",
        "values": [
          0.5,
          0.7,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges plants for sunlight, asking Agent B to move the puzzle.",
        "values": [
          -0.4,
          0.8,
          0.0,
          0.0,
          -0.5,
          0.0
        ]
      },
      {
        "description": "Agent A makes a homemade plant mister from recycled materials.",
        "values": [
          0.6,
          0.9,
          0.0,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C brainstorm names for the new plant.",
        "values": [
          0.5,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent D to join for a plant biodiversity presentation.",
        "values": [
          0.8,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are siblings spending their weekend at home. Agent A is reading, and Agent B has just cut a plate of fruits. There's an unexplored smart speaker and brochures of local community activities around them, presenting numerous opportunities for engaging experiences.",
    "actions": [
      {
        "description": "Agent A approaches Agent B to inquire about and help set up the new smart speaker.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes joining a cooking workshop together with Agent B.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A expresses interest in gardening and asks Agent B to share repotting skills.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes an indoor picnic for them and Agent B.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a dance routine from an online tutorial with Agent B.",
        "values": [
          0.4,
          0.9,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent B in planning a summer project using community brochures.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plays Agent B's favorite playlist on the smart speaker.",
        "values": [
          0.3,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests stargazing later and learning about constellations with Agent B.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages a walk with Agent B to talk about and decide community classes to attend.",
        "values": [
          0.5,
          0.8,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "'Agent A' comes into the kitchen where 'Agent B' is preparing exotic ingredients for a recipe. 'Agent C' is composing music at the kitchen island, and 'Agent D' is gardening outside. The home is alive with creative activities and familial warmth.",
    "actions": [
      {
        "description": "'Agent A' inquires about an unfamiliar ingredient from 'Agent B'.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "'Agent A' volunteers to assist 'Agent B' in cooking.",
        "values": [
          0.5,
          -0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "'Agent A' proposes an ingredient substitution to 'Agent B'.",
        "values": [
          0.6,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "'Agent A' tries to play the guitar with 'Agent C' and seeks advice.",
        "values": [
          0.8,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "'Agent A' decides to capture 'Agent C's songwriting on video.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "'Agent A' asks 'Agent C' about the story behind the song.",
        "values": [
          0.9,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "'Agent A' looks at old family photos with 'Agent C'.",
        "values": [
          0.4,
          -0.5,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "'Agent A' joins 'Agent D' to learn about garden maintenance.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "'Agent A' assists 'Agent D' in repotting plants.",
        "values": [
          0.5,
          -0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "'Agent A' is preparing a meal in the apartment's kitchen with 'Agent B' and 'Agent C' present. 'Agent A' finds a mysterious spice jar and is encouraged by 'Agent C's interest to explore using it.",
    "actions": [
      {
        "description": "'Agent A' decides to open the mysterious spice jar to explore its contents, smelling and tasting it to guess the ingredients.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "'Agent A' invites 'Agent C' to find a recipe online that they could try using the new spice blend.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "'Agent A' engages in a light-hearted cooking competition with 'Agent B', creating a dish with a secret ingredient from 'Agent C'.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "'Agent A' playfully challenges 'Agent C' to chop vegetables as finely as possible.",
        "values": [
          0.5,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "'Agent A' sets up a taste test for 'Agent B' and 'Agent C' with different herbs and spices.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "'Agent A' encourages 'Agent C' to use a kitchen gadget they haven't tried before.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "'Agent A' arranges a shared plating activity for dinner presentation.",
        "values": [
          0.4,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "'Agent A' proposes turning the meal into an indoor picnic.",
        "values": [
          0.5,
          0.6,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "'Agent A' suggests telling stories about favorite meals from childhood while cooking.",
        "values": [
          0.3,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen, looking through the contents of the fridge with eagerness. Agent B is reading a novel on the living room sofa. Agent C left a wrapped surprise on the kitchen counter. A puzzle box and fresh coffee add to the scene, hinting at both unfinished activity and relaxed enjoyment.",
    "actions": [
      {
        "description": "Agent A opens the wrapped item left by Agent C to discover what's inside.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to help solve the puzzle box on the kitchen counter.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to Agent B to plan a day out using the travel magazines for inspiration.",
        "values": [
          0.9,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A selects a variety of snacks from the fridge and arranges a small picnic setup for them and Agent B.",
        "values": [
          0.2,
          -0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes out a recipe book from the shelf, deciding to try out a new recipe.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A calls Agent C to express gratitude for the surprise and to gather more information about it.",
        "values": [
          0.7,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A grabs the camera from the living room and takes pictures of the puzzle box's progress.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A collects ingredients from the fridge and starts prepping a meal, asking Agent B for assistance.",
        "values": [
          0.3,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A moves to the living room, joining Agent B on the sofa, and asks about the novel being read.",
        "values": [
          0.4,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is lounging on the couch with a travel magazine, Agent B is making a fruit smoothie, and Agent C places a board game on the coffee table.",
    "actions": [
      {
        "description": "Agent A asks Agent B about trying a new smoothie recipe seen in the travel magazine.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join in planning a potential travel itinerary, picking destinations from the magazine.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to Agent B and Agent C to partake in the board game, suggesting a team-up strategy.",
        "values": [
          0.5,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to rearrange the living room furniture to create more space for playing the board game comfortably.",
        "values": [
          -0.2,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A takes out personal travel photos and shares stories behind them with Agent B and Agent C.",
        "values": [
          0.3,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A fetches additional ingredients from the garden to enhance the smoothie recipe.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a creative photo session with Agent B and Agent C, using travel-themed props and costumes found in the house.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a playful challenge with Agent B to see who can invent a more innovative smoothie without a recipe.",
        "values": [
          0.8,
          0.6,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A drafts a funny and heartwarming speech to toast to their shared weekend, reflecting on past family trips.",
        "values": [
          0.4,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a teenager found in the living room of their family home, surrounded by open books and notes. Agent B, Agent A's sibling, sprawls on the floor nearby, sketching intently in a notebook. Agent C, a parent, is fixing a hearty stew in the kitchen.",
    "actions": [
      {
        "description": "Agent A decides to initiate a conversation with Agent B about the sketchbook, asking interpretive questions to understand the thought process behind each drawing.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A, feeling a rush of enthusiasm, proposes an impromptu trivia game focused on facts mentioned in A's study material, inviting B and C to join.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to collaborate on a complex puzzle that A has found difficult to solve alone.",
        "values": [
          0.6,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A explores the bookshelf in search of a novel to read, showing interest in unfamiliar genres that A hadn't considered before.",
        "values": [
          0.9,
          0.1,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Amidst studying, Agent A leaps up and challenges Agent B to a friendly physical competition - racing to touch the mailbox at the end of the driveway and back.",
        "values": [
          -0.2,
          0.9,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent C prepare the meal, hoping to learn a new recipe and contribute to the family dinner.",
        "values": [
          0.5,
          0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "To break the study monotony, Agent A suggests to Agent B that they rearrange the living room furniture, showing excitement about a fresh perspective for their shared space.",
        "values": [
          0.2,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to create a surprise for Agent C by secretly cleaning the kitchen while C is occupied elsewhere.",
        "values": [
          -0.1,
          0.7,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out old family photo albums, and together with Agent B, they reminisce and construct a detailed family timeline.",
        "values": [
          0.6,
          0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a young parent who's just returned from work to find Agent B, their child, playing excitedly in the living room with an open globe puzzle. Agent C, their partner, is sitting on the couch, looking through a family photo album, occasionally glancing at Agent B with a smile and offering gentle words of encouragement.",
    "actions": [
      {
        "description": "Agent A joins Agent B on the floor and begins helping with the puzzle, pointing to different countries and sharing fun facts about each one.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a game where they time how fast Agent B can find and place ten puzzle pieces correctly, offering gentle supervision.",
        "values": [
          0.5,
          0.4,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A looks up a documentary about the Earth to watch with Agent B and Agent C after dinner.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to call a grandparent to share the progress on the puzzle and ask questions about places they have visited.",
        "values": [
          0.6,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A brings in a snack for everyone, making sure it's something energizing and healthy.",
        "values": [
          0.1,
          0.8,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A takes a photo of Agent B's progress with the puzzle to share with more distant family members or friends.",
        "values": [
          0.3,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to rearrange the living room with Agent C and Agent B to make more space for playing together.",
        "values": [
          0.2,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent C about planning a family trip to learn more about different cultures.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a playful challenge with Agent B where they mimic animals from each continent they complete on the puzzle.",
        "values": [
          0.4,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a high school junior who has just woken up and heads down to the kitchen to join Agent B, their older sibling, in making breakfast. Agent C, a childhood friend staying over, is setting up a science-themed board game. The kitchen opens up to a garden where fresh air streams in, setting a lively and cozy scene for the day’s activities.",
    "actions": [
      {
        "description": "Agent A decides to join in making breakfast with Agent B, mixing their own experimental pancake flavors.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B and Agent C to join in a morning exercise routine in the garden before breakfast.",
        "values": [
          0.6,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A takes the role of game master in the board game, challenging Agent B and Agent C with creative scenarios.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a garden scavenger hunt post-breakfast, drafting a list of items for everyone to find.",
        "values": [
          0.8,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a photo album filled with childhood memories to share stories with Agent B and Agent C.",
        "values": [
          0.3,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a brainstorming session with Agent B and Agent C on how to redecorate the common space in the home.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to teach Agent C how to perfect a pancake flip, sharing their technique.",
        "values": [
          0.4,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A plans a plot for a homemade movie, casting Agent B and Agent C as characters, and starts drafting a script.",
        "values": [
          0.9,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a picnic area in the garden, arranging seating, music, and games for a more interactive breakfast experience.",
        "values": [
          0.5,
          0.7,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is enjoying a lazy Sunday afternoon at home, surrounded by plants and foreign language books, indicative of their most recent learning endeavor. Agent B, their life partner, is absorbed in a novel, and Agent C, their child, is focused on a puzzle. A comfortable silence envelops the room, showing a deep sense of ease and togetherness.",
    "actions": [
      {
        "description": "Agent A suggests to Agent B that they play a board game.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A gets down on the floor to help Agent C with the puzzle.",
        "values": [
          0.5,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to cook an exotic dish with Agent B.",
        "values": [
          0.7,
          -0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to rearrange the living room furniture.",
        "values": [
          0.3,
          0.7,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a deep conversation about the book's themes.",
        "values": [
          0.8,
          -0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and C to join an indoor treasure hunt.",
        "values": [
          0.7,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to teach them the basics of knitting.",
        "values": [
          0.6,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts compiling a photo album of the family's past adventures.",
        "values": [
          0.4,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A plays a memory game involving family stories with Agent C.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In the cozy living room of a suburban home, 'Agent A,' a teenager with an adventurous spirit, is lounging on the couch, flipping through an old family photo album. 'Agent B', Agent A's parent, is busy in the kitchen, stirring a pot while occasionally glancing over to share smiles and waves with A. 'Agent C', Agent A’s cousin, sits at the dining table with a laptop open, typing away fervently on what appears to be a research project. The atmosphere is one of comfort and familiarity, filled with the aroma of cooking and the faint sound of music playing from C's earphones.",
    "actions": [
      {
        "description": "Agent A asks Agent C about their research project and if they can help in any way.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to cook a family recipe, seeking guidance from Agent B in the kitchen.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game of charades involving everyone in the room to lift the spirits.",
        "values": [
          -0.2,
          0.8,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously organizes the photo album, asking Agent B for stories behind the pictures.",
        "values": [
          0.9,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a walk outside to Agent C for a break and some fresh air.",
        "values": [
          -0.1,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A creates a new playlist with songs that everyone likes and plays it in the living room.",
        "values": [
          0.2,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A persuades Agent B and C to join in a workout session after dinner.",
        "values": [
          -0.5,
          1.0,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to take a rest and offers to continue the typing work.",
        "values": [
          0.4,
          -0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and C brainstorm an idea for a small family event to bring everyone closer.",
        "values": [
          0.5,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy living room on a chilly Saturday, Agent A is studying an old family cookbook while Agent B knits and Agent C reads. A familial air enriched by shared activities and storytelling permeates the setting.",
    "actions": [
      {
        "description": "Agent A decides to bake a complex family recipe for the first time.",
        "values": [
          0.7,
          -0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites B and C to join him in the kitchen for baking.",
        "values": [
          0.4,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B about the recipe’s origin and family stories.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A prepares the kitchen meticulously for the baking task.",
        "values": [
          -0.2,
          0.8,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a dance-off while waiting for the dessert.",
        "values": [
          0.3,
          0.9,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A looks up a culinary term in the encyclopedia.",
        "values": [
          1.0,
          -0.3,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A inquires about Agent C’s book for a possible read.",
        "values": [
          0.8,
          0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plates the dessert and asks for family’s opinions.",
        "values": [
          -0.1,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the dessert and family.",
        "values": [
          0.2,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student in a shared house, notices an old box filled with artifacts that could contain stories from previous tenants. Agent B, her roommate, is sketching, while Agent C, her childhood friend, is revisiting photos on their camera. The environment is one that seems ripe for exploration and shared experiences.",
    "actions": [
      {
        "description": "Agent A decides to reach for the ornate box to explore its contents.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent C they could use the trinkets inside the box to create a collage.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to join in on the activity to make it a bonding experience.",
        "values": [
          0.5,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes a closer look at Agent B's sketches and gives constructive feedback.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a conversation with Agent B and Agent C about the history and stories behind the sketches and pictures.",
        "values": [
          1.0,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a late-night walk outside to refresh and ignite a spirited discussion.",
        "values": [
          0.6,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A organizes an impromptu storytelling session using the box's contents as prompts.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A plans a future group outing to an art gallery, inspired by the sketches and photographs.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to use specific items in the box to enhance their photography.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, is sitting at the kitchen table with an old family cookbook. Agent B, his aunt, is preparing ingredients for a meal while Agent C, his cousin, shows interest in the cookbook. The scene is infused with the smell of baking bread and an imminent exploration of family history through an annotated recipe.",
    "actions": [
      {
        "description": "Agent A decides to ask Agent B about the history of the annotated recipe.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests preparing the dish scribbled in the cookbook margins together with Agents B and C.",
        "values": [
          0.6,
          0.6,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family dinner where they can all enjoy the recreated dish and share stories.",
        "values": [
          0.4,
          0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A takes out his phone to photograph the annotated page for future reference.",
        "values": [
          0.7,
          -0.1,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A starts to draft a list of needed ingredients that are missing from the pantry.",
        "values": [
          0.5,
          0.3,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a cook-off competition with Agent C, using recipes from the cookbook to see who can capture the essence of their great-grandmother’s cooking best.",
        "values": [
          0.7,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to share her favorite memory related to the cookbook or any popular family dish.",
        "values": [
          0.9,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a voice recorder to capture the conversation and stories sparked by the cookbook.",
        "values": [
          0.6,
          0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to document the experience of making the recipe from the cookbook, planning to create a blog post or social media content.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, notices Agent B setting up an unfamiliar board game. Offering to learn and play together, they exhibit excitement for the challenge and collaboration.",
    "actions": [
      {
        "description": "Agent A sits down with Agent B to examine the game components.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes searching online for the original game rules.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing a physical game to get the feel for it.",
        "values": [
          0.6,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A takes charge of writing down the new rules they invent.",
        "values": [
          0.5,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B swap stories while setting up the game.",
        "values": [
          0.3,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A recommends taking breaks to snack and stay hydrated.",
        "values": [
          0.1,
          -0.3,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A captures a photo of their improvised board game setup.",
        "values": [
          0.4,
          -0.2,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B for a friendly competition.",
        "values": [
          0.4,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A ensures game components are neatly organized.",
        "values": [
          -0.2,
          0.1,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager with a passion for cooking, is in the kitchen browsing a vintage cookbook, while Agent B, her father, is fixing a coffee machine and Agent C, her younger brother, is drawing rockets and planets.",
    "actions": [
      {
        "description": "Agent A decides to teach Agent C how to bake 'space cookies' by integrating his drawings into a cookie design.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a mini herb garden at the kitchen window to grow fresh ingredients for her recipes.",
        "values": [
          0.8,
          0.6,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests organizing a family 'cook-off' challenge for the weekend.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A carefully records the steps of her recipe in a personal cooking journal, along with illustrations.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A asks her father, Agent B, for advice on how to repair a small mechanical kitchen scale.",
        "values": [
          0.8,
          -0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to engage in conversation with Agent B about the history of his coffee machine and why it is important to him.",
        "values": [
          0.6,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invents a story about secret agents and a mysterious recipe, engaging Agent C in a playful 'top chef' spy game.",
        "values": [
          0.9,
          0.7,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A agrees to exchange roles with Agent B for a day to better understand the intricacies of machine repair.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the kitchen tools and ingredients to streamline the cooking process and possibly discover new pairings.",
        "values": [
          0.7,
          0.6,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a sunlight-filled living room, Agent A practices his guitar next to a bookshelf that houses an old photo album. Agent B is drawing intently on the floor, and Agent C is in the kitchen baking bread. The air is filled with music, the scent of bread, and an undercurrent of warmth and shared experiences.",
    "actions": [
      {
        "description": "Agent A peruses the photo album, looking to uncover family stories.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C about the photos, weaving a connection through a conversation about family history.",
        "values": [
          0.9,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A engages with Agent B's drawing, asking questions and creating a storytelling game.",
        "values": [
          0.7,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A selects music to set a creative atmosphere for everyone.",
        "values": [
          0.3,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A creates a unique musical piece inspired by the household sounds.",
        "values": [
          0.8,
          0.7,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A collaborates with Agent B on the drawing, suggesting they add a musical dimension to the artwork.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A stages a recreation of a vintage photo with Agent B.",
        "values": [
          0.9,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B practice some yoga together, mixing well-being with sibling bonding.",
        "values": [
          0.2,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A performs a correlating song from the photo album for his family.",
        "values": [
          0.6,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In an urban apartment, Agent A finds an unmarked box with old gadgets in the storage closet. Agent B is cooking in the kitchen, and Agent C is reading but observing the changing sky. Agent A examines the gadgets, fostering a shared interest with the family.",
    "actions": [
      {
        "description": "Agent A examines each item in the box, trying to deduce its use.",
        "values": [
          0.7,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to inspect the items and share thoughts.",
        "values": [
          0.9,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent B in a conversation about the items' past.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A looks up the items online to identify them.",
        "values": [
          1.0,
          0.1,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A displays the trinkets on a shelf in their room.",
        "values": [
          0.6,
          -0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A tests a hand-cranked device to see if it operates.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sketches the items, pondering their functions.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares photos of the items with friends for insights.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family \"museum night\" for the items.",
        "values": [
          0.6,
          -0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, is at home during the weekend with Agent B, their cousin, visiting for the weekend. Agent C, a parent, prepares breakfast in the kitchen as the teenagers explore, share, and bond in the living room filled with maps, encyclopedias, and games.",
    "actions": [
      {
        "description": "Agent A initiates a game of 'Secret Explorer' with Agent B.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B decide to cook an elaborate breakfast dish from a new country.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B create a handmade scrapbook.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A leads a stretching session with Agent B.",
        "values": [
          0.2,
          1.0,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal story with Agent B.",
        "values": [
          0.3,
          0.1,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests new ways to play board games.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B have a dance-off.",
        "values": [
          0.1,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to rearrange the furniture into a fort.",
        "values": [
          0.3,
          -0.6,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A observes Agent B experimenting with a new recipe, and Agent C is reading in the living room. The prospect of learning and participating in the cooking activity is presented.",
    "actions": [
      {
        "description": "Agent A assists Agent B in the kitchen and learns the recipe.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes documenting the cooking for a blog.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A tastes the dish to give feedback.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A adds a new spice to the recipe.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A looks up a side dish online.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A gathers fresh herbs from the garden.",
        "values": [
          0.6,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plans a surprise meal with Agent B for Agent C.",
        "values": [
          0.4,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A shares a laugh with Agent B after a humorous mistake.",
        "values": [
          0.3,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table meticulously.",
        "values": [
          0.3,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A finds a mysterious ancient cookbook in the apartment and is tempted to explore the exotic recipes within it. Agent B is reading, and Agent C is playing a VR game, but both show some interest in Agent A's discovery.",
    "actions": [
      {
        "description": "Agent A inspects the cookbook further to uncover any notes or marks made by a previous owner.",
        "values": [
          0.9,
          -0.2,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to Agent B and Agent C to test one of the recipes together as a group activity.",
        "values": [
          0.5,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A starts making a list of needed ingredients for an elaborate recipe.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A researches the origin of one fascinating dish from the cookbook online.",
        "values": [
          1.0,
          -0.4,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A decides to make a less intricate recipe with the ingredients already available.",
        "values": [
          -0.3,
          0.6,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A takes a quick break to stretch and do some light exercises before starting on the cooking project.",
        "values": [
          -0.5,
          0.8,
          0.0,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a space in the kitchen for a cooking vlog, preparing to document the culinary experience.",
        "values": [
          0.7,
          0.7,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares an interesting historical annotation from the cookbook with Agents B and C to gauge their interest.",
        "values": [
          0.8,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A plans an international theme dinner for friends using the cookbook as inspiration, possibly involving Agents B and C.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is preparing a new recipe in the kitchen when Agent C arrives after a run, proposing an unplanned family dinner. Agent B is playing the guitar in the living room. The stage is set for a warm and collaborative evening.",
    "actions": [
      {
        "description": "Agent A discusses recipe ideas with Agent C for the family dinner.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A begins prepping the ingredients.",
        "values": [
          0.4,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to contribute a playlist.",
        "values": [
          0.5,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to teach Agent C a new cooking technique.",
        "values": [
          0.8,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to chat with Agent C.",
        "values": [
          0.3,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a table outside.",
        "values": [
          0.2,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with an unfamiliar spice blend.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C bake a surprise dessert.",
        "values": [
          0.6,
          0.7,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests making dinner preparation a fun challenge.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college-aged individual, has recently moved in with roommates Agent B and Agent C. In their shared apartment, Agent A notices a collection of exotic cooking spices and cookbooks, along with Agent C's exotic herbs. Agent A feels enticed by the culinary possibilities.",
    "actions": [
      {
        "description": "Agent A asks Agent B to teach them how to use one of the exotic spices in a recipe.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A offers to prepare a meal using Agent B’s cookbooks and spices, inviting Agent C to join.",
        "values": [
          0.6,
          0.7,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A picks one of Agent C’s herbs, with permission, to use in a new recipe.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B plan a weekly cooking night to explore different recipes together.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a dinner party with B and C where they can all cook and share experiences.",
        "values": [
          0.4,
          0.6,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A creates a shared album of photos of their cooking adventures and dishes.",
        "values": [
          0.5,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes time to read through the cookbooks to learn more about the cuisine.",
        "values": [
          1.0,
          0.2,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests starting a blog to document their culinary exploits with Agents B and C.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the herbs on the windowsill to give each plant adequate sunlight.",
        "values": [
          0.2,
          0.5,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a teen who has discovered an interest in gardening in their sunlit backyard's neglected flower bed. Agent B, their sibling, works on a kite nearby, while Agent C, their parent, prepares a meal inside. Agent A decides to revive the garden and begins by clearing the bed, seeking information on the existing plants, and planning the revitalization of the garden.",
    "actions": [
      {
        "description": "Agent A starts clearing away the weeds and debris from the flower bed.",
        "values": [
          0.6,
          -0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A takes out a book on local flora from their collection to identify the existing plants.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A creates a detailed plan for revitalizing the garden, noting which plants to add.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A talks to Agent C to ask for permission and budget to purchase new gardening tools and plants.",
        "values": [
          0.3,
          -0.4,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join in the gardening efforts, offering part of the flower bed for design.",
        "values": [
          0.4,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a rainwater harvesting system to water the plants sustainably.",
        "values": [
          0.5,
          0.7,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A uses their phone to research the best flowers to attract butterflies and bees.",
        "values": [
          1.0,
          0.1,
          0.0,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A prepares homemade organic fertilizer from kitchen scraps.",
        "values": [
          0.6,
          0.8,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A documents the progress of their garden project with photos.",
        "values": [
          0.4,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, decisive and full of anticipation, scans the kitchen shelves. Agent B observes, eager to be part of the culinary dance. Agent C, engaged with distant adventures through reading, remains part of the familial fabric with their proximity.",
    "actions": [
      {
        "description": "Agent A invites Agent B to collaborate on creating a new breakfast dish.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A instigates a creative sandwich challenge with Agent C.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a themed meal preparation linked to a travel destination.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A orchestrates a blind taste test for culinary creations with Agents B and C.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shares cooking insights with Agent B in an impromptu lesson.",
        "values": [
          0.7,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A transforms kitchen clean-up into a playful contest.",
        "values": [
          -0.3,
          0.9,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A establishes a makeshift photo booth to document their cooking session.",
        "values": [
          0.4,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A assembles a scrapbook page to preserve the day's memories.",
        "values": [
          0.5,
          -0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with new drink recipes to delight Agents B and C.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a recent college graduate, has moved back home and is surrounded by boxes in her old bedroom. Her parents, Agents B and C, engage in their own nurturing activities in the kitchen and garden, respectively.",
    "actions": [
      {
        "description": "Agent A decides to unpack her boxes and arrange her room, discovering old journals and shared memorabilia from her childhood and college years.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a family game night to reconnect and create new memories with her parents after dinner.",
        "values": [
          0.3,
          -0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A assists her father in the kitchen by helping him prepare the meal, learning his recipes, and exchanging stories.",
        "values": [
          0.4,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A joins her mother in the garden and offers to plant new flowers, taking the opportunity to spend quality time together.",
        "values": [
          0.5,
          -0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A explores the attic to see if there are any more belongings she should retrieve or reminisce over old family items.",
        "values": [
          0.9,
          -0.2,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a study corner in her room where she can start planning for her future endeavors and career moves.",
        "values": [
          0.6,
          0.1,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to digitize old family photo albums to preserve them and explore her family's history.",
        "values": [
          0.7,
          -0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A volunteers to organize a family outing to a new exhibition in the local museum for the upcoming weekend.",
        "values": [
          0.6,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts creating a personalized cookbook by compiling family recipes, including the meal her father is cooking.",
        "values": [
          0.4,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager with a passion for culinary experiments, is in the kitchen on a bright Saturday morning. Agent B, Agent A's cousin, is visiting. Agent C, Agent A's sibling, is enjoying coffee and a book. Agent A is poised to explore untried recipes with the others.",
    "actions": [
      {
        "description": "Agent A decides to attempt a recipe from one of the new books, asking Agent B to join as an assistant.",
        "values": [
          0.9,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A organizes all the necessary ingredients on the counter in preparation for the cooking process.",
        "values": [
          0.3,
          0.7,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a small competition with Agent B to see who can create the most inventive dish using the same set of ingredients.",
        "values": [
          0.8,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes the initiative to teach Agent B a challenging cooking technique found in the recipe book.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to provide feedback on the dishes as a taste tester, engaging in a lively discussion about the flavors.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A records the cooking process to review it later and improve the cooking skills.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A spends time decorating the dish thoughtfully to present it in an aesthetically pleasing way.",
        "values": [
          0.5,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to prepare two variations of the same dish to understand the impact of different spices.",
        "values": [
          0.9,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A decides to clean the kitchen meticulously after cooking, turning it into a challenge by setting a timer.",
        "values": [
          0.2,
          0.8,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult, is in the kitchen with Agent B, their roommate, and Agent C, a close friend visiting for the weekend. Agent A is intrigued by a basket of exotic fruits that Agent B bought, and together they decide to make a fruit salad, involving Agent C in the activity.",
    "actions": [
      {
        "description": "Agent A decides to wash and peel the exotic fruits for the salad, asking Agent B for guidance on the best way to handle them.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B that they should look up recipes or traditional uses of the fruits to make the salad more authentic.",
        "values": [
          0.9,
          0.1,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A takes a small piece of each fruit to taste before adding it to the bowl, describing the flavors to Agent B and Agent C.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A searches online for trivia about each fruit's origin and shares the findings with Agent B and Agent C as they work.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the fruit and the process of making the salad to share on their social media.",
        "values": [
          0.4,
          0.6,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to join in a game of guessing the names of the fruits based on their appearance and taste.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to document their fruit salad-making experience in a journal for future reference.",
        "values": [
          0.6,
          -0.1,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to mix the salad while telling a humorous story to create a light-hearted atmosphere.",
        "values": [
          0.2,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A, after the salad is made, arranges a tasting segment where they all try the salad blindfolded and try to identify the fruits by taste.",
        "values": [
          0.5,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home, Agent A is in the kitchen preparing a meal with Agent B and Agent C, fostering camaraderie among them.",
    "actions": [
      {
        "description": "Agent A decides to teach Agent C how to mix spices for a recipe.",
        "values": [
          0.7,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A creates a game to guess ingredients in a dish by taste with Agents B and C.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to cook a family recipe together, sharing stories.",
        "values": [
          0.4,
          0.1,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A looks up a challenging and exotic recipe online to cook with Agent C.",
        "values": [
          1.0,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a taste-test competition with dishes for Agents B and C.",
        "values": [
          0.6,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a video call with a distant family member for cooking advice.",
        "values": [
          0.5,
          -0.4,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A playfully tosses a piece of vegetable for Agent C to catch in their mouth.",
        "values": [
          0.2,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A personally serves the prepared meal to Agent B and Agent C.",
        "values": [
          0.3,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen spontaneously with music.",
        "values": [
          -0.1,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy, sunlit kitchen, Agent A, a teenager with a love for cooking, eagerly ponders over an assortment of exotic ingredients laid out on the countertop. Agent B, a cousin visiting for the weekend, lounges at the kitchen table with a travel magazine. Agent C, a younger sibling, fidgets with a new puzzle, occasionally glancing over at the kitchen activities.",
    "actions": [
      {
        "description": "Agent A decides to prepare a dish from the travel magazine that Agent B is reading, asking for input and making it into a collaborative experience.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to teach Agent C how to properly cut vegetables, fostering a learning environment.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a competitive cook-off between themselves and Agent B, turning the kitchen into a lively battleground of culinary skills.",
        "values": [
          0.5,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes a snapshot of the current cooking progress and shares it on social media, reaching out to friends for tips and ideas.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to taste test the dish at different stages of preparation, seeking feedback and adjusting the recipe accordingly.",
        "values": [
          0.6,
          0.6,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A starts a spontaneous food presentation contest, inviting Agent B and Agent C to participate and style their plates creatively.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to create a \"family cookbook\" that includes everyone's favorite recipes and involves Agents B and C in the process.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A creates a shared music playlist for the kitchen, encouraging Agent B and Agent C to contribute songs and dance along while cooking.",
        "values": [
          0.4,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A challenges themselves to use all the exotic ingredients in an inventive way without referencing any recipe, relying on instinct.",
        "values": [
          0.9,
          0.6,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a home chef, is exploring exotic spices in the kitchen while Agent B relaxes and Agent C enters. The setting is ripe for innovation with fresh ingredients and the presence of family.",
    "actions": [
      {
        "description": "Agent A enthusiastically explains the origin of each new spice to Agents B and C.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to combine several unfamiliar spices to create a new flavor profile for a dish.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help grind the spices, turning it into a mini lesson about cooking.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A carefully records the amounts and combinations of spices used, creating a makeshift recipe journal.",
        "values": [
          0.6,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A, in a playful mood, challenges Agent B to identify the spices based on scent alone.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a taste-testing game for the family with dishes using the new spices to gauge their reactions.",
        "values": [
          0.8,
          0.6,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A thoughtfully composes a dish that incorporates a childhood recipe of Agent B's, blending the past with the present.",
        "values": [
          0.2,
          0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to select a spice and devise a dish together, fostering collaboration.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to breathe deeply, appreciating the mixture of spices and the family atmosphere.",
        "values": [
          0.1,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, finds an old, dust-covered scrapbook in the attic of the family home. Agent B, Agent A's cousin, is rummaging through old costumes and Agent C is poring over boxes of photographs. The agents are engrossed in their exploration in the nostalgia-filled attic.",
    "actions": [
      {
        "description": "Agent A carefully opens the scrapbook to reveal its content, careful not to tear the delicate pages.",
        "values": [
          0.7,
          -0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C about the people in the photographs found in the scrapbook.",
        "values": [
          0.9,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A hands over some interesting finds from the scrapbook to Agent B to see.",
        "values": [
          0.4,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A uses their phone to look up historical events mentioned in the scrapbook entries.",
        "values": [
          1.0,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that they should add their own current photos and notes to the scrapbook, continuing its legacy.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A scans some of the scrapbook's contents to create digital copies for safekeeping.",
        "values": [
          0.8,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take the scrapbook downstairs to go through it with Agent B more comfortably.",
        "values": [
          0.3,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A goes to the kitchen to prepare snacks for everyone, so they can continue their exploration without interruption.",
        "values": [
          0.1,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to help in creating a family tree based on the discoveries from the scrapbook.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult, is in a serene living room on a Sunday morning, surrounded by books and music instruments, while Agents B and C engage in cooking and gardening respectively.",
    "actions": [
      {
        "description": "Agent A helps make pizzas using fresh herbs.",
        "values": [
          0.7,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares plant facts with Agent B.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A plays guitar and sings with Agent B.",
        "values": [
          0.3,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests rearranging the living room.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plays a creative game with Agents B and C.",
        "values": [
          0.4,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A looks up plant care information.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a taste test of baked bread.",
        "values": [
          0.3,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A creates a pizza topping challenge.",
        "values": [
          0.5,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A takes a group photo.",
        "values": [
          0.2,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are siblings having dinner with a sense of togetherness. Agent A is intrigued by Agent B's discussion of a new book and suggests they do something together afterwards.",
    "actions": [
      {
        "description": "Agent A asks Agent B more about the book's theme and plots, expressing a wish to read it together.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to a board game they used to play as kids to relive fond memories.",
        "values": [
          0.3,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old photo album and starts reminiscing with Agent B about past family holidays.",
        "values": [
          0.4,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join them in assisting Agent C with the garden, discussing plants and garden layouts.",
        "values": [
          0.6,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a spontaneous indoor camping night in the living room, setting up a tent and telling stories.",
        "values": [
          0.5,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B plan a creative cooking challenge with leftovers to create a new dish, enhancing their evening.",
        "values": [
          0.6,
          0.8,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A decides to start a DIY project and asks Agent B for help in painting an old piece of furniture.",
        "values": [
          0.6,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests they draw portraits of each other for fun, capturing the moment in an artistic way.",
        "values": [
          0.4,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A dares Agent B to a dance-off just for the laughs, picking out upbeat music to boost their spirits.",
        "values": [
          0.1,
          0.9,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a teenager who came home to an empty house. In the kitchen, he finds exotic fruits and with great interest examines their textures. He sets up a comfortable reading area by the window and finds a script for a play. He reads a few lines and imagines rehearsing it with his sibling.",
    "actions": [
      {
        "description": "Agent A inspects the exotic fruits, researching their origins and culinary uses.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A tastes the new fruits to share his experience with family later.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "After exercising, Agent A records his performance for analysis and improvement.",
        "values": [
          -0.4,
          0.9,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a cozy reading spot with pillows and blankets.",
        "values": [
          0.2,
          -0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A reads the play script, getting absorbed in the characters and story.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A practices lines from the play, imagining performing with Agent B.",
        "values": [
          0.4,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the new play and its themes with a friend via video call.",
        "values": [
          0.9,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A prepares beverages and anticipates sharing them with Agent B.",
        "values": [
          -0.3,
          -0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A drafts a review of the play to share with Agent B.",
        "values": [
          1.0,
          -0.5,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Inside a cozy kitchen, Agent A is experimenting with a new recipe. Agent B is at the kitchen table with schoolwork and Agent C is on the sofa, interested in a travel magazine. Agent A is focused on cooking while including Agent B and Agent C in the experience.",
    "actions": [
      {
        "description": "Agent A offers a taste of the experimental dish to Agent B, seeking input on the flavor.",
        "values": [
          0.4,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to the kitchen to select a recipe from the travel magazine that they can attempt next.",
        "values": [
          0.7,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent B about different cuisines and their cultural significance.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to rearrange the kitchen to create a more efficient cooking space.",
        "values": [
          0.5,
          0.6,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A gathers Agent B and Agent C to plan a weekend cooking class at home.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A records the alterations to the recipe for future reference.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to let fresh air into the kitchen.",
        "values": [
          0.1,
          0.5,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to Agent B a puzzle-solving game about ingredient heritage.",
        "values": [
          0.9,
          -0.4,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the pantry, discarding old and restocking with fresh spices.",
        "values": [
          0.3,
          0.7,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In the living room, Agent A engages in crafting a scrapbook, Agent B practices guitar, and Agent C works on a puzzle. Agent A leads enriching interactions involving family creativity and shared experiences.",
    "actions": [
      {
        "description": "Agent A creates a themed scrapbook, recalling family memories.",
        "values": [
          0.9,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A collaborates with Agent B on a song for the scrapbook.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares a heartfelt memory with Agent B and Agent C.",
        "values": [
          0.5,
          0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A incorporates Agent C's artistic contribution in the scrapbook.",
        "values": [
          0.8,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A learns guitar from Agent B, showing mutual appreciation.",
        "values": [
          -0.4,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A makes a refreshing drink for all, taking a break from activities.",
        "values": [
          0.2,
          -0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes an 'idea walk' to inspire their projects.",
        "values": [
          0.7,
          0.8,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A uses puzzle pieces in the scrapbook, celebrating Agent C's efforts.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts an impromptu storytelling game, creating a joint narrative.",
        "values": [
          0.9,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a warm living room, Agent A is deeply engrossed in a book about ancient civilizations while Agent B sketches the scene. The atmosphere is filled with the scent of old books and the soft sound of a record player.",
    "actions": [
      {
        "description": "Agent A sets down her book and initiates a conversation with Agent B about the historical theories she’s been reading.",
        "values": [
          0.9,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A picks up a book from a shelf that she notices Agent B has been eyeing and offers to read it together.",
        "values": [
          0.8,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Feeling the need to stretch, Agent A invites Agent B to partake in a quick yoga routine to re-energize.",
        "values": [
          -0.5,
          1.0,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes they switch creative mediums briefly; she tries sketching while Agent B reads.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Discovering a puzzle game on the shelf, Agent A challenges Agent B to see who can solve it faster.",
        "values": [
          -0.3,
          0.6,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares an intriguing fact from her book, then finds more materials to explore the subject with Agent B.",
        "values": [
          1.0,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a light snack for both, using it as an opportunity to bond over cooking.",
        "values": [
          -0.6,
          0.8,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A observes Agent B's drawing technique, asking questions and showing interest in his process.",
        "values": [
          0.6,
          -0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to rearrange the room slightly for a change of scenery, asking Agent B’s opinion.",
        "values": [
          0.3,
          -0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a graduate student with a passion for gardening, resides in a home with a rich backyard, along with Agent B, his cousin, and Agent C, a childhood friend. A day spent within this environment presents opportunities for stimulating intellectual engagement and bonding through various shared activities.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to participate in potting a new plant, explaining its unique traits.",
        "values": [
          0.8,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out recipe books to create a new dish utilizing garden herbs.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A provides a hint to a puzzle box solution for Agent B to solve it himself.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories while giving Agent B a backyard garden tour.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests reminiscing over old family photo albums.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to a cooking competition using a secret ingredient.",
        "values": [
          0.6,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A, B, and C work together in preparing a meal.",
        "values": [
          0.4,
          0.8,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a charades game on mystery movies.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A conducts a mini workshop on making homemade organic fertilizers.",
        "values": [
          0.9,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In the family kitchen, Agent A, while seated on the countertop, discovers an intriguing recipe book and considers trying an unfamiliar dish. Agent B sketches quietly, and Agent C is immersed in caring for plants. The atmosphere is one where each is involved in personal pursuits yet is open to collaborative experiences.",
    "actions": [
      {
        "description": "Agent A steps down from the countertop to inspect the new recipe book more closely, flipping through the pages with excitement.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A decides to gather ingredients, some unfamiliar, following an intriguing recipe from the book to prepare a surprise lunch.",
        "values": [
          0.6,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent B in a conversation, excitedly proposing a collaborative art project incorporating elements from the garden.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to share gardening pointers while casually inquiring about the elder’s past experiences with different plants.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the kitchen space for more efficient movement, energized by the prospect of transforming the environment.",
        "values": [
          0.2,
          0.9,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break from cooking to play a lively tune on a nearby guitar, adding a rhythmic backdrop to the morning.",
        "values": [
          0.3,
          1.0,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A conducts an impromptu taste-testing session with Agents B and C, sharing samples and seeking their input.",
        "values": [
          0.5,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates a makeshift game from kitchen items, initiating a light-hearted competition with Agents B and C.",
        "values": [
          0.4,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A documents the cooking process with short video clips, envisioning sharing them with friends to recount the day’s adventures.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, finds an old sign in their garden and with the neighbor Agent B's insight and Agent C's involvement, decides to explore its history and plan for a new garden.",
    "actions": [
      {
        "description": "Agent A carefully excavates the rusted sign from the ground, trying to preserve it as much as possible.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "After gently cleaning the sign, Agent A invites Agent B to inspect the sign and share any insights.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent C by asking them to fetch some tools and protective gloves.",
        "values": [
          0.2,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take a picture of the sign and post it on a gardening forum.",
        "values": [
          0.9,
          0.1,
          0.0,
          0.0,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A plans a trip to the local library with Agent C to research the neighborhood history.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A collaborates with Agent B to draft a layout for a new garden.",
        "values": [
          0.6,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Feeling energized by the discovery, Agent A starts clearing the weeds and debris.",
        "values": [
          0.1,
          0.9,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A hosts a small garden planning party for Agents B and C.",
        "values": [
          0.4,
          0.7,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A creates a makeshift table in the yard and shares cookies with Agents B and C.",
        "values": [
          0.3,
          0.4,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A finds an old photo album, sparking a desire to learn more and create new memories. Agent B is engaged in experimental cooking, and Agent C tends to houseplants. A sense of familial bonding and creative expression permeates the home.",
    "actions": [
      {
        "description": "Agent A sets up their camera on a tripod to take a time-lapse video of the changing afternoon light in the living room.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A joins Agent B in the kitchen, capturing the cooking process and adding their unique twist to the recipe.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C about the history of certain photographs, leading to a nostalgic storytelling session.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a spontaneous photo session with Agent B and Agent C, styling the scenes to mimic the aesthetic of the photos in the album.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates a dedicated space in the album for new photographs alongside the old ones.",
        "values": [
          0.4,
          -0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A takes macro shots of the blooming flower in the sunroom to document the rare event.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a small project to digitize the old photos and make a digital photo album.",
        "values": [
          0.9,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests creating a new family tradition, where everyone contributes to the photo album once a month.",
        "values": [
          0.5,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A conducts an impromptu interview with Agent B and Agent C, capturing their thoughts and feelings about the day.",
        "values": [
          0.7,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In the family living room, Agent A finds an old chest that piques interest. Agent B is engaged in a novel while Agent C is cooking nearby. The chest, laden with historical significance, presents an opportunity for A to explore and bond with B and C.",
    "actions": [
      {
        "description": "Agent A opens the chest to discover its contents.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to look inside the chest together.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A draws a map imagining where the chest's items originated.",
        "values": [
          1.0,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes building a family tree with chest items' stories.",
        "values": [
          0.8,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A consults Agent C about items' past.",
        "values": [
          0.6,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A uses the kitchen to arrange the chest's findings.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agents A and B perform a play with the found items.",
        "values": [
          0.4,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to join exploring the chest.",
        "values": [
          0.7,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A photographs the items to study later.",
        "values": [
          1.0,
          0.3,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home, Agent A is bustling around the kitchen, preparing a unique breakfast dish. Agent B, their sibling, joins them, attracted by the aroma. Agent C, a family friend visiting, is absorbed in a book about foreign cultures in the living room. They all share a warm interaction in the kitchen.",
    "actions": [
      {
        "description": "Agent A introduces Agent B and Agent C to a traditional dance.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a collaborative cooking session.",
        "values": [
          0.7,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a friendly culinary competition.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a language learning game.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plans a cultural-themed dinner.",
        "values": [
          0.75,
          0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A picks an unfamiliar board game to play.",
        "values": [
          0.85,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a hike to a nature reserve.",
        "values": [
          0.9,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts a photography contest at home.",
        "values": [
          0.65,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A collaborates on crafting a scrapbook.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B, siblings, spend a leisurely Sunday in their living room filled with art supplies and a science magazine. Agent C, their parent, is baking in the kitchen. The atmosphere is warm and cozy, with family interaction and engagement.",
    "actions": [
      {
        "description": "Agent A offers to paint a portrait of Agent B while they read.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to construct an art piece from recycled materials.",
        "values": [
          0.8,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A starts a family trivia game about exotic places and famous artists.",
        "values": [
          1.0,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A convinces Agent B to bake a dessert with Agent C in a fun adventure.",
        "values": [
          0.6,
          0.7,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B spot constellations on the balcony.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes an impromptu talent show for the family.",
        "values": [
          0.7,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A, B, and C have an indoor picnic, sharing daring dreams.",
        "values": [
          0.5,
          0.5,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A and B conduct a DIY science experiment.",
        "values": [
          1.0,
          0.8,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to a painting duel.",
        "values": [
          0.7,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a recent literature graduate who loves cooking, decides to make an intricate dinner for their roommate, Agent B, as a way to celebrate their recent promotion. Agent C, Agent A's childhood friend, joins via video call, eager to participate.",
    "actions": [
      {
        "description": "Agent A enthusiastically suggests trying a new exotic recipe from the cookbook.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A meticulously sets up all the ingredients in small bowls to create an organized workspace.",
        "values": [
          0.3,
          0.7,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent B in a conversation about Agent B's promotion while prepping the ingredients.",
        "values": [
          0.5,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to document the cooking process with photos to share later with Agent C.",
        "values": [
          0.4,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to taste a new spice mix, explaining its origin and uses.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to create a handmade card for Agent B, detailing their appreciation of their friendship.",
        "values": [
          -0.1,
          0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A integrates a secret ingredient into the recipe, a touch that they know Agent B will appreciate.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A gathers everyone to share old memories and reminisces about past shared meals.",
        "values": [
          0.2,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A carefully adjusts the dinner presentation, knowing that Agent B admires culinary aesthetics.",
        "values": [
          0.3,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student, is at her family home for the weekend and finds her mother, Agent B, preparing a family recipe while her father, Agent C, is repairing a bike. Amidst a homely atmosphere, Agent A discovers an old cookbook and feels drawn to the family's culinary traditions.",
    "actions": [
      {
        "description": "Agent A decides to assist Agent B in the kitchen, attempting to prepare a dish from the cookbook.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent C about his bike repair project and offers to help.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A takes the cookbook and plans a surprise family dinner for a later date.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A starts an impromptu baking challenge with Agent B, each choosing a new recipe from the cookbook.",
        "values": [
          0.8,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A investigates the herbs growing on the kitchen windowsill, trying to identify them and asking Agent B about their uses.",
        "values": [
          0.9,
          0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family activity to cook together using the cookbook's recipes for bonding.",
        "values": [
          0.4,
          0.3,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A uses her phone to document the recipe steps as Agent B prepares the dish, considering compiling them into a family recipe blog.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a picnic in the garden for the family after helping Agent C to complete the bike repair.",
        "values": [
          0.2,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A persuades her parents to share stories of past family gatherings centered around food preparation.",
        "values": [
          0.3,
          -0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is prepping a family photo album with Agent B working on a bookshelf and Agent C unpacking vintage items while the family dog, Agent D, naps nearby.",
    "actions": [
      {
        "description": "Agent A creates a family history section in the photo album.",
        "values": [
          0.9,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with bookshelf assembly and redesigns the living room.",
        "values": [
          0.7,
          0.6,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C about the origin of vintage magazines.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family music session with old records.",
        "values": [
          0.6,
          0.7,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites personal story contributions to the photo album.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family game night.",
        "values": [
          0.4,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes Agent D for a walk to join family time.",
        "values": [
          0.5,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A starts a repurposing DIY project for home decor.",
        "values": [
          0.8,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up an indoor herb garden.",
        "values": [
          0.6,
          0.7,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a university student, has returned home and found their sibling Agent B composing a song. The house is filled with indicators of exploration and hobbies. Agent A shows an inclination towards learning and sharing experiences.",
    "actions": [
      {
        "description": "Agent A picks up a book from the shelf that they haven't noticed before and starts reading about foreign cultures.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent B to understand their songwriting process and offers ideas for lyrics from their own travels.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A begins to organize the scattered notes on the coffee table, correlating them with locations on the world map.",
        "values": [
          0.9,
          0.5,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B tune the guitar strings and learns the basics of playing a melody.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A opens a drawer and finds an old photo album, then sits with Agent B to reminisce about past family vacations.",
        "values": [
          -0.1,
          -0.4,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to create a small indoor garden and starts gathering the necessary supplies from around the house.",
        "values": [
          0.5,
          0.7,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A crafts a handmade bookmark for Agent B using materials from their art supplies.",
        "values": [
          0.2,
          -0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to a fun quiz on world capitals using the map and notes.",
        "values": [
          0.9,
          0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A prepares two cups of coffee and invites Agent B to take a break and enjoy a casual chat.",
        "values": [
          -0.2,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a young parent, arrives home and along with Agent B, the spouse, and Agent C, their toddler, engages in the activity of opening and exploring a new toy as a family bonding event.",
    "actions": [
      {
        "description": "Agent A reads the instruction manual of the new toy.",
        "values": [
          0.5,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests building the toy as a team.",
        "values": [
          0.4,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to guess what the toy can do.",
        "values": [
          0.8,
          0.1,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B turn toy building into an educational game.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A incorporates household items into playset.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a snack.",
        "values": [
          -0.3,
          0.6,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent C with creative toy uses.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A creates a competition in assembly.",
        "values": [
          0.3,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A explores a toy feature with Agent C.",
        "values": [
          0.7,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is organizing tools for a treehouse building project, with Agent B showing a willingness to participate, while Agent C is in the kitchen preparing brunch.",
    "actions": [
      {
        "description": "Agent A allows Agent B to select the color for the treehouse.",
        "values": [
          0.7,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A creates a simple blueprint of the treehouse with Agent B.",
        "values": [
          1.0,
          -0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B how to use a screwdriver.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A competes with Agent B in gathering tools.",
        "values": [
          0.3,
          0.8,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to suggest an addition to the treehouse.",
        "values": [
          0.9,
          -0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B plant flowers around the treehouse.",
        "values": [
          0.5,
          -0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A has a picnic with Agent B and Agent C.",
        "values": [
          0.2,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B set up a birdhouse to watch wildlife.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a scavenger hunt for Agent B.",
        "values": [
          1.0,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a home environment, Agent A is experimenting with cooking using a variety of new and unfamiliar ingredients. Agent B watches and offers advice, while Agent C looks up recipes. They are exchanging knowledge and ideas, creating a dish together, and the atmosphere is warm and collaborative.",
    "actions": [
      {
        "description": "Agent A decides to start a cooking vlog.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A tastes and adjusts the spices without consulting the recipe.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside a portion of the meal to share with a neighbor.",
        "values": [
          -0.4,
          -0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent B in a challenge to create the perfect garnish.",
        "values": [
          0.8,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A decides to repurpose leftovers into a new dish.",
        "values": [
          0.6,
          -0.3,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A convinces everyone to dance while the food simmers.",
        "values": [
          -0.1,
          0.9,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes they team up to prepare a surprise meal for Agent C.",
        "values": [
          0.4,
          0.6,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a blind taste test of the spices.",
        "values": [
          1.0,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a weekly cooking challenge with new ingredients.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a home chef and food blogger who lives with their roommate, Agent B. Agent A experiments with a new recipe in the kitchen, while Agent B reads a novel. Agent C, an old friend, visits with an antique cookbook.",
    "actions": [
      {
        "description": "Agent A invites Agent C into the kitchen to discuss the old recipes from the cookbook.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes pictures of the dishes and unique recipes to include in their blog.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          -0.4,
          0.0
        ]
      },
      {
        "description": "Agent A clears the dining table to set up a tasting station for everyone.",
        "values": [
          0.5,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out ingredients and suggests creating a new recipe together.",
        "values": [
          0.9,
          0.7,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to play music and dance during the cooking session.",
        "values": [
          -0.2,
          0.8,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets up for a group photo.",
        "values": [
          -0.3,
          0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agents A, B, and C share personal experiences.",
        "values": [
          0.6,
          -0.5,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A tastes and provides feedback on Agent C's dish.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A video calls an expert friend for advice on the cuisine.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student with a deep interest in botany, involves roommates Agent B and C in the process of propagating exotic plant cuttings in their shared living space.",
    "actions": [
      {
        "description": "Agent A carefully researches the needs of each exotic plant cutting to ensure a successful propagation.",
        "values": [
          0.8,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the living room furniture to make room for a new plant shelf.",
        "values": [
          0.7,
          -0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agents B and C in deciding on the right spot for each new plant.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to participate in the planting process, turning it into a shared activity.",
        "values": [
          0.5,
          0.5,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A offers some of the future plants to Agent B and C as gifts once they grow.",
        "values": [
          0.6,
          0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to set up a schedule for watering and caring for the plants, distributing responsibilities among the roommates.",
        "values": [
          0.4,
          0.5,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A starts a project to build a small indoor greenhouse with the help of Agents B and C.",
        "values": [
          0.9,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A designs a layout for a future balcony garden that Agents B and C can contribute to.",
        "values": [
          0.8,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A brings back stories from the field trip to share with Agents B and C, connecting the cuttings to the experiences had while acquiring them.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A finds an old cookbook and, inspired, proposes a group cooking adventure to roommates Agent B and C.",
    "actions": [
      {
        "description": "Agent A proposes to create a dish from the cookbook, enlisting Agent B and C's help for a fun and collaborative cooking session.",
        "values": [
          0.9,
          0.7,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the ingredients on the kitchen counter, examining which ones can be combined to create the chosen recipe.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "While cooking, Agent A shares personal anecdotes related to food with Agent B and C, fostering a relaxed environment.",
        "values": [
          0.4,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A carefully documents the cooking process with a smartphone, hoping to review and improve future culinary attempts.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "After dining, Agent A salvages leftover ingredients, considering ways to utilize them creatively the next day.",
        "values": [
          0.5,
          -0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and C to taste test during cooking, seeking their input to refine the recipe.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a lighthearted competition with Agent B and C to see who plates their serving most artistically.",
        "values": [
          0.4,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Once the dish is completed, Agent A encourages a shared meal at the table, rather than individual portions.",
        "values": [
          0.2,
          0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "After eating, Agent A opts to clean the kitchen alone, allowing Agent B and C to continue relaxing.",
        "values": [
          -0.2,
          -0.5,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home, Agent A finds an unopened letter with a foreign stamp in the study, while Agent B cooks downstairs and Agent C flips through photo albums in the living room.",
    "actions": [
      {
        "description": "Agent A opens the mysterious letter with the foreign stamp, intrigued by its origin.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "After reading the contents, Agent A locates a map to pinpoint the letter's origin.",
        "values": [
          1.0,
          -0.1,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A calls down to Agent B and Agent C to come upstairs and share the discovery of the letter.",
        "values": [
          0.7,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agents B and C that they plan a themed dinner around the country from the letter's origin.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A begins to compile a list of questions they have about the letter writer's country and culture.",
        "values": [
          0.9,
          -0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to create a scrapbook page dedicated to this newfound piece of history.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "On a whim, Agent A starts drafting a response to the sender of the letter.",
        "values": [
          0.9,
          -0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A rummages through the house to find a suitable souvenir to send back to the letter's author.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A plans a fun quiz game for Agents B and C about the new country they're learning about.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a culinary enthusiast, is in the kitchen with a recipe book trying a complex dish, while Agent B reads nearby and Agent C tends to the herbs. They share a close and collaborative atmosphere.",
    "actions": [
      {
        "description": "Agent A decides to prepare the complex dish from the recipe book, using the herbs that Agent C brought over.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to join him in the cooking process as a way to learn more about the dish’s origin.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets up his smartphone to record a video of the cooking process for future reference.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a small cooking competition with Agent B and Agent C to see who can add the most innovative twist to the recipe.",
        "values": [
          0.6,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories about his grandmother with Agent B and Agent C while they cook, explaining the significance of the dish.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A carefully tastes each step of the dish, adjusting his techniques and noting the differences.",
        "values": [
          0.9,
          0.7,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A, after finishing the dish, invites his neighbors to join them for dinner, extending the shared experience beyond their household.",
        "values": [
          0.4,
          0.5,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that they start a recipe exchange diary where they can document and share their own variations of recipes.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the dinner table to present the dish in the most appealing way.",
        "values": [
          0.2,
          0.4,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, after school, observes various household activities: his mother's painting, his grandfather assembling a radio, and his sister baking cookies.",
    "actions": [
      {
        "description": "Agent A picks up a book on impressionist paintings to understand his mother's painting technique.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A helps his grandfather with the radio, inquiring how the parts work.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A tastes and critiques his sister's cookies, suggesting recipe tweaks.",
        "values": [
          0.4,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A draws his grandfather assembling the radio.",
        "values": [
          0.6,
          0.6,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A assists in gardening and discusses plants with his mother.",
        "values": [
          0.5,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a blind taste test for the family's cookies.",
        "values": [
          0.4,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A co-writes a blog post with his sister on their baking.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A records an interview with his grandfather for school.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a family art exhibit with his mother's work.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, an enthusiastic home chef, is preparing a new complex recipe for weekend brunch. Agent B, Agent A's partner, joins to help in the kitchen amid laughter and shared stories. Agent C, a close friend and visitor, engages by asking about the recipe and observing the process. The kitchen is filled with morning sunlight and the aroma of the garden.",
    "actions": [
      {
        "description": "Agent A involves Agent B in the cooking process, offering guidance.",
        "values": [
          0.7,
          -0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A explains the cultural significance of the recipe to Agent C.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A personalizes the dish presentation for Agent B.",
        "values": [
          0.4,
          -0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to taste and give feedback on the dish.",
        "values": [
          0.6,
          -0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests experimenting with an unconventional ingredient.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a brainstorm for future menus.",
        "values": [
          0.8,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes enjoying brunch in the garden.",
        "values": [
          0.3,
          -0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A notes feedback to improve the dish.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a tasting station for flavor experimentation.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A finds an old book on exotic plants in the attic and proposes creating a new section in the garden alongside his cousin Agent B and invites their grandmother Agent C, an avid gardener, to join.",
    "actions": [
      {
        "description": "Agent A dusts off the book and studies the content to identify plants for the garden.",
        "values": [
          0.7,
          -0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A drafts a layout plan for the garden on paper.",
        "values": [
          0.6,
          -0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes going to the nursery to find plants.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shows Agent B how to prepare soil for planting.",
        "values": [
          0.4,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B plant the seeds together.",
        "values": [
          0.5,
          0.6,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates hand-painted name tags for each plant.",
        "values": [
          0.5,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to share her expertise.",
        "values": [
          0.4,
          -0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes progress photos for a family album.",
        "values": [
          0.4,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a rest area to enjoy the garden.",
        "values": [
          0.3,
          0.1,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is an avid gardener who is tending to their balcony garden. Agent B, their partner, enjoys the peaceful environment while reading. Agent C, their child, is engaged with puzzles but also interested in the surrounding nature.",
    "actions": [
      {
        "description": "Agent A prepares a space for Agent C to plant a seed.",
        "values": [
          0.7,
          0.6,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A talks about future plants with Agent B.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to help with the compost.",
        "values": [
          0.6,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges pots for better watering.",
        "values": [
          0.3,
          0.8,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A constructs a bird feeder with Agent C.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sketches a new garden layout.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A shares photos with a gardening community.",
        "values": [
          0.9,
          -0.4,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A creates a bird-watching journal with Agent C.",
        "values": [
          0.8,
          0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B repot a plant together.",
        "values": [
          0.4,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "An enthusiastic home chef, Agent A, is exploring a new recipe in the kitchen with his cousin Agent B and sibling Agent C, interacting warmly and sharing knowledge, skills, and experiences.",
    "actions": [
      {
        "description": "Agent A decides to attempt a new recipe, showcasing a readiness to tackle complex dishes.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for nutritional advice on the recipe.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A seeks Agent C's opinion on dish presentation.",
        "values": [
          0.6,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a taste-testing event with Agents B and C for feedback.",
        "values": [
          0.5,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with an unexpected spice in the dish.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent C a new cooking technique.",
        "values": [
          0.3,
          0.5,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C set the dining table together to bond.",
        "values": [
          0.2,
          0.3,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A documents his cooking process with photos.",
        "values": [
          0.4,
          -0.3,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A creates an uplifting environment with a dance playlist.",
        "values": [
          0.1,
          0.8,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A is a college student who recently found an old collection of family photographs in the attic. Surrounded by these photos in the living room, Agent A starts to examine them deeply. Agent B, Agent A's parent, sits down and starts to share the stories behind the photos. Agent C, Agent A's cousin, joins in, eager to learn more.",
    "actions": [
      {
        "description": "Agent A opens an old photo album to discover and discuss the history behind each photograph with Agent B and C.",
        "values": [
          0.7,
          -0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves a map from the attic to identify the various locations where the old family photographs were taken.",
        "values": [
          0.8,
          0.4,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a projector to display the photos on a large screen for everyone to see.",
        "values": [
          0.6,
          -0.4,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A contacts distant relatives over a video call to introduce them to Agent B and C.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests placing the photos and stories into a digital archive for the extended family.",
        "values": [
          0.5,
          0.3,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates the creation of a family tree with input from Agent B and C.",
        "values": [
          0.9,
          0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to recount tales of their own college experiences.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small photography project to recreate scenes from old photographs with Agent B and C.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A creates a small quiz game about family history for Agent B and C.",
        "values": [
          0.8,
          0.2,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, while lounging at home on a Sunday, engages with Agents B and C who are experimenting with a new recipe involving an exotic fruit. The environment is one of relaxed exploration, with books and ingredients serving as focal points for interaction and connection among the friends.",
    "actions": [
      {
        "description": "Agent A gets up to join Agents B and C in cooking.",
        "values": [
          0.5,
          0.3,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A looks up the exotic fruit online.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A plays a guessing game about the fruit with B and C.",
        "values": [
          0.8,
          0.5,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a group photo with the dish.",
        "values": [
          0.1,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A leads a taste-testing of the dish.",
        "values": [
          0.4,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A creates a playlist for cooking.",
        "values": [
          0.2,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A teaches how to prepare the fruit.",
        "values": [
          0.6,
          0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A finds more unusual ingredients.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a tradition of trying new recipes.",
        "values": [
          0.3,
          -0.2,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a college student with a passion for cooking, finds roommates Agent B fixing a leaky faucet and Agent C sorting old board games. The kitchen smells of spices from an earlier cooking attempt by Agent B.",
    "actions": [
      {
        "description": "Agent A grabs the cookbook and asks Agent B about the new recipe tried, discussing possible tweaks and improvements.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to join in cooking a collaborative dinner using fresh produce from the workshop.",
        "values": [
          0.5,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A thinking aloud about hosting a weekly 'international cuisine' night, seeking input from Agents B and C.",
        "values": [
          0.9,
          -0.1,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A examining the box of board games with Agent C, suggesting playing one after dinner.",
        "values": [
          0.4,
          0.1,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares an insightful story about sustainable agriculture learned from the workshop.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A fixes the leaky faucet, to provide a better environment for cooking and living.",
        "values": [
          0.3,
          0.8,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A proposes converting part of the backyard into a small vegetable garden.",
        "values": [
          0.6,
          0.7,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a new spice blend purchased from the workshop and encourages Agents B and C to smell and taste.",
        "values": [
          0.8,
          -0.2,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plans a schedule to teach cooking classes to Agent B to enhance their culinary skills.",
        "values": [
          0.6,
          0.1,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a mother, is in the living room with a cookbook while her daughter, Agent B, is at the dining table with art supplies, and her son, Agent C, is upstairs. The house resonates with quiet activity, suggestive of a nurturing environment rich with potential for interactive experiences.",
    "actions": [
      {
        "description": "Agent A decides to start a new recipe from the cookbook that involves making homemade pasta from scratch and invites Agent B to join her.",
        "values": [
          0.7,
          0.5,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a surprise scavenger hunt in the house for Agents B and C, with clues related to art and science to find the hidden snacks.",
        "values": [
          0.8,
          0.7,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes the initiative to learn the new board game that Agent B has been talking about recently.",
        "values": [
          0.9,
          0.4,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family gardening project in the backyard, involving researching different plant species, planting, and maintenance.",
        "values": [
          0.6,
          0.9,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B and Agent C that they create a family vlog channel where they can document their fun activities and learn video editing.",
        "values": [
          0.9,
          0.6,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A explores new storytelling techniques by inviting Agents B and C to create a story together, each contributing different parts.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to help create a colorful chart of nutritious meals for the week, including their own suggestions and recipes.",
        "values": [
          0.4,
          0.8,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes crafting a small indoor greenhouse with Agent C, using recycled materials they gather around the house.",
        "values": [
          0.7,
          0.9,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A starts an impromptu quiz game during dinner about fun and interesting facts, encouraging Agents B and C to share their knowledge.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, sits with Agent B, his parent, and Agent C, a family friend, in the living room with the soft afternoon light illuminating an old photo album, filled with anticipation of discovering past stories.",
    "actions": [
      {
        "description": "Agent A flips through the old photo album, asking Agent B questions about each image.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A opens a window to let fresh air into the room.",
        "values": [
          -0.3,
          0.5,
          0.0,
          0.0,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests creating a photo timeline with Agent B and Agent C.",
        "values": [
          0.8,
          0.7,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves more items from the attic.",
        "values": [
          0.9,
          0.8,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A listens to stories from Agent C, asking thoughtful questions.",
        "values": [
          0.4,
          -0.1,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A records the storytelling session on his phone.",
        "values": [
          0.6,
          -0.4,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A shows affection to Agent B with a hug.",
        "values": [
          -0.5,
          -0.2,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A bakes cookies using a family recipe.",
        "values": [
          0.2,
          0.6,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites B and C for a walk outside.",
        "values": [
          -0.2,
          0.9,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult, and Agent B, their friend and housemate, are spending time in their shared apartment. They come across an old, unmarked box which sparks Agent A's interest. The warm and friendly environment hints at a close relationship between them.",
    "actions": [
      {
        "description": "Agent A opens the old box to discover what is inside.",
        "values": [
          0.9,
          0.3,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to explore the contents of the box together.",
        "values": [
          0.7,
          0.2,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A carefully examines an unusual object found within the box.",
        "values": [
          1.0,
          0.4,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A decides to look up the object online to learn more about it.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A shares an interesting historical anecdote related to the object with Agent B.",
        "values": [
          0.5,
          0.1,
          0.0,
          0.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B rearrange the living room to incorporate their newfound treasure into the decor.",
        "values": [
          0.7,
          -0.4,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests they use the object as a centerpiece for an impromptu themed dinner.",
        "values": [
          0.4,
          0.2,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break to make some snacks for both to enjoy while they discuss the object.",
        "values": [
          -0.2,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shows appreciation for Agent B's company and input during their shared activity.",
        "values": [
          -0.1,
          -0.3,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "energy",
      "intimacy"
    ],
    "scenario": "Agent A, a culinary enthusiast, shares a kitchen with avid gardeners Agent B and Agent C. The kitchen overlooks a well-kept garden, and the counter displays freshly harvested produce. Agent A is drawn to the room's atmosphere and a peculiar purple vegetable.",
    "actions": [
      {
        "description": "Agent A asks Agent B about hydroponic gardening.",
        "values": [
          0.8,
          0.3,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A inquires about recipes for a strange vegetable.",
        "values": [
          0.6,
          0.3,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a 'garden to table' dinner.",
        "values": [
          0.4,
          0.5,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A plans to expand herb gardening within the kitchen.",
        "values": [
          0.2,
          0.7,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A wants to start a blog documenting their garden cooking experiences.",
        "values": [
          0.7,
          0.3,
          0.0,
          0.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A seeks guidance on vegetable harvesting.",
        "values": [
          0.7,
          0.4,
          0.0,
          0.0,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A makes a meal for all, considering dietary preferences.",
        "values": [
          0.5,
          0.8,
          0.0,
          0.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A searches cookbooks for dishes with exotic herbs.",
        "values": [
          0.9,
          0.2,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A plans a trip to the farmer's market with roommates.",
        "values": [
          0.9,
          0.6,
          0.0,
          0.0,
          0.4,
          0.0
        ]
      }
    ]
  }
]