[
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a warmly lit kitchen, Agent A is preparing a new recipe, Agent B suggests ideas from a travel magazine, while Agent C is willing to engage more actively.",
    "actions": [
      {
        "description": "Agent A writes down notes on the recipe modifications they are making based on the conversation.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to sample a trial version of a spicy sauce that is a vital part of the new dish.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A picks up Agent C's novel and inquires about its storyline, showing interest in their friend's current read.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A starts a playful debate on the merits of different cuisines, encouraging Agent B and Agent C to share their points of view.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to document the cooking process with photos, including Agent B and Agent C in the experience.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small impromptu gameshow in the kitchen for Agent B and Agent C to guess the ingredients by taste and scent.",
        "values": [
          0.8,
          0.0,
          0.0,
          1.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to chop some vegetables, turning it into a team effort to prepare the meal.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a cozy dining area with candles and music to enhance the atmosphere for when the meal is ready.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.9,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a surprise dessert from the fridge, something they had prepared the night before for this gathering.",
        "values": [
          0.4,
          0.0,
          0.0,
          1.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenage amateur astronomer, has set up an old telescope in the living room with Agents B and C, engaging in stargazing and creating a cozy atmosphere for shared discovery and bonding.",
    "actions": [
      {
        "description": "Agent A adjusts the telescope, fine-tuning the focus on a particularly bright star.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for assistance to locate a nebula mentioned in a recent astronomy magazine.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.2,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A changes the lounge room setup to create a more comfortable observation space for everyone.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests forming a mini-observation competition to see who can spot a constellation first.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A looks up from the telescope to share a fascinating fact about a star with Agents B and C.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B exchange a high-five after successfully identifying a distant planet.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a collaborative effort to draft their own star map based on tonight's findings.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to make a tradition of this gathering, inviting Agents B and C to meet weekly.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to teach Agent C how to use the telescope's various adjustments.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.3,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a recent college graduate, has returned home to live with her parents, noticing an unfinished jigsaw puzzle. Her mother, Agent B, and father, Agent C, have their own hobbies but come together for family activities.",
    "actions": [
      {
        "description": "Agent A picks up a puzzle piece, trying to figure out where it fits within the incomplete jigsaw puzzle.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to help her finish the puzzle.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests turning puzzle completion into a family activity for the evening.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes a photo of the puzzle progress to share with her siblings who live out of town.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the living room to create an inviting atmosphere for the family puzzle activity.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A searches for the original picture of the puzzle online to better understand what the completed image should look like.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A prepares refreshments for the family to enjoy while working on the puzzle.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A finds a playlist of favorite family songs to play in the background while they work on the puzzle.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A decides to use the puzzle activity to reminisce about past family gatherings and share stories.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "A parent, Agent A, is cooking in the kitchen while the child, Agent B, is engaged with a puzzle, and the spouse, Agent C, looks at a family album in the living room filled with warmth and the aroma of dinner.",
    "actions": [
      {
        "description": "Agent A involves the family in setting the table as a joint activity.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B with the puzzle, creating a playful competition.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plays an old guitar, making music in the home.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes recreating an event from the photo album for a retro-themed night.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a collaborative storytelling game with the family.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A gets costumes for a family photo session.",
        "values": [
          0.5,
          0.0,
          0.0,
          1.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A learns a new puzzle type from Agent B.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "During dinner, Agent A encourages sharing favorite food memories.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A records the puzzle completion for a fun review.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is in their new apartment with Agent B, looking at a photo album, while Agent C shows interest in a puzzle on the table and shares details about an antique lock recently acquired.",
    "actions": [
      {
        "description": "Agent A sits with Agent B to reminisce while looking through the photo album.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to work on the puzzle and discusses the antique lock.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A notes ideas for future flea market visits with Agents B and C.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests they take a group portrait.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A plays the guitar and sings with the group.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A has a lively discussion with Agent C about the lock.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A plans to start a scrapbook of adventures with Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B tell Agent C the stories behind their photos.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers guitar lessons to Agent C.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is eager to explore culinary skills and has planned an elaborate family dinner. Agent B, his mother, is at the dining table; Agent C, his father, is setting up a smart speaker; Agent D is on the couch. The kitchen is alive with the sounds and smells of cooking, creating a scene of domestic warmth and shared anticipation.",
    "actions": [
      {
        "description": "Agent A reveals the menu to the family, detailing the origin of each dish.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A carefully plates each dish, adding artistic garnishes.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a game to guess ingredients in each dish.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join in garnishing the final dish.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A guides Agent D through the steps of a simple recipe.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a table with thematic decorations.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to photograph the dinner process.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A asks for feedback after each course.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a toast to the family.",
        "values": [
          0.2,
          0.0,
          0.0,
          1.0,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A observes Agent B painting and Agent C cooking in a comfortable home environment that invites involvement and learning.",
    "actions": [
      {
        "description": "Agent A picks up a travel book and starts a conversation with Agent B about vacation ideas.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with cooking, learns the recipe, and engages in warm interaction.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A captures the moment by photographing Agent B's artwork, preserving memories.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A collaborates with Agent B on planning a new art project.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a fun contest to judge Agent C's cooking venture.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares old memories with Agent C, looking through a photo album.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a space for Agent B to try new art materials.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A enriches the culinary adventure by buying a cookbook for everyone.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up after dinner, showing care for Agent C's effort.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a family home, Agent A, a teen with a passion for culinary arts, discovers a hidden recipe book in the kitchen. Agent B, the visiting cousin, is at the kitchen island, and Agent C, the family dog, observes them.",
    "actions": [
      {
        "description": "Agent A picks out ingredients to try a new recipe.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to choose a dish to prepare together.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A calls a knowledgeable friend for recipe guidance.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A blind taste-tests spices with Agent B's aid.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A arranges the dishes for a family photo.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shares an extra serving with a neighbor.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A and B trade stories over the meal they made.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A starts a garnishing contest with Agent B.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A looks up the dish's origin for deeper insight.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.3,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a warmly lit townhouse on a quiet Saturday morning, Agent A finds themselves in the spacious study room together with Agent B, who is looking at an old photo album, and Agent C, who is knitting. The environment is serene, with books and personal touches that indicate a connected and intellectually nurturing household.",
    "actions": [
      {
        "description": "Agent A picks up a dusty book from the top shelf, intrigued by the title they've not seen before, and begins reading.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sits next to Agent B, asking to share memories captured in the photo album.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A offers to play a strategy board game with Agent B and Agent C.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A attempts to play a cheerful song on an old guitar.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about past family vacations using a box of trinkets.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family session to bake cookies together.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a storytelling session with turns for everyone.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A gathers the family for a collaborative craft project.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to a puzzle-solving contest.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult, is spending a cozy Saturday afternoon in their apartment with roommate Agent B and visiting friend Agent C. They engage with travel guides and souvenirs while sharing stories and laughter.",
    "actions": [
      {
        "description": "Agent A suggests creating a scrapbook with photos and souvenirs, inviting Agents B and C to contribute.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C detailed questions about their travels to a specific location featured in the guidebook, sparking a group conversation.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a themed snack to match Agent C’s travel tales.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plays a tune on a musical instrument related to Agent C's travel destination.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a themed movie night inspired by the travel guides.",
        "values": [
          0.6,
          0.0,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game of charades for Agents B and C to act out travel scenes.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares their own travel experiences in exchange with stories from Agent C.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A offers a virtual tour of a desired city to Agent C using VR.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A marks everyone's visited locations on a map, creating a collective travel history.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is painting in the living room, Agent B is learning a new song on the guitar, and Agent C is working on a school project at the dining table.",
    "actions": [
      {
        "description": "Agent A adds a new element to the canvas to capture the sunlight.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A gives feedback to Agent B on the guitar melody.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shows interest in Agent C's school project.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.3,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family art project on a new canvas.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the furniture for creative activities.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a visually pleasing snack and suggests a break.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A asks for a guitar lesson from Agent B.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A aids Agent C's research.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.2,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts a discussion about future family projects.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, after hosting a weekend movie night, is engaging with friends Agent B and Agent C in various activities to provide continued enjoyment and deepen their relationships.",
    "actions": [
      {
        "description": "Agent A suggests starting the puzzle together with Agent B and Agent C.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A makes warm cocoa for everyone.",
        "values": [
          0.2,
          0.0,
          0.0,
          1.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes they discuss the movie's open ending and theorize about the sequel.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A switches the movie for an interactive game.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C to select the next movie.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A turns on some light music.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a photo album to share.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings out blankets for Agents B and C.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agents B and C about their plans.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.3,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A discovers an old box of family heirlooms in the attic while family members are engaged in warmth-creating activities throughout the house. Together with Agent B and Agent C, Agent A delves into the items, raising family spirits by sharing stories and bonding over shared history.",
    "actions": [
      {
        "description": "Agent A decides to examine the intricately carved wooden box more closely, seeking to uncover its origins.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.3,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to brainstorm ideas about the stories behind each of the keepsakes.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A shares amusing anecdotes related to the items with Agent C and B.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A carefully organizes the keepsakes to create a display that all family members can view and enjoy.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family project to restore any worn-out items in the keepsake collection.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to read some of the old letters aloud to Agent B and Agent C to connect with the past.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A initiates the idea of creating a family tree, integrating the stories tied to the artifacts found.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes the idea of compiling the letters and maps into a scrapbook for the family to revisit in the future.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to sketch some of the items, adding a modern twist to the family memories.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a recent college graduate living with their close friend Agent B. They discover an old guitar and start to learn how to play it, while Agent B is dreaming about future travel adventures.",
    "actions": [
      {
        "description": "Agent A decides to clean the guitar and start learning how to play, looking up chords and tutorials online.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to Agent B the idea of a road trip to visit various music festivals.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A starts a playful competition with Agent B to see who can learn the most songs on an instrument.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to join in an improvised jam session.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates a cozy corner in the apartment, envisioning a small personal retreat space.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests they both sign up for a local open-mic night as a challenge.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a surprise dinner for Agent B, themed around a country's cuisine from the travel magazine.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small gathering with close friends to share the latest interests and hobbies.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes the first step toward learning the guitar by enrolling in an online music course.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A wakes up to a quiet Sunday morning and decides to make a surprise breakfast, crafting a unique coffee station to experiment with flavors, while Agent B reads and Agent C listens to music. Agent A prepares to cook something special for the household.",
    "actions": [
      {
        "description": "Agent A creates personalized breakfast plates.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Writes heartfelt notes of appreciation.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Artistically sets the dining table.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Learns new pancake art to impress housemates.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Builds a collaborative morning music playlist.",
        "values": [
          0.8,
          0.0,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Cooks using a secret family recipe.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Involves Agent B in cooking for a joint activity.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Suggests planning a future themed dinner night.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Captures the breakfast nook ambiance.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, returns home to his room filled with school projects and DIY kits. Agent B, his mother, prepares dinner, while Agent C, his best friend, arrives with a model airplane kit.",
    "actions": [
      {
        "description": "Agent A invites Agent C to show him the projects he has been working on.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shows interest in Agent C's model airplane and suggests they build it together.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent B in the kitchen to learn a new recipe.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.3,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C plan to decorate the model airplane with unique art.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares his favorite music with Agent C during a break.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers to teach Agent C some research techniques.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agents A and C plan a future art and model building project.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a post-dinner board game to Agent B and C.",
        "values": [
          0.5,
          0.0,
          0.0,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A creates alliances and shares insights during the board game.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A has returned to their family home where Agent B is in the living room with classic games and Agent C is preparing dinner. The home setting is a catalyst for an evening of engagement and reminiscent conversation.",
    "actions": [
      {
        "description": "Agent A joins Agent B's game and adds new rules.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A discusses memories with Agent B.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A starts a cooking session with Agent B.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a photo story guessing game with Agent B.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A introduces a new board game to Agent B.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B create a living room fortress.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B to play a song on the guitar.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates a scavenger hunt for Agent B.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B prepare a surprise for Agent C.",
        "values": [
          0.3,
          0.0,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, experiments with new recipes to surprise Agent B. Taking inspiration from a cookbook, Agent A prepares a special dinner. Agent B, delighted by the cooking initiative, watches with interest. Agent C is nearby, adding to the comfortable, familial setting with guitar music. This scene sets a backdrop of familial warmth, shared interests, and joyful engagement.",
    "actions": [
      {
        "description": "Agent A carefully follows a recipe from the cookbook, trying to ensure each step is done to perfection.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to tweak the recipe, adding personal touches to enhance the flavors.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agent B in conversation, sharing insights about the chosen recipe and its origins.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A tastes the dish during preparation, anticipating the shared experience of the meal.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join them in the kitchen, turning meal preparation into a shared activity.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to snap photos of the cooking process, preserving memories of their culinary adventure.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A asks for Agent B's feedback on the taste of a dish to improve it or show appreciation for their involvement.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that after dinner, they play a board game that encourages collaboration and family bonding.",
        "values": [
          0.2,
          0.0,
          0.0,
          1.0,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young parent, sets up an indoor camping experience with a tent adorned with fairy lights for a family night. Agent B, the spouse, prepares snacks, and Agent C, their child, waits excitedly with a book of bedtime stories.",
    "actions": [
      {
        "description": "Agent A invites Agent B and C to join in the tent to choose the first story to read.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests making a family drawing on a large piece of paper depicting their imaginary camping adventure.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game where each family member has to create a fictional character and share a story about them.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to record a video of their child's gleeful reaction to the tent and activities, to save the moment for posterity.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes that each person shares one thing they learned during the day before they begin their camping night.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.4,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts an impromptu shadow puppet show using the fairy lights and their hands, encouraging B and C to join.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a make-believe campfire and teaches C an old family song, sharing memories associated with it.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A proposes planning their next real camping trip, sparking a family conversation on where they would like to go.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A carefully listens to C's thoughts about the stories read, reinforcing C's expressiveness and showing genuine interest.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.5,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is engaging with a puzzle, with Agent B near them strumming a guitar and Agent C in the kitchen. A board game catches Agent A's eye, and there's an atmosphere of shared interests and relaxation within the home.",
    "actions": [
      {
        "description": "Agent A suggests to Agent B to play a new board game together, initiating a new shared experience.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A expresses interest in learning the new guitar chords Agent B is playing, engaging in a shared passion.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to join the puzzle, creating a family bonding moment.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A selects an intriguing novel to suggest for the family book club.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares a piece of the puzzle with Agent B, involving them in the activity.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help Agent C in the kitchen, combining learning with quality time.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B create a playful song together, incorporating shared humor and stories.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plans a celebration of the puzzle completion with Agent C.",
        "values": [
          0.2,
          0.0,
          0.0,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A reminisces with Agent B about past family game nights.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a writer, is in his study while Agent B plays piano and Agent C draws. Agent A is intrigued by an old journal which may inspire new creativity as the peaceful evening sets a tone for familial sharing.",
    "actions": [
      {
        "description": "Agent A retrieves an old journal, leafing through memories.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares anecdotes from his journal with Agent C.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a creative jam session with Agent B.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares travel mementos with the family.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A writes a story inspired by Agent C's sketches.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C play a board game together.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to illustrate his new story.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A makes hot chocolate for Agent C.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A records the family’s jam session.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a household kitchen, Agent A, a teenager, bakes cookies while Agent B, a sibling, and Agent C, a cousin, are around. Agent A engages with new recipes, photo albums, and unexplored culinary gadgets in a warm environment filled with familial interaction.",
    "actions": [
      {
        "description": "Agent A decides to try out a new recipe from a cookbook that has been gathering dust on the shelf.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a game where they create a fictional story about their ancestors based on the photos in the albums.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a spontaneous cookie decorating contest to see who can create the most original design.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A offers to teach Agent B how to prepare a simple yet unfamiliar dish using one of the new kitchen gadgets.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to bake their grandmother's secret recipe together, which none of them have attempted before.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes out their phone to snap pictures of the baking process and the decorated cookies to create a photo series.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to choose the next recipe to try, engaging them in the decision-making process.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A creates a playful quiz about the family, with questions inspired by the photo albums, challenging the others to answer.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages in a heart-to-heart talk with Agent C, sharing thoughts about the highlights and struggles of the past school year.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A sets up a backyard tent for a home camping experience with Agent B and Agent C, children, and Agent D prepares treats, creating a cozy and adventurous atmosphere.",
    "actions": [
      {
        "description": "Agent A tells a made-up adventure story about constellations.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game of make-believe, pretending the tent is a spaceship.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B and Agent C some basic constellations using the projected night sky.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a surprise treasure hunt inside the tent with small gifts.",
        "values": [
          0.7,
          0.0,
          0.0,
          1.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B create shadow puppets with a flashlight, while Agent C guesses the shapes.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories from their own childhood camping experiences.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A opens a debate about what animals they could pretend to be in the wild.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B and Agent C to each recount a favorite memory of being together as a family.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B and Agent C a new card game and plays several rounds together.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a family home, Agent A, a teenager, discovers an old board game in the attic. Agent B, the parent, is making dinner, while Agent C, a family friend, reminisces in the living room. Agent A brings the game down, catching Agent B and Agent C's attention, and prepares for an evening of fun and bonding over this newly found game.",
    "actions": [
      {
        "description": "Agent A dusts off the board game and reads the rules aloud to Agent B and Agent C.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the board game in the living room, arranging the pieces and cards.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.4,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to choose their characters.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A leads the storytelling aspect of the game.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a playful wager on the game.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A reminisces about past family game nights.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A attentively listens and responds to Agent C's stories.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A voluntarily takes on the role of game master.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A is observant of Agent B’s and Agent C’s responses to the game.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, arrives home to find family artifacts spread around the living room, with Agent B, their parent, and Agent C, their grandparent, looking over them. The environment suggests a chance to reconnect with family history and create new memories.",
    "actions": [
      {
        "description": "Agent A picks up a photo album and starts leafing through it, showing an interest in the family history.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to tell the story behind a peculiar photograph.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to try playing the guitar under the guidance of Agent C, sharing laughter at the attempt.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a board game that prompts storytelling from old photos.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a group photo to add to the family collection.",
        "values": [
          0.4,
          0.0,
          0.0,
          1.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A organizes memorabilia to create a family timeline exhibit.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to bake cookies together as a bonding experience.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A gathers everyone to share their most humorous childhood stories.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A records the stories told by Agent B and Agent C.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, seated at the dining table preoccupied with work, is drawn to the laughter and reminiscing of Agent B and Agent C, who are engaged with old family photos in the kitchen.",
    "actions": [
      {
        "description": "Agent A decides to join in Agent B and Agent C's activity at the kitchen island, focusing on the stories and photos they are discussing.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves a notepad to jot down notes and names relating to the stories being told by Agent B and Agent C.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.3,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests organizing the photos into a digital family album that could be shared with relatives.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A asks about the history behind some of the more intriguing or mysterious photos.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game where each person picks a photo and makes up a story about it, then the others have to guess if the story is true or fabricated.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A looks for similar traits in their and their relatives’ appearances, noticing details in the family photos.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to record Agent B's and Agent C’s descriptions of the photos and stories to preserve their oral histories.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A gently teases Agent B with a playful anecdote related to one of the photos, fostering a light-hearted atmosphere.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a camera, suggesting they take a new photo of the three of them to add to the collection.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In the kitchen, Agent A arranges ingredients for a new pizza recipe, while Agent B sorts through old family photos. They share a close bond as they engage in their projects, with Agent A following an online pizza-making tutorial and Agent B preparing for a family anniversary project.",
    "actions": [
      {
        "description": "Agent A creates a topping design on the pizza that reflects a shared memory.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A surprises Agent B with a custom-designed photo album cover.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to learn the pizza-making technique.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A reorganizes the kitchen for collaborative work.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a creative topping competition.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A photographs the pizza, comparing it to family photos.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.4,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A records a video message using the pizza as a prop.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A makes a dessert pizza with Agent B.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B select a family photo for the album.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a teenager with a fondness for culinary arts, currently flipping through an old family recipe book in the kitchen. Agent B, A's sibling, is lounging on the sofa in the adjacent open living room, deeply engrossed in a novel. Agent A stumbles upon a handed-down recipe with incomplete instructions and a faded picture of a cake that seems to encase stories of the past. Wondering about the missing steps and the tales the dessert might hold, Agent A turns to Agent B with a gleaming eye, clutching the recipe and the mysteries it holds. The setting sun casts a warm glow through the kitchen window, but inside, the atmosphere is ripe for discovery, teaching, and creating shared experiences.",
    "actions": [
      {
        "description": "Agent A invites Agent B to help recreate the family recipe, offering a chance to bond and learn together.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a video call with their grandmother to ask for the missing recipe details and to hear the story behind it.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A experiments by adding different ingredients to the recipe, aiming to innovate and make a new version of the old dessert.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A organises a surprise taste test for their parents, eager to share the outcome of the experiment.",
        "values": [
          0.4,
          0.0,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the baking process to document this new memory created with Agent B.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A pens down their modifications to the family recipe, incorporating personal touches for future reference.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to create a scrapbook page dedicated to the day's experience, alongside Agent B’s story impressions.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen space, to set a comfortable and inviting scene for further culinary explorations.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories about past family cooking adventures while they bake together with Agent B.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, excited from travels, shares unique souvenirs and stories with roommates Agent B and mutual friend Agent C, as they prepare for a celebratory meal in their cozy shared apartment.",
    "actions": [
      {
        "description": "Agent A offers to show Agent B and Agent C a photo album filled with pictures and anecdotes from the travels.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes organizing the souvenirs and labeling them with hand-written notes about their origins for Agent B and Agent C to read.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "During dinner, Agent A suggests a game where each person shares a personal experience related to a theme inspired by the souvenirs.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a plan to create a joint scrapbook that includes contributions from all present, merging travel memories with local experiences.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to invite Agent B and Agent C to participate in a cultural cooking challenge using spices and recipes collected during the trip.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A teaches Agent B how to play a traditional board game bought overseas, offering to keep score and make it a tournament series.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Post dinner, Agent A brings out a puzzle depicting a scenic location from the trip and encourages everyone to complete it together.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a video call with a new friend made abroad, introducing Agent B and Agent C to further share the cultural exchange experience.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A chooses to distribute several small souvenirs as tokens of appreciation for Agent B’s and Agent C’s support.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A finds an old box of family memories in the attic and sits down with Agent B to explore its contents. Together, amidst laughter, storytelling, and the occasional interruption by Agent C, they delve into photographs and VHS tapes from past family events.",
    "actions": [
      {
        "description": "Agent A sets up an old VHS player to see what's on the tapes.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to share stories about the people in the photo albums.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family movie night to watch the old tapes.",
        "values": [
          0.5,
          0.0,
          0.0,
          1.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes a photo of a funny childhood picture of Agent B to share with family.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B to convert the VHS contents digitally.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A repairs a torn page in a photo album.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A contacts distant family to ask about photo stories.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates a family tree while asking Agent B about relatives.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A captures a video tour of the photo albums to share online.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, an enthusiastic parent, has gathered their family in the living room to share a surprise involving new exotic plants, a completed home gardening project.",
    "actions": [
      {
        "description": "Agent A gathers materials to teach Agent B how to properly care for the new plants.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family board game night, selecting a game that requires learning new strategies.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent C about decorating the house for an upcoming celebration.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates a treasure hunt for Agent B, hiding clues around the house that lead to an educational but fun reward.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a photo album, encouraging Agent B to ask questions about family history and share stories.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.3,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a home movie night, choosing films from different cultures to watch together as a family.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to help create a homemade meal that neither of them has tried before.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family stargazing night, setting up a telescope and preparing facts about the night sky.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A records a fun dance video with Agent C and Agent B, prompting them to pick up new dance moves.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is with Agent B who is trying out a new recipe, and Agent C who is looking through a photo album, in a house filled with the warmth of the sun and the aroma of baking.",
    "actions": [
      {
        "description": "Agent A joins Agent B in the kitchen to assist with and learn the new recipe.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A begins to recount the memories behind the photos to Agent C.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A goes out to pick fresh herbs for the recipe.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a taste test for the newly prepared dish.",
        "values": [
          0.6,
          0.0,
          0.0,
          1.0,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests creating a scrapbook with Agent C.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A brings board games to play with Agent B and Agent C.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to take photos to capture the memories of the day.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares an amusing home video with everyone.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A compiles a playlist to reminisce on the past era.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A creates a treasure hunt for Agent B, filling the house with cryptic clues related to family memories and inside jokes, culminating in finding a new board game for a game night. Agent C joins in, welcomed with open arms into the fun and shared experience.",
    "actions": [
      {
        "description": "Agent A hints at where a particularly tricky clue may be hidden without giving it away completely.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of Agent B deciphering the clues to later compile into an album.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A laughs heartily at Agent B's dramatic celebrations upon finding each clue.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A high-fives Agent B after a particularly difficult riddle is solved.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A hugs Agent C in welcome, inviting them to join the activity.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A playfully teases Agent B about a family memory referenced in one of the clues.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A recounts a humorous anecdote related to one of the riddle's answers.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares an idea about playing the new board game as a team with Agent B and Agent C.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A reminisces with Agent C about past game nights and expresses contentment at having them join today's fun.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy, sunlit kitchen, Agent A sits at a small table with spices and vegetables, while Agent B carves a pumpkin, and Agent C reads a novel in an adjacent area.",
    "actions": [
      {
        "description": "Agent A measures a new spice mixture to flavor the dish.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for an opinion on the dish’s taste.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets the dining table with a theme inspired by Agent B's carving.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers a taste of the cooked dish to Agent C.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes pictures to share with friends online.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A starts a pumpkin carving competition with Agent B.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A discusses the novel with Agent C.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing a new board game after dinner.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A bakes a surprise dessert for the family.",
        "values": [
          0.3,
          0.0,
          0.0,
          1.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is attempting a new recipe in the kitchen with Agent B, who is interested in the process, and Agent C, who is engaged in a book at the table. The environment is warm and inviting.",
    "actions": [
      {
        "description": "Agent A invites Agent B to help prepare the meal, explaining each step and ingredient used.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside a portion of the dish before adding a spicy ingredient, knowing Agent C prefers milder flavors.",
        "values": [
          -0.5,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small taste test for Agents B and C to decide which variation of the dish they prefer.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to share insights from the book they are reading over the meal.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A decides to place the fresh herbs in a vase, adding an aesthetic touch to the dining environment.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A records the cooking process with the intention to review it later and see what can be improved.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A, seeing Agent B’s interest, describes a memory related to the dish being cooked.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes playing a game where each person shares a story of their favorite culinary experience.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A rearranges the kitchen to create a more inviting atmosphere for Agent B and C to participate in the cooking process.",
        "values": [
          -0.4,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "A cozy family evening with Agent A preparing to sketch, Agent B reading, Agent C looking through photo albums, and Agent D taking candid photos.",
    "actions": [
      {
        "description": "Agent A starts a conversation with Agent B about the novel's plot.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to reminisce over photo albums.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a canvas to start painting with input from others.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A discusses photography with Agent D.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.4,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a group portrait session.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A leads a game of charades based on memories and stories.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts an impromptu storytelling around photos.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A begins a scrapbook project from the evening's activities.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a trip planning session using old photos.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, returns home and sees Agent B, their younger sibling, struggling with baking a cake, and Agent C, their parent, reminiscing over family photos.",
    "actions": [
      {
        "description": "Agent A helps Agent B with the cake icing, showing a trick to their sibling.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.4,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sits with Agent C to relive memories from family photos.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B look up cake decoration tutorials together.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C organize family photos into an album, sharing memories.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A laughs with Agent B at the first baking attempt, suggesting documenting it.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A playfully teases Agent C about a past outfit.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A goes to get more baking ingredients for Agent B.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.2,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a weekly baking challenge to Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A engages Agents B and C in a board game.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager with a zest for life, lounges in the living room. Agent B is on the rug with pencils and a sketchpad. Agent C organizes a model train collection upstairs, and Agent D cooks dinner while humming a tune.",
    "actions": [
      {
        "description": "Agent A picks up the unused painting supplies and decides to join Agent B on the floor, suggesting they paint together.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A brings the guitar over to Agent D in the kitchen, offering to play some music to accompany the cooking process.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to take a break and come downstairs to enjoy the meal together, contributing to a family discussion about everyone's hobbies.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes an impromptu family game night after dinner, setting up the board game collection they've accumulated over the years.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A starts an indoor photo scavenger hunt with Agent B, using their phone to capture the fun and unique aspects of their home.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a storytelling session, where each family member adds to the tale based on random objects found around the house.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B that they use the LEGO pieces to create personalized placeholders for dinner, adding a creative touch to the table setting.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A begins to document the evening by video recording, planning to compile a family movie night.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves an old telescope from storage and proposes stargazing with the family after dinner.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, arrives home to a kitchen where Agent B is preparing a family dessert recipe with Agent C taking notes. The house is filled with laughter, storytelling, and music, creating a warm setting.",
    "actions": [
      {
        "description": "Agent A greets Agent B with a hug and inquires about the recipe.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A tastes the dessert mixture, enjoying the flavor.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A helps with the baking process.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A photographs Agent B and Agent C together.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A learns about the recipe's history from Agent B.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A cleans and tidies the kitchen.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets the dining table with anticipation.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A calls another family member to share the experience.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A creates a playlist to match the kitchen's atmosphere.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult with a keen interest in gardening, is potting new plants on the balcony. Agent B, the sibling, reads about celestial objects, while Agent C, a parent, prepares snacks. Agent A finds a peculiar seed, sparking interest and leading to gardening activities involving the family.",
    "actions": [
      {
        "description": "Agent A decides to plant the peculiar seed separately and document its growth.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to speculate about the origin and identity of the seed.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A retrieves a reference book from the shelf to look up the seed.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B that they should make a small bet on what the plant will turn out to be.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to join a weekly progress meeting to observe the growth of the mysterious plant.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes a photo of the seed and posts it on a plant lovers' forum seeking insights.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.3,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A starts a journal entry detailing the day's discovery and expressing thoughts.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A plans a future plant-themed family game, driven by the excitement of the new seed.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the space on the balcony to give the new seedling adequate sunlight and room.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a passionate cook, prepares a surprise gourmet dinner for their roommates Agent B and Agent C on a cozy Saturday evening, utilizing a new fusion recipe and setting a warm, inviting atmosphere for the celebration.",
    "actions": [
      {
        "description": "Agent A meticulously decorates the dining table with fine china and sets a warm mood with dimmed lights and background music.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a playful game with Agents B and C, having them taste-test the new dish blindfolded to guess the ingredients.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A and B exchange stories about their family's cooking traditions while waiting for the dish to rest.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.5,
          1.0,
          0.0
        ]
      },
      {
        "description": "Engaging Agent C in the preparation of the dessert, where Agent A teaches them the step by step process.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.3,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A reveals the story behind the exotic recipe they chose, explaining its origins and why it piqued their interest.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to document the evening by taking group photos with Agent B and Agent C to create a shared album.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "To keep the momentum, Agent A suggests forming a dinner club where they can explore different cuisines each month.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "After enjoying the meal, Agent A involves Agents B and C in playing a board game they've crafted themselves.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B and Agent C to share their vinyl records and relish the nostalgia together after the meal.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, Agent B, and Agent C are enjoying a relaxed afternoon at home. Agent B looks into old photo albums while Agent C shares travel stories. The room is filled with warmth, soft music, and laughter.",
    "actions": [
      {
        "description": "Agent A paints a canvas capturing the afternoon light.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A marks a world map with places from Agent C's stories.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up an indoor picnic.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A creates a picture collage with new and old photos.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests they play a new board game.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation on personal growth experiences.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A cooks a new recipe with Agent B and Agent C.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A finds costumes for an impromptu photo session.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares their drawings from an old sketchbook.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, is in their family kitchen on a Saturday morning. Agent B, their parent, is making breakfast, and Agent C, Agent A's younger sibling, is coloring. Agent A, having set the table, finds an old box of family recipes on a shelf.",
    "actions": [
      {
        "description": "Agent A retrieves the box of family recipes to explore its contents.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B about the history of the recipes and if they can prepare one together.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to pick a recipe that they can try baking later.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a table with all the ingredients to share the experience.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A uses their phone to document the cooking process.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the recipes by era and plans a 'vintage cooking week' with the family.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A researches the origins of unusual recipes.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests making recipe discovery a guessing game.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decorates the dining area to match the recipe theme.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young culinary enthusiast, hosts a dinner with Agents B, C, and D. Agent B brings exotic spices from abroad. The atmosphere is warm, with shared laughter, cooking aromas, and storytelling.",
    "actions": [
      {
        "description": "Agent A decides to make a dish they've never attempted before using the new spices.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent B in the cooking process, asking for tips on using the ingredients.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents C and D to taste test the dish during preparation for immediate feedback.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A starts an impromptu game where Agents B, C, and D have to guess the new spices used in the dish.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a cooking competition with Agents B, C, and D, where each person adds an ingredient to create a unique dish.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A records the dinner preparation on their phone, planning to share the memories with the family.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent D to share a personal story associated with a particular spice.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A encourages everyone to share their most memorable meal experience.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes on the challenge to guess the origin of the spices by scent alone.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a warm, sunlight-bathed living room, Agent A finds a family scrapbook and begins to explore it with their younger sibling, Agent C, while Agent B, a parent, reads nearby.",
    "actions": [
      {
        "description": "Agent A picks up the scrapbook and starts leafing through the old family photographs with Agent C.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A, inspired by the photographs, suggests to Agent B and Agent C that they recreate some of the old photos for fun and comparison.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes they use a spare room in the house to create a small family history corner with artifacts and pictures.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.2,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family excursion to visit the places featured in the scrapbook.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A finds old art supplies and initiates a crafting session with Agent C to decorate the frames for the photos.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A begins a project to digitize the family photos and records narratives from Agent B as part of a digital family tree.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a surprise \"gallery opening\" at home, showcasing the newly framed photographs and inviting the family to an evening of viewing and storytelling.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A finds an old camera and explores its mechanics, attempting to take new photos in the style of the old ones.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.3,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, is rearranging their shared bedroom with sibling Agent B while their cousin, Agent C, is visiting. Agent A discovers an old, dust-covered board game in the back of the closet. The game is a mystery-solving puzzle that none of them have played in ages. Agent A holds the game in their hands, considering whether to open it and explore its contents with Agent B and Agent C.",
    "actions": [
      {
        "description": "Agent A suggests to Agent B and Agent C that they play the old board game together to rediscover its challenges.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A opens the board game and begins to explain the rules to Agent C.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A decides to rearrange the furniture in the room to create a comfortable playing space for the three of them.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A starts to improvise new rules to the game to make it even more exciting for everyone.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A looks for an online community or forum dedicated to fans of the old game to find any missed tips or tricks.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.3,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A proposes that they keep a score sheet to track progress over multiple game sessions.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A takes turns with Agent B in sharing fond memories related to past instances of playing the game.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to take the lead in a round to boost their confidence.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to personalize the game pieces with craft materials they find in the room.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, an aspiring artist, is spending an afternoon at home with Agent B, a neighbor and amateur photographer. They're in the living room surrounded by painting supplies and family photos. Agent C, Agent A's partner, joins them with a scrapbook of memories. They plan to use Agent A's new watercolor set and add to the scrapbook, capturing their current moment of creativity and companionship.",
    "actions": [
      {
        "description": "Agent A decides to paint a new piece, capturing the essence of their current gathering.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to collaborate on a mixed media artwork combining painting and photography.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A chooses a photo from the scrapbook and starts recreating it with the watercolors.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a canvas for Agent B, encouraging them to express their perspective of the day.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a playful challenge with Agent B to see who can create a quirky portrait of Agent C faster.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break from painting, brews tea for everyone, and continues the conversation about their travels.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A organizes an impromptu game where they have to guess the story behind each photo Agent C reveals from the scrapbook.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests they start a new tradition by adding something to the scrapbook every year on this date.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A searches through old art supplies and discovers a forgotten homemade paint, prompting a discussion about past DIY projects.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen experimenting with a new recipe, while Agent B strums his guitar at the dining table, and Agent C flips through a photo album.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to help finish the recipe, guiding them through each step.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a mini cooking competition with Agent B and Agent C.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to create a song about their cooking.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests sharing childhood meal stories while cooking.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A brings out grandmother's cooking utensils.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "They document the evening with candid cooking and laughing photos.",
        "values": [
          0.3,
          0.0,
          0.0,
          1.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A starts a food plating challenge.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to invent a new dish with leftover ingredients.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out unfamiliar spices for Agent B and Agent C to guess.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, with Agent B and Agent C in their shared apartment, enjoys the scent of freshly baked cookies and reminisces over an old photo album.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to join at the dining table to try the new cookie recipe.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about the old photo album, sharing memories.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests planning a themed dinner party, brainstorming ideas.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A decides to rearrange the furniture to create a cozy nook.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.2,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a DIY home improvement project for collaboration.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A brings out board games for a game night.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a surprise indoor picnic.",
        "values": [
          0.5,
          0.0,
          0.0,
          1.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A starts a creative cook-off challenge using available ingredients.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A compiles a shared digital photo album with the others.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A has arranged a cooking gathering with her friends Agent B and Agent C in her home. As an avid chef, she creates an atmosphere of collaboration for experimenting with exotic recipes. Agent B engages with the spice variety, while Agent C looks through a travel recipe book and everyone enjoys sharing stories and laughter.",
    "actions": [
      {
        "description": "Agent A proposes that they should create a dish without following any recipe, to trust their instincts.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A decides to open a bottle of rare wine to share.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A brings out an old photo album for nostalgia.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a storytelling game revolving around ingredients.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A starts a friendly contest in the kitchen.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A listens attentively to a concern shared by Agent C.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A teaches her friends a cultural dance.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A records the evening's events for posterity.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A prepares personalized seating for dinner.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenage photography enthusiast, is in the sunlit corridor of their home with a vintage camera. Agent B, the younger cousin, is looking at old photo albums, and Agent C, the parent and amateur painter, is retouching a family portrait.",
    "actions": [
      {
        "description": "Agent A decides to organize an impromptu photo session with Agent B using the vintage camera to emulate the styles found in the old albums.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a family storytelling evening where members share memories associated with the photos from the albums.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A spends time meticulously cleaning and restoring the vintage camera.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a makeshift darkroom in the bathroom to develop photos taken with the vintage camera.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A researches the history and techniques of photography online to understand the context of the old family photos.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.3,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A creates a collage integrating newly taken photos together with the repainted family portrait as a surprise for Agent C.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to assist in mixing chemicals for the photo development process.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A uses software to colorize some of the black and white photos, aiming to revive them.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to digitalize the entire photo collection and create a virtual family album.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a young adult scrolling through old family photo albums in the living room. Agent B, her sibling, enters with a box of their parents' mementos from world travels. Agent C, their cousin, observes from the couch. They engage with the items, sparking a journey through shared family history.",
    "actions": [
      {
        "description": "Agent A picks up an unfamiliar object from the box and examines it, trying to decipher its origin.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A suggests recreating some of their parents' journeys across the living room with thematic decorations.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to interview Agent B and Agent C about their earliest memories with the family.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to start a new family tradition based on one of the items in the box.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A delicately tries on a piece of traditional clothing found in the mementos box.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A reads an old postcard aloud and discusses the message with Agents B and C.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the mementos chronologically and talks through the represented timeline.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.4,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes a moment to hug Agent B, expressing gratitude for their shared history.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside items to create a mantelpiece exhibit for others to see.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a family home's bright, sunlit kitchen, Agent A is preparing brunch while Agent B selects music and Agent C sets the table. Agent A discovers an old family cookbook and shares it with the others, creating an atmosphere of shared history and unity.",
    "actions": [
      {
        "description": "Agent A decides to try a recipe from the old family cookbook that hasn't been made in years, engaging everyone's assistance.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A shares stories about each family member in grandma’s cookbook notes while cooking.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to pick a dish from the cookbook to prepare together next time.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a toast to family and togetherness as they begin to eat.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to decorate pancakes with a creative design using fruits and syrups.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests creating a scrapbook page about today's brunch with everyone’s impressions.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A asks for feedback on the dish from Agent B and C, starting a conversation about tastes.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A places an extra pancake on Agent B's plate, thanking them for selecting music.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and C playfully negotiate over the last piece of pancake, with A letting C win.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A and their partner, Agent B, are at home on a cozy weekend evening, relaxing with a novel and family photo albums. Agent C, a close friend, joins them, intrigued by a puzzle.",
    "actions": [
      {
        "description": "Agent A sets their book aside and suggests to Agent B and Agent C to work together on the uncompleted puzzle.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A fetches a box of old letters found in the attic, proposing to read some of them aloud to Agent B and Agent C.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to show Agent B a trick with the novel's storyline, asking them to pick a random page and trying to guess the context.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation about a family trip depicted in the photos, asking Agent B about their memories.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A begins recounting their own memories heightened by the photographs, sharing stories with the others.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to teach them how to solve a part of the puzzle that has piqued their interest.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to share a particularly touching or humorous story behind one of the photos.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make a warm beverage for everyone, to add to the pleasant atmosphere.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a board game that aligns with themes from their novel, involving the others in a literary adventure.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is organizing an evening indoor treasure hunt for their family with personal touches in the clues related to shared memories and inside jokes. The family awaits eagerly in a warmly lit living room.",
    "actions": [
      {
        "description": "Agent A begins the treasure hunt by handing the first clue to Agent C and watching with anticipation.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A gently nudges Agent C toward an area of the room when they notice them struggling with a clue.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A whispers hints to Agent D to help them understand a complex riddle.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.3,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A captures the moments of the hunt on camera to keep as family memories.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A celebrates enthusiastically when Agent C finds a hidden clue without help.",
        "values": [
          0.4,
          0.0,
          0.0,
          1.0,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sits down with Agent D to recount a fond memory related to a specific clue.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "After the hunt, Agent A gathers everyone to build a scrapbook for the clues and pictures taken during the event.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A shares a special treat hidden as the last piece of treasure, connecting to a family ritual.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "When Agent C and Agent D dispute over a found item, Agent A mediates and turns the situation into a learning experience about sharing.",
        "values": [
          -0.4,
          0.0,
          0.0,
          -0.2,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "The living room of a cozy home, therein Agent A is reading an archaeological article. Agent B sorts vinyl records, and Agent C plays guitar. The environment is conducive to family bonding and learning.",
    "actions": [
      {
        "description": "Agent A closes the laptop briefly to chat with Agent C about the article, sharing thoughts and insights.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to research the discovery together.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A expresses a wish to go to a museum with Agent C.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing themed vinyl records with Agent B.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes an impromptu family performance.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A decides to share old family photos with Agent B and C.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to play a shyly held-back song.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A starts a game of creative book plot summarization.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A reminisces about a concert with Agent B.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In the kitchen, Agent A has just baked cookies and invites Agent B and Agent C to decorate them. The kitchen is warm, music plays, and decorations for cookies are laid out.",
    "actions": [
      {
        "description": "Agent A offers to teach icing techniques to Agent B and Agent C.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts a competition for the most creative cookie.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos for a scrapbook.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a singalong with family music.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A listens to Agent B's garden stories.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to make comic-themed cookies.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A explores different icing flavors and combinations.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A shares a hug with Agent C.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps to tidy up after decorating.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.4,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a family living room, Agent A, a university student, is reading, while Agent B puts together a puzzle, and Agent C paints. Items around them hint at shared hobbies and pastimes.",
    "actions": [
      {
        "description": "Agent A gestures to Agent B to join them in a board game.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent C about their painting.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.3,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent B look through an old photo album together.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a family art project.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers to explain complex book concepts to Agent B.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.2,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests updating a dusty scrapbook with family memories.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts an impromptu dance.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.9,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A asks to try painting with Agent C.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up refreshments for the group.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Inside a living room, Agent A repots a plant, Agent B knits, and Agent C works on a jigsaw puzzle. A breeze turns pages of a travel book, prompting Agent A to contemplate and then engage with others over the contents.",
    "actions": [
      {
        "description": "Agent A joins Agent C in puzzle making and conversation.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A explores a world atlas with Agent C.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.6,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A plans a themed night with Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts a storytelling session.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A plays with a skill toy.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a home cultural project.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shows interest in Agent B's knitting.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A leads a collaborative sketching activity.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A discusses creating an indoor garden.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen experimenting with recipes for her new cookbook. Agent B is flipping through a family photo album, and Agent C is working on a school project. The atmosphere is encouraging and collaborative.",
    "actions": [
      {
        "description": "Agent A examines the photo album with Agent B.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A samples the new dish with her family.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C by setting up a mini herb garden.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.4,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a family cooking night.",
        "values": [
          0.3,
          0.0,
          0.0,
          1.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests recreating old family dishes.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A records a video of the family's reactions.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.9,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A makes a quiz for Agent C on his project.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A starts a kitchen towel 'snowball' fight.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.8,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A and family dance to music.",
        "values": [
          -0.4,
          0.0,
          0.0,
          1.0,
          0.2,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A and Agent B are spending a rainy afternoon in their cozy living room. Agent A is comfortably nestled in an armchair with old books, and Agent B is organizing old family photo albums.",
    "actions": [
      {
        "description": "Agent A decides to read excerpts from a discovered diary out loud, sharing anecdotes about their grandparents' youth with Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes that they use the books to play a game of \"create your own adventure\".",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A sets aside a peculiar-looking book to investigate its origin later.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A takes a closer look at one of the photos that provoked laughter.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A offers to brew new hot chocolate with a fun taste test.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A stretches out on the floor next to Agent B to help organize photos.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A finds a bookmark to frame, and starts looking for a picture frame.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests using the photos to create a new family tree.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A records Agent B's reactions to the photos for a video compilation.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Inside a cozy suburban home, 'Agent A', a freelance writer lounges on a sofa with an antique journal, while 'Agent B' pots plants and 'Agent C' assembles a puzzle.",
    "actions": [
      {
        "description": "Agent A decides to read aloud excerpts from the journal to share intriguing stories.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break from reading, joining 'Agent C' in the puzzle.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes gardening with 'Agent B'.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A fetches refreshments for everyone.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking turns reading the journal.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A discusses historical events from the journal.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.6,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sketches the potted plants.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A organizes the houseplants with 'Agent C'.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A photographs 'Agent C's' puzzle progress.",
        "values": [
          0.3,
          0.0,
          0.0,
          1.0,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is surprised by a backyard picnic organized by housemates Agent B and Agent C to welcome Agent A to their shared home. The picnic includes homegrown vegetables and homemade bread and pastries.",
    "actions": [
      {
        "description": "Agent A picks vegetables from the garden alongside Agent B.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C by setting up the picnic area with plates and cutlery.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game of charades with Agent B and Agent C after eating.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests taking a group photo to remember the day.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A explores the far end of the backyard to see if it’s suitable for future gatherings.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.3,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A expresses gratitude toward Agents B and C, acknowledging the efforts made.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shares a story about his previous home to connect with Agent B and Agent C.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a regular picnic to further bond with the housemates.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A offers to play some music to enhance the ambiance.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is flipping through an old family cookbook in a sunny kitchen, while Agent B chops vegetables, and Agent C sets the table for a traditional meal they have not prepared before.",
    "actions": [
      {
        "description": "Agent A makes bread from scratch using the old recipe book.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shares food-related stories and facts during preparation.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A convinces Agent B to try a new spice in the recipe.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests they switch tasks for an enjoyable cooking process.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A creates a humorous menu from the recipe book contents.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes pictures during cooking for a recipe scrapbook.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A hides positive message notes under plates on the table.",
        "values": [
          0.4,
          0.0,
          0.0,
          1.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A holds a spice tasting blind test.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shares old family photos related to food and gatherings.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is in the kitchen with Agents B and C, surrounded by cookbooks and unfamiliar spices, with a sense of anticipation for a culinary adventure and playful companionship.",
    "actions": [
      {
        "description": "Agent A chooses an unfamiliar recipe to try cooking with Agents B and C.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A encourages sharing favorite cooking disaster stories.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the cooking space.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A notes down recipe adjustments passionately.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A contemplates photo documenting the cooking process.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with a new spice combination.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agents B and C for a playful activity in the backyard.",
        "values": [
          0.2,
          0.0,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A is inclusive, asking for opinions throughout the cooking.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a cozy area to enjoy the meal.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "A teenager, Agent A, returns from school and finds their parent, Agent B, cooking a new recipe, and their cousin, Agent C, sketching. Agent A discovers photo albums meant for an upcoming family reunion.",
    "actions": [
      {
        "description": "Agent A retrieves a photo album from the shelf and begins flipping through the pages.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to view the photo album and share memories.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a small workspace to start crafting a family tree with information from the albums.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A decides to digitize some of the old photographs using their smartphone.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to share stories of relatives who are featured in the photo albums.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a photo guessing game, asking family members to guess the time and context of each photo.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes a photo together with Agent B and Agent C for the family album.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts writing a short biography of a family member based on the stories heard and the albums' content.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that the family should have a themed dinner corresponding with the era of the oldest photos in the album.",
        "values": [
          0.5,
          0.0,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a recent culinary school graduate, invites old college friends, Agent B and Agent C, who are now roommates, to cook and share a complex dinner to explore new recipes and enjoy each other’s company.",
    "actions": [
      {
        "description": "Agent A proposes a toast before they start eating.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests that they make this cooking event a weekly tradition.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A carefully observes Agents B and C's reactions to the first bites.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A offers to teach Agent B a specific cooking technique.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A opens a discussion about everyone's favorite culinary school memories.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a surprise dessert they prepared earlier.",
        "values": [
          0.2,
          0.0,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A looks for feedback on how to improve the dish.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A shares the story behind the selection of tonight’s meal.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to select a recipe for the next cooking gathering.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young artist, is at her family home with Agents B and C, who are engaged in reading and baking respectively. The environment is cozy, filled with creative opportunities and the warmth of family presence.",
    "actions": [
      {
        "description": "Agent A decides to paint a portrait of Agent B while they read, capturing the moment.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A picks up the book on exotic plants and asks Agent B to tell her more about what they're reading.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A sets up an easel in the kitchen to paint Agent C as they bake, engaging in light-hearted banter and sharing memories.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to contribute to a collaborative mural on one of her studio walls.",
        "values": [
          0.7,
          0.0,
          0.0,
          1.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a spontaneous photo session with Agent B, taking candid shots as they explore the garden.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C decide to have an impromptu picnic in the backyard with homemade treats from Agent C's baking session.",
        "values": [
          0.2,
          0.0,
          0.0,
          1.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A begins to sketch a new design idea, feeling inspired by the ingredients Agent C is using and asks for their input.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the living room making it a more inviting space for all to relax and chat.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A takes a break from painting to join Agent B on the couch, flipping through the pages of the plant book together.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a passionate home cook, is preparing a special meal alongside friends Agent B and visiting cousin Agent C in a warm, sunlit living room filled with aromas and soothing guitar music.",
    "actions": [
      {
        "description": "Agent A grabs an old, family recipe book, considering trying a new dish.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to each add an ingredient, making cooking a playful event.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a camera to capture the shared experience.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shares an entertaining story about the recipe's origins.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages sharing stories of memorable meals.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a blindfolded tasting game for the dishes.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to share favorite cuisines and ideas.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A involves Agent B in setting a surprise table for Agent C.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests eating outside in the garden for a more stimulating environment.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Young adult Agent A is preparing an unconventional family meal with partner Agent B and their teenage child Agent C in a cozy kitchen at sunset, surrounded by an array of exotic spices and vegetables.",
    "actions": [
      {
        "description": "Agent A initiates a game where each person adds an ingredient to the dish without telling the others.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a smartphone to record the cooking process, narrating each step.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A suggests they all share a memorable story related to food.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A proposes they each pick a new dish to cook together next week.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a photo album and encourages everyone to add comments.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A starts an impromptu dance by playing an upbeat song.",
        "values": [
          0.2,
          0.0,
          0.0,
          1.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A turns off all the lights and dines by candlelight.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B and Agent C to create the tallest food tower.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.2,
          0.0
        ]
      },
      {
        "description": "After dinner, Agent A plans a group activity that involves building something together.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, has finished his school project and is considering what to do next. Agent B, his younger cousin, is visiting and drawing in her notebook. Meanwhile, Agent C is practicing guitar in the living room. The setting is homely and comfortable with personal interests of Agent A visible on his walls.",
    "actions": [
      {
        "description": "Agent A decides to join Agent B and offers to help with her sketch, suggesting a collaborative art piece.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A picks out a book from his shelf and shares facts with Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to rearrange and redecorate the room together with Agent B.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests an impromptu jam session with Agent B and Agent C.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A discusses sketch inspiration and techniques with Agent B.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to a video call with a friend from a marked place on the map.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A challenges Agent B to a competition with building blocks.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A searches for DIY science experiments to do with Agent B.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A looks for recipes for a snack to make together with Agent B.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a child, assembling a jigsaw puzzle, invites Agent B, their parent, to participate. Agent C, the family cat, observes and occasionally interacts. Agent D, the other parent, is cooking in the kitchen.",
    "actions": [
      {
        "description": "Agent A invites Agent B to join in on the puzzle.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A starts to organize the puzzle pieces by color and shape.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.2,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A decides to create a story about the picture on the puzzle.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A gently nudges Agent C away from the puzzle pieces.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.1,
          -0.3,
          0.0
        ]
      },
      {
        "description": "Agent A tries to fit a puzzle piece persistently.",
        "values": [
          0.3,
          0.0,
          0.0,
          -0.4,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A expresses a desire to frame the completed puzzle.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A stands back to admire the puzzle work done so far.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.6,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to place the last piece of the puzzle.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.3,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a break and to help in the kitchen.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A hosts a family gathering at her home with Agent B, her cousin, and Agent C, her childhood friend. They're in a cozy living room surrounded by board games, a guitar, and memorabilia.",
    "actions": [
      {
        "description": "Agent A shares old family pictures with Agent B and Agent C, reminiscing about past events.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a strategic board game for group participation.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plays a familiar tune on the guitar, inviting others to sing along.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A practices and shows card tricks to Agent B and Agent C.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to mark visited places on a world map.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a new puzzle to solve together.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A discusses planning a shared future trip with B and C.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent B teaches a few words of a foreign language they learned.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes cooking a new recipe together.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a culinary hobbyist, is in a kitchen full of cooking potential, contemplating a new dish to make. Agent B is reading a book on desserts and sharing interesting tidbits, while Agent C is tenderly caring for an herb garden by the window.",
    "actions": [
      {
        "description": "Agent A decides to create an intricate dessert recipe from Agent B's book to surprise the household.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A starts a playful competition with Agent B to see who can plate their dessert more artistically.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C for advice on which fresh herbs from the garden could be incorporated into their dessert for a unique twist.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A carefully documents their dessert-making process with the intention of sharing it with their culinary blog followers.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to taste-test various components of the dessert to refine the flavors together.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a cozy corner in the living room with cushions and soft music, planning a dessert tasting session for everyone.",
        "values": [
          0.4,
          0.0,
          0.0,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes to record the tasting session as a memory for the family.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A carefully selects the most aesthetically pleasing tableware to enhance the overall presentation of their creation.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A shares a few heartfelt words of appreciation for the support and company of Agents B and C before they all try the dessert.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is seated at the dining table with a cookbook, while a birthday cake awaits decoration. Agent B is reading, and Agent C is playing music, setting a pleasant ambiance in the home.",
    "actions": [
      {
        "description": "Agent A decides to decorate the cake with an intricate design that they've never tried before.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A organizes an impromptu game to play with Agent B and Agent C.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A pulls out a scrapbook to compile memorable photos and notes.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.6,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A plays a beloved song on the guitar.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A involves everyone in sharing past holiday memories.",
        "values": [
          0.3,
          0.0,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A takes a group photo to commemorate the celebration.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to help with cake decoration.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A seeks Agent C's input on a surprise gift for Agent B.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to dance with the music played by Agent C.",
        "values": [
          0.3,
          0.0,
          0.0,
          1.0,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A finds an old family photo album and starts going through it. Agent B observes with interest and begins to share stories behind the photos. Agent A shows a keen interest in learning more about their family history, while Agent C also gets drawn into the conversation.",
    "actions": [
      {
        "description": "Agent A asks Agent B to retell a particularly funny family story.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests creating a family tree.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a theme night to recreate an old family photo.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A decides to digitize the old family photos.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family trip to a location from the photos.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a guessing game about the stories behind photos.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A records Agent B's stories as an audio-memory book.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A shares a personal story with Agent B and C.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to imagine the stories behind selected photos.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is coordinating a special indoor treasure hunt for his family, capturing the moments and setting up clues around the house that encourage problem-solving and exploration. Agent B and Agent C are engaged in solving riddles and searching for clues.",
    "actions": [
      {
        "description": "Agent A hints at the location of a clue with a clever riddle.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes candid photos of Agent B and Agent C.",
        "values": [
          -0.4,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares an excited high-five with Agent C.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A recalls past treasure hunting adventures.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A steps back to allow Agent C to lead the search.",
        "values": [
          -0.5,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the final treasure as a framed family picture.",
        "values": [
          -0.6,
          0.0,
          0.0,
          1.0,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent B decipher a complicated riddle.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A prepares a cozy corner with snacks and refreshments.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A slips in a mystery book into the final treasure.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          -0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home on a relaxed Saturday morning, Agent A is experimenting with a new breakfast recipe in the kitchen. Agent B is seated at the dining table, while Agent C watches over the counter as they all engage in light conversation.",
    "actions": [
      {
        "description": "Agent A shares the story behind the chosen breakfast recipe with Agent B and Agent C.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent C a taste of the freshly made batter for feedback.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to participate in the cooking process.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up the dining table with attention to detail.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A comes up with a mini-game related to guessing the ingredients.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation about everyone's favorite meals.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A plans a surprise element for the meal.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A takes a photo of the family enjoying the meal.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests the next meal be a collaborative effort.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "A young parent, Agent A, creates a family photo album with their partner, Agent B, who finds old letters, and their child, Agent C, plays with a puzzle.",
    "actions": [
      {
        "description": "Agent A decides to create a dedicated section in the album for notes and postcards uncovered by Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to choose a photo they particularly like to place in the album next.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests the family to make a collective art piece using some of the photos for the album cover.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A sets up an area with craft supplies for Agent B and C to design their own pages in the album.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A proposes that they take a new family photo right then, to place at the end of the album.",
        "values": [
          0.3,
          0.0,
          0.0,
          1.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A starts a conversation with Agent B about planning another family trip similar to the ones in the photographs.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C about their favorite memory from the trips and discusses what made it special for them.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A shares a particularly touching or funny family story inspired by one of the photos with Agent B and C.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to tell a story about what's happening in the picture of the completed puzzle.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Teenage Agent A explores an old family photo album, encountering a photo of themselves with Agent B at an unknown beach, sparking interest and prompting a conversation with Agent B, who's knitting, and Agent C, who is doing a puzzle.",
    "actions": [
      {
        "description": "Agent A asks Agent B about the unfamiliar beach photo and expresses a desire to learn more about it.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C collaborate to organize the old photos by year and theme to create a timeline of their family's history.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B and Agent C to visit the beach in the old photo together.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a map and proposes they work together to locate the beach from the photo.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers to make drinks for everyone as they continue to browse through the album.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A takes the initiative to digitize the photos and share them with extended family members online.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A searches online for information about the beach from the photo to understand its significance to the family.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to share individual memories from past family trips.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A decides to start a new family album with photos and stories from every member, starting with the beach photo.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is lounging in a living room full of books. Agent B is organizing family photo albums. Agent C brings in a dusty box with trinkets and objects from the attic.",
    "actions": [
      {
        "description": "Agent A joins Agent B with the photo albums and engages in conversations about them.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C decide to explore the box's contents and learn about their history.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes an art project based on the trinkets to Agent C.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A brings out a map and suggests they learn about the culture of the country related to an object.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A brings tea to Agent B and helps with the photo albums.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A initiates making a new scrapbook with Agent B.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A is intrigued by a gadget and suggests making one with Agent C.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A and Agent C create a family timeline for the hallway.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, enters the living room where Agent B, their parent, is looking at a photo album and Agent C, the family cat, is napping. There's a jigsaw puzzle on the table and a smell of baking in the air.",
    "actions": [
      {
        "description": "Agent A picks up a piece of the jigsaw puzzle and tries to find its place.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.4,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B about a particular photo in the album, prompting a story.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A fetches the dessert from the kitchen to share with Agent B.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes interest in the baking recipes lying on the kitchen counter.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.3,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A gently wakes Agent C for a playful interaction.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.6,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A drapes a blanket over themself and Agent B as a comforting gesture.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A plays a piece of music on the piano, turning the performance into a shared experience.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes out drawing supplies and starts sketching the serene scene out the window.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A snaps a picture of Agent C sleeping in the sunlight to capture the moment.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy suburban home, teenage Agent A sets up to paint, inspired by the tranquility of a quiet Sunday morning. Agent B, A's cousin, flips through a photography book, while Agent C, A's parent, prepares brunch in the kitchen. A warm, collaborative mood fills the atmosphere as the agents engage with each other's creative endeavors in the living room.",
    "actions": [
      {
        "description": "Agent A asks Agent B to sit for a portrait, suggesting a collaboration project between painting and photography.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A arranges a variety of household objects for a still life, seeking composition ideas from Agent B.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A discusses different artistic techniques from a photography book with Agent B, exploring new painting ideas.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A decides to paint a family photo, sharing memories with Agents B and C.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sketches and shares preliminary ideas with Agents B and C, encouraging interactive feedback.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with the brunch preparations to bond and spend quality time together.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A opts to paint the outdoor view, opening the window to better engage with the environment.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A and B create a mixed media piece, integrating painting and photography.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A imparts basic painting techniques to Agent B, enriching their collaborative work.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a living room, Agent A discovers an old family scrapbook. Joined by Agent B, his grandmother, and Agent C, his aunt, they share memories and anecdotes about the family history contained within the scrapbook.",
    "actions": [
      {
        "description": "Agent A creates a digital version of the scrapbook to preserve the memories.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B for childhood anecdotes for the scrapbook.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A restores a damaged photo of the family.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A plans a family get-together to share the scrapbook.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A sets up a video call with distant family members for the scrapbook.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A gathers information on preserving old documents.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A experiments with scrapbooking techniques.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A extends the scrapbook with his own memories.",
        "values": [
          0.5,
          0.0,
          0.0,
          1.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A creates a space for relatives to add to the scrapbook.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a young adult, is sitting in the living room of a cozy family home, thumbing through an old photo album. Agent B, a close cousin, lounges nearby, showing interest in the album, while Agent C, a childhood friend, sets up a board game. The atmosphere is congenial, warm, and inviting.",
    "actions": [
      {
        "description": "Agent A engages Agent B in a conversation by sharing an amusing story behind a picture in the album.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to join them in looking through the album and recounting shared memories.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests starting the board game that Agent C has set up, expressing eagerness to learn the rules.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A offers to document the board game session with a series of photos, capturing the laughter and competitive spirits.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B about the melody they were humming and expresses an interest in the music.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A decides to start a collaborative playlist where everyone can add their favorite songs.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A playfully challenges Agent C to a friendly and spirited debate on a topic from a picture in the album.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.3,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A seeks out family recipes, suggesting they cook a nostalgic meal together later in the evening.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to share an anecdote from their perspective about a family event in the album.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A is a teenager lounging in the living room with a sketchbook, while Agent B, the cousin, is reading a novel. The environment is cozy and full of family memorabilia that stirs memories and an eagerness to engage together.",
    "actions": [
      {
        "description": "Agent A sketches the mountain view from a photograph, adding imaginative elements.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares the new sketch with Agent B, reminiscing about the trip.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a mini book club discussion based on Agent B's novel.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to collaborate on a fantasy story using doodles.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A compiles and shares a playlist of mood-matching songs for sketches.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A sets up an indoor picnic with the sketch as a centerpiece.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A fetches art supplies for a joint art session with Agent B.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to read some of the novel aloud.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A suggests playing a board game for a fun challenge.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In the living room, 'Agent A' finds old family recipes, 'Agent B' is reading, while 'Agent C' watches 'Agent A' with a smile. There's a warm atmosphere with sunlight and a scent of baking.",
    "actions": [
      {
        "description": "'Agent A' selects an old recipe to prepare as a family surprise.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "'Agent A' gathers ingredients, finding some are missing.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "'Agent A' asks 'Agent B' for ingredient alternatives.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.7,
          0.0
        ]
      },
      {
        "description": "'Agent A' and 'Agent C' cook the meal together.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "'Agent A' documents the cooking process with photos.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "'Agent A' prepares the dining table with special touches.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      },
      {
        "description": "'Agent A' plays a family favorite song during cooking.",
        "values": [
          0.2,
          0.0,
          0.0,
          1.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "'Agent A' notes down the recipe changes and personal thoughts.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "'Agent A' invites sharing of family meal stories.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          1.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A joins Agent B in the kitchen, where B is cooking a new recipe and Agent C is watching. The atmosphere is cozy, with music and the scent of spices in the air.",
    "actions": [
      {
        "description": "Agent A helps Agent B with chopping vegetables, learning about the new recipe.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets the table with special care.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a game of charades with the family.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C to choose the evening dessert.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the kitchen after dinner.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to share childhood stories.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.4,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a post-dinner family walk.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A wants to start compiling a family cookbook.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.3,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a weekly family cooking night.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, an 8-year-old child, is exploring a new science kit on a sunny morning in the living room, with the assistance of Agent B, their parent, and under the watchful eye of Agent C, the grandparent. Emotions are positive, and there's an atmosphere of shared enjoyment and educational exploration.",
    "actions": [
      {
        "description": "Agent A decides to perform the first experiment about magnetism and shares their plan with Agent B and Agent C.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A carefully assembles the necessary pieces for the magnetism experiment, following the kit manual intently.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A, filled with excitement, shows Agent B the result of the successful experiment.",
        "values": [
          0.6,
          0.0,
          0.0,
          1.0,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent C for stories about their experiences with science in school.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A offers to explain how the magnetism works to Agent C to share the knowledge.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A suggests to Agent B they should record a video while conducting the next experiment.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B to take part in conducting the next experiment together for a shared experience.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A expresses desire to visit a science museum to learn more about experiments you can do at home.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.7,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A asks Agent B to take photos of the completed experiment to show to friends.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.9,
          0.5,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy, sunlit kitchen, Agent A finds a vintage cookbook and, along with Agents B and C, decides to explore its recipes and spend the afternoon baking together.",
    "actions": [
      {
        "description": "Agent A decides to bake the most challenging recipe from the vintage cookbook.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A sets up for a baking afternoon and invites Agents B and C to join in the preparation process.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A begins storytelling, inventing tales about the origins of the recipes in the book.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A turns on some pleasant background music to set a charming ambiance for baking together.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A starts an impromptu baking lesson, teaching how to mix ingredients properly.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a small competition between Agents B and C for cookie decorating.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A tastes a bit of the dough and invites Agents B and C to taste test too.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A creates a fun clean-up game once the baking is done.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A takes photos of the prepared dishes with Agents B and C, creating a memory album.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a cozy kitchen, Agent A tries a new exotic recipe, Agent B assists with anticipation, and Agent C joins in the prep work, contributing to a warm and collaborative environment.",
    "actions": [
      {
        "description": "Agent A suggests a taste test to decide if the new dish needs more seasoning.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites B to add an ingredient of their choice to the recipe, fostering a shared culinary adventure.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.5,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A teaches C a dance move while waiting for the water to boil.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.7,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A searches the shelves for a rare spice.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.4,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a lighthearted game of guessing the origin of the spices used.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.6,
          0.2,
          0.0
        ]
      },
      {
        "description": "Agent A decides to set up a themed table to match the exotic dish.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A chooses to tell a story about the first time they tried a dish like this.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.5,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A creates an impromptu recipe card to note the collaborative twists added to the dish.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A takes pictures of the meal preparation process to share.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a teenager, prepares to try out a new recipe in the kitchen while Agent B reads and Agent C sorts mail. The setting is homely and ripe for engagement and knowledge sharing.",
    "actions": [
      {
        "description": "Agent A asks Agent B to assist with the preparation of the new dish they are attempting to make.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A sets up their smartphone to record the cooking process, hoping to create a vlog.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.3,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A playfully tosses a vegetable towards Agent B to catch their attention and inspire them to join in.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.5,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent C to share a special cooking tip or family recipe that could complement their new dish.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A samples the ingredients, showing a deep appreciation for the flavors.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.4,
          0.3,
          0.0
        ]
      },
      {
        "description": "Agent A turns on music to fill the kitchen with a joyful ambiance while they cook.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.9,
          -0.1,
          0.0
        ]
      },
      {
        "description": "Agent A initiates a quick clean-up of the kitchen space to make the cooking process more pleasant.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.8,
          -0.2,
          0.0
        ]
      },
      {
        "description": "Agent A engages in light-hearted banter with Agent B to make the preparation work more enjoyable.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A tries a new cooking technique they learned online to improve the dish further.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.2,
          0.1,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "In a sunlit kitchen, Agent A decides to turn cooking into an interactive game, involving Agent B and Agent C in a playful family experience.",
    "actions": [
      {
        "description": "Agent A crafts clues related to the new recipes and invites the family to guess the dish.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A includes family in meal preparation, sharing culinary techniques.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A shares a special ingredient and its personal story with the family.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A organizes a pancake decorating contest, encouraging creativity.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.9,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A asks for a shared playlist to enjoy music while cooking together.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.6,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A serves breakfast with descriptions of recipes' cultural origins.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "Agent A surprises the family with a new exotic tea as part of the meal.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.6,
          0.4,
          0.0
        ]
      },
      {
        "description": "Agent A engages with Agent B's crossword, integrating it into the morning games.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.7,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to create themed place settings for breakfast.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "happiness",
      "intimacy"
    ],
    "scenario": "Agent A, a passionate culinary enthusiast, decides to organize a surprise weekend brunch for their family. They discover an antique recipe book and choose to prepare a meal from it. Agent B is absorbed in reading, while Agent C is occupied with a puzzle. Agent A creates a warm, inclusive atmosphere as they prepare to surprise the family with a unique and enjoyable brunch.",
    "actions": [
      {
        "description": "Agent A decides to try a recipe from the antique book intending to share a novel experience with their family.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.6,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to join in the cooking process, perhaps learning old cooking techniques together.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A sets the dining table meticulously with their best dinnerware for the special meal.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.7,
          0.5,
          0.0
        ]
      },
      {
        "description": "During the meal, Agent A encourages conversation about the recipe's origins, sharing family stories.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.8,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A takes a family photo to capture the moment and preserve the shared experience.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.9,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A suggests making the surprise brunch a recurring family tradition.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.8,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A asks for feedback on the meal to improve the experience for next time.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.5,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C with a puzzle, spending quality time together.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.7,
          0.9,
          0.0
        ]
      },
      {
        "description": "Agent A proposes creating a family recipe book with their own recipe adaptations.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.6,
          0.8,
          0.0
        ]
      }
    ]
  }
]