[
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy suburban home, Agent A, surrounded by travel books, discusses with Agent B and Agent C the historical significance of a world landmark depicted in the jigsaw puzzle they are assembling together in the living room.",
    "actions": [
      {
        "description": "Agent A decides to organize an international themed dinner and invites Agent B to plan and prepare it together.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A proposes a family game night with equal participation for all.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A mediates a disagreement during puzzle assembly, ensuring everyone is heard.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a round of storytelling for personal and cultural tales.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A offers Agent B space on the bookshelf for their books.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A helps Agent B with a challenging part of the puzzle.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agent C to share insights about the historical landmark.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A assists Agent B with research on a school project.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agent B to add a personal decoration to the living room.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, an enthusiastic teenager, has invited Agents B and C over for a group study session in a cozy attic filled with various items. An unmarked box is discovered that piques their interest, and Agent A ensures Agent C feels included in the impending exploration.",
    "actions": [
      {
        "description": "Agent A invites Agent C to join them in exploring the attic's contents.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A uses their phone to search for information about box contents.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A encourages sharing personal stories related to the items found.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A suggests returning any personal items to the original owner if possible.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A includes everyone in reading aloud old documents found.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.4,
          1.0
        ]
      },
      {
        "description": "Agent A suggests cataloguing the items to create shared group memories.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A recommends donating historical items to a museum.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A creates an interactive quiz about the items for the group.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A ensures Agent C is given a chance to share their knowledge.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B are two roommates arranging their shared living space. Agent C, their neighbor, visits and they all discuss creating an equitable, efficient living environment.",
    "actions": [
      {
        "description": "Agent A drafts several different floor plan options to see which layout accommodates both their own and Agent B’s needs.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A suggests they use a random selection method to choose who gets to pick the first room decor.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.1,
          0.8
        ]
      },
      {
        "description": "Agent A invites Agent B to research new design ideas together online.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A offers to let Agent B decide on the shared living space theme.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A discusses with Agent B the possibility of assigning shelves.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A volunteers to move their personal items first.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A encourages Agent C to share their outside perspective.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.2,
          0.4
        ]
      },
      {
        "description": "Agent A organizes a small gathering to celebrate the new space.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A proposes they keep a shared document tracking household purchases.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.3,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a sunlit kitchen, Agent A finds an old family recipe book. Agent B shows interest in it, while Agent C, a neighbor, indicates friendly rapport through the window. Ingredients for cooking are present, suggesting an upcoming collaborative activity.",
    "actions": [
      {
        "description": "Agent A carefully reads through the recipe book, attempting to comprehend the history behind each dish.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A decides to cook a dish from the recipe book and asks Agent B to join in the cooking process.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent C to come over and try the dish once it’s ready.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A equally divides the tasks of cooking among everyone.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A suggests documenting the cooking process with photos and notes for everyone.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A allocates the same amount of ingredients to each person’s dish.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A offers Agent B the first taste as a sign of gratitude.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A proposes rotating cooking responsibilities using family recipes.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.6
        ]
      },
      {
        "description": "Agent A takes meticulous notes during cooking for future reference.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.4,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a parent, is at home with their two children, Agent B and Agent C. They are about to play a strategic card game with complex rules and equal chances of winning.",
    "actions": [
      {
        "description": "Agent A decides to allow Agent B to deal the cards for the first round to engage them further in the game.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A suggests rotating the role of dealer for each round to ensure everyone has an equal opportunity.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Upon noticing Agent C's lack of enthusiasm, Agent A invites them to suggest a game modification to make it more exciting.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A deliberately plays a suboptimal move to see if the children notice and learn from it.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.2,
          -0.1
        ]
      },
      {
        "description": "Agent A takes time to ask each child what they enjoy about the game once they've played a few rounds.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A openly expresses their thought process during a tricky part of the game to model strategic thinking.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.4,
          0.1
        ]
      },
      {
        "description": "During the game, Agent A shares a relevant personal story from their youth to foster a deeper connection.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A, noticing that Agent C seems left out, finds a subtle way to compliment their playstyle to make them feel valued.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, is standing in the kitchen before a bulletin board with a new vocabulary list. Agent B is concentrating on a complex puzzle, while Agent C reviews a family photo album. Agent D is baking in the adjacent room.",
    "actions": [
      {
        "description": "Agent A starts posting a word each day on the fridge for the family to learn.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A asks Agent B for help with a difficult word from the list.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.4,
          0.4
        ]
      },
      {
        "description": "Agent A arranges the family pictures in chronological order.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A deliberately leaves the harder puzzle pieces for Agent B.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A suggests setting up a family game night.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A cautiously tries a piece of the baked goods from Agent D.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A proposes that each family member contributes one dish to the meal.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A volunteers to document the family evening.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A draws a map of the family’s various trips.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, found an old family photo album and is sitting in the living room with Agent B and C, who are engrossed in their activities. The room is conducive to interaction, filled with historic family pictures and board games.",
    "actions": [
      {
        "description": "Agent A invites Agent B and C to look at the old family photos, suggesting they could learn more about their heritage together.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A asks Agent B to share any family stories he's been told by relatives from his branch of the family.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A decides to set the album aside and focus on engaging with Agent C and B in a group activity they all enjoy.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A carefully replaces the photographs and notes back into the album to ensure they are preserved for future family members.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A suggests creating a family tree together with Agents B and C to better understand how everyone is related.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A asks Agent B’s permission before showing him the old family notes, respecting his cousin’s personal space while engaging.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A reaches out to gather additional family records from a nearby shelf to compare facts and clear any discrepancies among stories.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A, noticing Agent C feels left out, empathetically shifts the attention towards a more inclusive activity that they can all participate in.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.9,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A observes and participates in activities within a family room setting filled with games and a world map, indicating a blend of strategic thinking and familial bonding.",
    "actions": [
      {
        "description": "Agent A suggests reading the instructions aloud to ensure everyone understands the game’s rules before starting.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A decides to let Agent B take the first turn, demonstrating a recognition of enthusiasm.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A carefully listens and observes Agent B's tactics, learning from his gameplay.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a tactical alliance with Agent B during gameplay.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A resolves a rule disagreement by referring to the rulebook.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A takes a break from the game to offer snacks to Agent B and Agent C.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agent C to join the next round of the game.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A expresses praise for Agent B's clever move in the game.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A finds an old board game in the attic and, together with Agent B and C, discerns how to play it despite missing pieces and an unfamiliar rulebook.",
    "actions": [
      {
        "description": "Agent A searches the attic for any additional pieces or instructions related to the board game.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.3,
          0.4
        ]
      },
      {
        "description": "Agent A decides to document the game play and the rules they create for future reference.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          -0.2,
          0.3
        ]
      },
      {
        "description": "Agent A suggests using an online translation tool to understand the original rulebook.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A takes turns with Agent B and C to lead game sessions, ensuring each has an equal part.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A starts a creative storytelling session inspired by the game's theme.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.8,
          -0.1
        ]
      },
      {
        "description": "Agent A insists on pausing the game to clarify a rule when Agent B seems confused.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A allocates roles and responsibilities equally among all players, including themselves.",
        "values": [
          -0.5,
          0.0,
          0.0,
          0.0,
          0.2,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a suburban home, Agent A finds an old chest in the attic. Downstairs, Agent B and Agent C, A's cousins, are busy with homework. A is drawn to the chest's contents, confident that exploring it with B and C will reveal family history, and insists on shared discovery and equal knowledge gain.",
    "actions": [
      {
        "description": "Agent A calls out to Agent B and Agent C, inviting them to explore the chest with him.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A shows each item to Agents B and C equally.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A suggests researching the origin of an old map.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A proposes selling valuable finds and sharing proceeds.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A encourages B and C to select items they’re drawn to.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A creates an exhibit from the categorized items.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.3,
          0.3
        ]
      },
      {
        "description": "Agent A drafts questions about family history.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A leads a storytelling session with unusual items.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A takes photos and makes an album for B and C.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is a teenager spending their Saturday afternoon with family. Agent B, A's parent, is assembling a bookshelf, while Agent C, a younger cousin, watches. There is a family conflict resolution book and a general atmosphere of cooperative involvement.",
    "actions": [
      {
        "description": "Agent A offers to hold the wooden pieces in place for Agent B.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A asks Agent B and C about the construction process.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A suggests organizing the scattered screws and tools.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A proposes reading the instructions to Agent B.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.4,
          0.4
        ]
      },
      {
        "description": "Agent A retrieves another chair for Agent C.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A encourages Agent C to share their thoughts on shelf placement.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agent C to assist by handing over tools.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A decides to research online for decorative ideas for the bookshelf.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          -0.3,
          0.1
        ]
      },
      {
        "description": "Agent A initiates a discussion about which books to choose for the new shelf.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, an environmental science graduate student, is in the shared living room with roommates Agent B and Agent C. Agent A is intrigued by Agent B's legal artifacts and Agent C's challenging dessert recipe.",
    "actions": [
      {
        "description": "Agent A asks about the artifacts' history, showing interest in their roommate’s experiences.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A helps Agent B organize the artifacts to tell a cohesive story.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A inquires about the origin of Agent C's dessert recipe.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A proposes documenting the baking process with Agent C.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A asks to borrow an artifact to research more about it.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.4,
          -0.1
        ]
      },
      {
        "description": "Agent A brings up a digital photo frame idea for equal display of memories.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A offers to help Agent C with the complex baking recipe.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a 'roommate artefact day' for sharing personal items.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A debates the importance of impartiality in law with Agent B.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a recent university graduate, has moved back into their childhood home and is living with their sibling, Agent B. On a particular day, Agent A discovers an old family photo album in the attic and brings it to the kitchen where Agent B is working on their laptop. Agent A starts flipping through pages and points out memories but notices an unusual picture in the album.",
    "actions": [
      {
        "description": "Agent A suggests sharing the discovery of the unique picture with Agent B to get their perspective.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A decides to call their parents to inquire about the story behind the unusual photo.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A proposes restoring the faded photographs in the album as a surprise for their parents.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A chooses to make a digital copy of the album to preserve the family memories.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A carefully places the photo album back where it was found to respect the family's shared belongings.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A takes a photograph of the unusual picture to perform research on its background.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          -0.2,
          0.1
        ]
      },
      {
        "description": "Agent A engages Agent B in a conversation about the photo album to strengthen their bond.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A refrains from sharing details about the found album with a friend who stops by, citing privacy concerns.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A negotiates with Agent B to help with the digital restoration project, ensuring shared responsibility.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.7,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is a teenager engrossed in a hand-drawn map on the dining room table, with Agent B, their parent, in the kitchen, and Agent C, Agent A's cousin, sitting at the table working on a jigsaw puzzle.",
    "actions": [
      {
        "description": "Agent A creates a treasure hunt around the house with map-related clues.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a globe-trotting game with inventive rules.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A shares unresolved historical questions with Agent C.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A proposes cooperative puzzle completion.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.9,
          0.8
        ]
      },
      {
        "description": "Agent A offers to switch roles with Agent B.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A negotiates better-suited puzzle sections with Agent C.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.8,
          0.9
        ]
      },
      {
        "description": "Agent A brings extra resources to aid the puzzle activity.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A compiles a quiz for family game night.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.9,
          1.0
        ]
      },
      {
        "description": "Agent A includes distant relatives via video call.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Inside a cozy living room, Agents are engaging in leisurely activities with books around. Agent A comes across several intriguing titles and engages with Agent B and C by sharing thoughts, suggesting cooperative activities, and fostering a warm environment for conversation.",
    "actions": [
      {
        "description": "Agent A reads the book summary aloud and asks Agent B for their thoughts on the topic.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A suggests a book exchange system between the cousins.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A proposes to rearrange the reading corner for communal use.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a mini book club session.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A challenges everyone to find a unique book and share why it's worth reading.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A starts a game to guess the book plot from the first line.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.4,
          0.4
        ]
      },
      {
        "description": "Agent A creates personalized bookmarks for Agents B and C.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A expresses an interest in the backstory of the books on Agent C's shelf.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A volunteers to mediate the decision on which new books to add.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, finds an old family album in the living room and initiates an activity with Agent B, a visiting cousin, and Agent C, their parent, to go through it together.",
    "actions": [
      {
        "description": "Agent A proposes that they go through the family album together.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A suggests taking turns to share memories about each photo.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.9
        ]
      },
      {
        "description": "Agent A takes initiative to call a relative from the album.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          1.0,
          0.5
        ]
      },
      {
        "description": "Agent A decides to create digital copies of the photos.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A and Agent B offer to make a family tree.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A starts narrating stories behind the photos.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A replaces the album back on the shelf.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A organizes a quiz based on the stories told.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is a teenager attending a family gathering in the living room, with various activities occurring around them, fostering opportunities for assistance, enquiry, and equitable contributions among family members.",
    "actions": [
      {
        "description": "Agent A approaches Agent C to ask about the book on star constellations, showing genuine intrigue.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A asks Agent D about snack preferences to make sure that everyone's likes and dislikes are accommodated.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A moves to the kitchen to assist Agent D, to share the workload equally.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A fetches a globe and some other resources to help explain some of the constellations to Agent C.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A volunteers to document the progress of the school project and the family gathering to create a memory for everyone.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A begins discussing stars and constellations with Agent C, attempting to learn and connect over shared interests.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A searches for additional resources online to add to the existing information about star constellations in the book.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, is engrossed in old family photo albums. Agent B lounges on the couch, while Agent C organizes family heirlooms.",
    "actions": [
      {
        "description": "Agent A asks Agent B if they know any stories behind the photos.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A carefully removes a fragile, time-worn letter.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A proposes creating a family tree on the wall.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agent C to share stories of the heirlooms.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent B to help organize the photos chronologically.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A suggests to Agent C that they can digitize old family photos.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A offers to take new family pictures.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A asks to call their grandparents for more insight.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A decides to create labels for the family heirlooms.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy suburban home, Agent A is absorbed in a vintage novel, while Agent B sketches and Agent C ponders over a chess game. A sudden leak from the rain catches Agent A's attention, prompting a shift in their afternoon activities.",
    "actions": [
      {
        "description": "Agent A gets up to place a container under the leak to catch the water.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.4,
          0.5
        ]
      },
      {
        "description": "Agent A examines the water stain more closely.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.2,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to help move the furniture.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A goes online to research how to fix a leaky roof temporarily.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.2,
          0.2
        ]
      },
      {
        "description": "Agent A discusses the situation and suggests taking turns mopping up spillage.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A shows interest in Agent B and Agent C's work.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent C to continue the chess game.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A offers to share insights from the novel.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A collaborates on rearranging the living room with Agents B and C.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.9,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, the eldest sibling in a family of four, is doing household chores. Agent B, their younger brother, is studying at the kitchen table, showing solid focus. Agent C, a parent, acknowledges the scene after finishing work. The household shares the aroma of freshly baked pie made by Agent D, the other parent.",
    "actions": [
      {
        "description": "Agent A asks Agent B if they can assist with the math problems, suggesting they tackle the equations together.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A sets the table for four, ensuring uniformity in dinnerware.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.1,
          0.8
        ]
      },
      {
        "description": "Agent A invites Agent B to take a slice of pie, using it as a productivity incentive.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A organizes B's study space while B takes a pie break.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.4,
          -0.1
        ]
      },
      {
        "description": "Agent A brings extra napkins when serving pie, showing thoughtfulness toward Agent C.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A passes on the first slice of pie, letting Agents B and C choose first.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A discusses the value of taking breaks with Agent B.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A makes a study quiz to make learning more exciting for Agent B.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A suggests a short walk post-pie for rejuvenation.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          -0.2
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "The setting is a Saturday afternoon in the home of Agent A, who is organizing the family's book collection into a new bookshelf. Agent B is present and helping, while Agent C, a close friend, arrives with a rare book as a gift. The agents debate on how to arrange and celebrate the book collection, with emphasis on diversity and shared interests.",
    "actions": [
      {
        "description": "Agent A suggests organizing the books to include titles from each genre on every shelf.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A proposes to read aloud the synopsis of Agent C's gift.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A decides to create an alphabetical index of the books for easy access.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A offers to alternate book choices for the book club discussions.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.7,
          1.0
        ]
      },
      {
        "description": "Agent A recommends noting down everyone's favorite genres for collection blending.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a book borrowing system requiring a contributed book in exchange.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A takes notes during book club discussions for documentation.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A designates a special place for rare and unique books.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A crafts a handmade bookmark for Agent C's book.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          1.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college anthropology student, is organizing bookshelves in the living room of a shared house. Agent B, lounging on the couch, has brought over photos and mementos for a project. Agent C, a friend and roommate, just received a mystery board game, enhancing the room's atmosphere of nostalgia and intrigue.",
    "actions": [
      {
        "description": "Agent A takes a break from organizing to join Agent B in looking at old photos and sharing family stories.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A and Agent B create a family tree with anecdotes about relatives.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A proposes all play the new mystery game, ensuring inclusivity.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A expresses interest in the game's mechanics with Agent C.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A explains the context of a family story to a puzzled Agent B.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A helps Agent C prepare snacks, highlighting shared tasks.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a discussion on sharing household chores equitably.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A engages in a strategic discussion about the board game.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, has just finished tidying their room on a weekend. Agent B, their cousin, is studying a world map in the living room, and Agent C, Agent A's younger sibling, is making a new dessert recipe in the kitchen. The home environment is filled with the smell of baking and a sense of familial warmth.",
    "actions": [
      {
        "description": "Agent A approaches Agent B and suggests planning a hypothetical travel itinerary together.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A discusses making international desserts with Agent C.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A proposes to Agent B to exchange knowledge about different places.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A shares an idea of a cultural dinner night with family involvement.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          1.0
        ]
      },
      {
        "description": "Agent A provides constructive feedback to Agent C on the dessert.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A documents the recipe process for a shared memory album.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          1.0,
          0.1
        ]
      },
      {
        "description": "Agent A offers to clean up the kitchen post-baking.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a living room, Agent A and Agent B sit around a table with flags and books on cultural anthropology, while Agent C observes. They are discussing different cultures.",
    "actions": [
      {
        "description": "Agent A proposes a shared digital journal.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.4,
          0.5
        ]
      },
      {
        "description": "Agent A initiates weekly group discussions.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A consults Agent C for their perspective.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A plans a themed dinner.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A uses a video call to connect with an abroad friend.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.3,
          0.3
        ]
      },
      {
        "description": "Agent A drafts borrowing guidelines.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A encourages Agent C to lead a discussion.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A arranges rotating teaching sessions.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In the family kitchen, Agent A stands by a table with photo albums, while Agent B sits illustrating, and Agent C organizes cooking supplies. They explore family history through photos and prepare for dinner, considering each other's preferences and contributions.",
    "actions": [
      {
        "description": "Agent A decides to initiate a project to recreate the grandfather’s garden, involving the family for shared input.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A engages Agent B to collaborate on the garden's design, using Agent B's artistic skills.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent C to share anecdotes from the photo album, learning about unknown faces.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          1.0,
          0.2
        ]
      },
      {
        "description": "Agent A proposes preparing a new dish for dinner with everyone's help.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A offers to set the table, considering everyone's seating preferences.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A ensures all family members' dietary needs are respected when planning dinner.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A suggests taking a vote on which dishes to prepare for dinner.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          1.0
        ]
      },
      {
        "description": "Agent A chooses to document the process of dinner preparation, creating an album of their own.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A respectfully navigates a conversation about dividing kitchen tasks.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is a teenager sitting at the dining table with their family, noticing the unequal distribution of vegetables and contemplating a new puzzle challenge.",
    "actions": [
      {
        "description": "Agent A divides the remaining food equally among family members.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A asks family opinions on a new game, including everyone in the decision.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A offers to help Agent B with homework, showing support.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      },
      {
        "description": "Agent A starts a conversation about a documentary to share thoughts.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A initiates cleaning up dishes, encouraging turn-taking.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A explores the new puzzle, inviting Agent B to join.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          -0.1
        ]
      },
      {
        "description": "Agent A proposes scheduling a family meeting for chore discussion.",
        "values": [
          -0.4,
          0.0,
          0.0,
          0.0,
          0.1,
          0.7
        ]
      },
      {
        "description": "Agent A shows Agent B how to set the table, teaching them.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, has just returned from school and is at the kitchen table while their sibling Agent B prepares a snack. A letter addressed to their parent, Agent C, marked “urgent” is at the countertop. Agent C, who is at work, usually opens their mail, but Agent A feels the responsibility of their welfare and is aware that the letter could be important.",
    "actions": [
      {
        "description": "Agent A decides to carefully open the envelope to check the contents for urgency.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          -0.3
        ]
      },
      {
        "description": "Agent A calls Agent C to inform them about the letter and ask for permission to open it.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.8,
          0.9
        ]
      },
      {
        "description": "Agent A reassures Agent B that they are handling the situation and involves them in the decision-making process.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A places the letter back on the counter, reminding Agent B of the importance of privacy.",
        "values": [
          -0.8,
          0.0,
          0.0,
          0.0,
          -0.5,
          1.0
        ]
      },
      {
        "description": "Agent A and Agent B use the waiting time to create a contingency plan.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A distracts themselves and Agent B with a household task such as cooking dinner.",
        "values": [
          -0.4,
          0.0,
          0.0,
          0.0,
          0.6,
          -0.2
        ]
      },
      {
        "description": "Agent A discusses with Agent B the values of responsibility and trust.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A attempts to create a relaxing atmosphere for Agent C's return.",
        "values": [
          -0.9,
          0.0,
          0.0,
          0.0,
          1.0,
          -0.1
        ]
      },
      {
        "description": "Agent A looks up information online about the organization that sent the letter.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          -0.3,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager with an avid interest in cooking, discovers an old family recipe book and wants to experiment with a dish alongside their roommate, Agent B. They find they only have enough ingredients for one portion, and their other roommate, Agent C, has left a note saying they won't be home for dinner.",
    "actions": [
      {
        "description": "Agent A suggests using available ingredients to try a smaller portion of the recipe.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A proposes they flip a coin to decide who gets to taste the dish first.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          -0.1,
          0.9
        ]
      },
      {
        "description": "Agent A opens a cooking app to find alternative ingredients.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.1,
          0.1
        ]
      },
      {
        "description": "Agent A decides to take detailed notes about the cooking process to share with Agent C.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A sets up to record a video of the cooking process.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A volunteers to go to the store for additional ingredients.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A creates a poll in their shared roommate group chat.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.2,
          0.6
        ]
      },
      {
        "description": "Agent A carefully divides the finished dish into two equal parts.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.4,
          1.0
        ]
      },
      {
        "description": "Agent A saves a small sample of the dish for Agent C.",
        "values": [
          -0.4,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, sits at the dining table with their childhood friend Agent B, and new neighbors Agent C and Agent D, gathered for a collaborative art project. They're surrounded by painting supplies and discuss how to merge their individual styles into a cohesive piece on a large canvas.",
    "actions": [
      {
        "description": "Agent A initiates a discussion where each person explains their artistic choices to include Agent D more in the group activity.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A proposes that they rotate the canvas after each person's contribution to ensure equal space and representation for everyone's artistic input.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A voluntarily picks the last turn, allowing others to choose their preferred spot on the canvas.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A asks Agent C to explain a specific artistic technique unique to their cultural background.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A shares their own painting skills with Agent C, offering a trade of knowledge.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A sets up a system where everyone can vote on the final touches to the art piece.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.2,
          1.0
        ]
      },
      {
        "description": "Agent A encourages Agent D to share a technique they feel less confident about and provides feedback to help them improve.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A reaches out to include feedback from Agent B’s younger sibling, who is watching them, to demonstrate inclusivity.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A ensures that all the tools and materials are equally accessible to everyone at the table.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.1,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a book-loving teenager, finds an old tome in the living room and wants to explore its contents with their cousin, sibling, and parent present.",
    "actions": [
      {
        "description": "Agent A opens the book to read out loud, hoping to share the first story with everyone in the room.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A asks Agent B to draw their interpretation of the first story's setting.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agent C to choose a board game that can be played later, inspired by the themes from the book.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.2,
          0.8
        ]
      },
      {
        "description": "Agent A approaches Agent D to inquire if they know the origin of the book found in the living room.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.3,
          0.3
        ]
      },
      {
        "description": "Agent A proposes to create a story-themed game night using the tales from the book and asks for input from all household members.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A suggests that Agent C place the book on the shelf in a way that respects its apparent age and uniqueness.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A decides to make a hidden corner in the living room for anyone in the household to read and enjoy the book in peace.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      },
      {
        "description": "After discovering interesting facts about the book, Agent A organizes an evening to share these findings with the household.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agents B and C to put together a creative project that involves combining the themes of the book with their art and games.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a recent college graduate, is organizing an old bookshelf in the living room. Agent B, Agent A's parent, enters the room, noticing a family heirloom is in a precarious position. Agent C, Agent A's younger sibling, watches concernedly from the computer desk.",
    "actions": [
      {
        "description": "Agent A places the delicate vase on a higher, more stable shelf.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.1,
          1.0
        ]
      },
      {
        "description": "Agent A rearranges the bookshelf for accessible favorite books.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A invites Agent B and C for memory sharing with a photo album.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          1.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes family trivia nights with an encyclopedia set.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A researches book restoration methods.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A offers to return Agent B’s forgotten diary.",
        "values": [
          -1.0,
          0.0,
          0.0,
          0.0,
          0.9,
          1.0
        ]
      },
      {
        "description": "Agent A cares for each book's condition during cleaning.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A brings a book on a topic of Agent C's interest.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A shares college textbooks with Agent C.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, is in the kitchen rearranging a shared snack shelf to ensure equitable treat distribution. Agent B, their older sibling, holds a new board game, while Agent C, their cousin, doodles at the table, taking interest in the surrounding activities.",
    "actions": [
      {
        "description": "Agent A suggests a family game night, with Agent B's new board game, so they can all learn and play it together.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A decides to make a shared snack log where everyone can sign off when they take something.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.1,
          0.8
        ]
      },
      {
        "description": "Agent A creates a little questionnaire for the family members to understand each other’s favorite snacks and suggests a rotation.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A offers to teach Agent C how to organize items thoughtfully, taking it as an opportunity for cooperation.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A encourages Agent C to share their sketches and ideas, showing genuine interest in their work.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A offers to swap chores with Agent B, allowing them more free time to read the game rules and prepare for family game night.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, an inquisitive teenage book club president, hosts a book club meeting at home with Agents B and C to discuss a novel with a controversial ending.",
    "actions": [
      {
        "description": "Agent A suggests a group search for the interview transcript in his grandfather's study to better understand the book's ending.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A offers to make copies of the transcript once found so that all members can have their reference material.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A decides to facilitate the discussion, allowing every member to voice their opinion.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A proposes to draft a joint letter to the author asking for clarification about the ending.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "After finding the transcript, Agent A reads it aloud to B and C to ensure equal access to the information.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          1.0
        ]
      },
      {
        "description": "Agent A and the others use the transcript to debate and explore different interpretations, extending the meeting.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A recognizes a rare book in his grandfather’s study and shares this discovery with Agents B and C.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Upon coming across different opinions, Agent A mediates to maintain a respectful and balanced conversation.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Considering everyone's schedule, Agent A organizes an extra meeting so that all members can continue their discussion.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy suburban home, Agent A, an astute teenager, and Agent B, A's young cousin, are engaging with books and puzzles related to geography and family history while Agent C, the guardian, takes care of houseplants. They exchange knowledge and collaborate in learning, with an underlying atmosphere of mutual respect and togetherness.",
    "actions": [
      {
        "description": "Agent A offers to help Agent B understand a complex part of the family history in the scrapbook.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A suggests rearranging the living room furniture so everyone can work on the World Map puzzle together.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A decides to organize a family trivia night using the information from the books around them and involve Agent C as a participant.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A carefully records the progress of the World Map puzzle and plans to research each country they place.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A coaches Agent B on how to pot a plant with Agent C, teaching about the responsibility of nurturing life.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A proposes to create a family tree diagram on the chalkboard, which allows Agent B to visualize their lineage and contribute as well.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A discovers an error in the historical facts within the scrapbook and gently corrects it, showing Agent B how to validate information with reliable sources.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          1.0
        ]
      },
      {
        "description": "Agent A earmarks a book for Agent C that they think will be interesting based on previous conversations.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent B to share their ideas on the chalkboard, encouraging collaborative learning.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In the family kitchen, Agent A observes their younger cousin Agent B trying to bake a cake from an old recipe with odd measurements, while Agent C is organizing the pantry.",
    "actions": [
      {
        "description": "Agent A suggests to Agent B to look up a conversion chart online for better understanding of old measurements.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.4,
          -0.2
        ]
      },
      {
        "description": "Agent A helps Agent B to measure out the ingredients ensuring balanced mix.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A initiates a taste test with Agent B and C for a universally enjoyable flavor.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A engages Agent B in an experiment with a new ingredient that could enhance the flavor.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.5,
          -0.1
        ]
      },
      {
        "description": "Agent A offers to clean up after baking as a sign of consideration for Agent C's efforts.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A and Agent B decide to distribute the cake equally among all family members.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A searches for a unique presentation idea for the cake.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A asks Agent C for family recipes and stories, showing interest in culinary heritage.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A encourages Agent C to join the baking, fostering a collaborative spirit.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a suburban family home, the kitchen bustles with activity as Agent A, a university student, coordinates a meal preparation with Agent B, a cousin, and Agent C, a family friend. The evening revolves around sharing a unique cuisine, blending different ingredients and spices brought by Agent C from their travels.",
    "actions": [
      {
        "description": "Agent A suggests everyone takes turns adding an ingredient to the pot, to value everyone's participation.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          -0.1,
          0.9
        ]
      },
      {
        "description": "Agent A creates a dish that combines elements from everyone’s favorite recipes.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A encourages Agent C to share their travel stories during the cooking process.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A documents the cooking process for future replication.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          -0.2,
          0.3
        ]
      },
      {
        "description": "Agent A sets up a tasting station for collective seasoning input.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.1,
          0.7
        ]
      },
      {
        "description": "Agent A organizes a blind taste test game.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.2,
          0.2
        ]
      },
      {
        "description": "Agent A creates a warm ambiance at the table for shared experiences.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A offers a sympathetic ear to Agent B’s work concerns.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          1.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites everyone to sign the newly created recipe card.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          -0.1,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A notices a new board game and is interested in exploring its mechanics with their roommates, Agent B and Agent C.",
    "actions": [
      {
        "description": "Proposes to play the board game to explore its rules and strategies together.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Suggests rotating the role of the game leader to ensure everyone gets a chance to lead.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Teasingly challenges Agent B to explain the most complex rule to everyone.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.4,
          -0.2
        ]
      },
      {
        "description": "Brings snacks from the kitchen for all, enhancing the enjoyment of the game.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Actively encourages Agent C to join the game, underlining the shared fun.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Enthusiastically proposes a discussion about the game's mechanics after playing.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Defers their turn to Agent C to help them gain confidence.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Ensures all players' voices are heard when discussing strategies.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In the family living room, Agent A observes Agent B struggling with a school project about the family tree and Agent C playing with a puzzle. The environment is ripe for Agent A to engage in supportive actions that involve teaching, sharing, and learning collectively.",
    "actions": [
      {
        "description": "Agent A picks up the incomplete family tree sketch from Agent B and suggests looking through the family album together to find the missing information.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A decides to call a relative to ask about the more distant members of the family tree for Agent B's project.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A joins Agent C on the floor and assists in searching and arranging the puzzle pieces, while pointing out how each piece plays a crucial role regardless of its size.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A organizes a family meeting to discuss and compile a more comprehensive family tree and stories about each member for Agent B's project.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A offers Agent C a turn in choosing the next family activity to ensure all voices are heard and valued.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent B to present the findings from the family history project to extended family members via video call to involve them and validate Agent B’s efforts.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.9,
          0.8
        ]
      },
      {
        "description": "Agent A shares a difficult to place puzzle piece with Agent C, even if it means they'll complete the puzzle they had been working on alone.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A listens respectfully as Agent B expresses concerns about gathering family information that might be sensitive, showing consideration for the feelings of all involved.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.5,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A uncovers an old box with collectible items in the living area, which piques the interest of Agent B and Agent C, leading to a series of choices embracing shared learning, community building, and equal participation.",
    "actions": [
      {
        "description": "Agent A catalogs the collectible items, looking to uncover their history.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A organizes an evening exhibition for roommates to share knowledge about the collectibles.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A initiates a communal display space for the items.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A researches the significance of the collectibles.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.2,
          0.4
        ]
      },
      {
        "description": "Agent A establishes a group narrative activity with items to foster connection.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A creates an agreement for the use of collectibles among roommates.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A collaborates with roommates to document item details for equal contribution.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.8,
          0.9
        ]
      },
      {
        "description": "Agent A investigates rightful ownership or sentimental value that may warrant returning items.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A photographs the items for shared digital access among roommates.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B find a locked chest and board game in the attic, stirring up Agent A's eagerness to learn about family history and creating an opportunity for connection.",
    "actions": [
      {
        "description": "Agent A proposes to respectfully ask their grandparents about the chest to view contents together as a family.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A decides to research the board game online to find out how it's played and history.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          -0.2,
          0.1
        ]
      },
      {
        "description": "Agent A initiates a conversation about setting up a family game night to play the board game.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          1.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests creative ways to find the chest key, like a treasure hunt with clues.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A chooses to leave the chest alone for now and focus on the board game, respecting Agent B's concerns.",
        "values": [
          -0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          1.0
        ]
      },
      {
        "description": "Agent A brings up creating a shared family album for everyone to add to and look through.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A carefully cleans the board game before they play to preserve its condition.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A documents learning and playing the board game with Agent B to share the experience with their family.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A creates a story about the chest's contents based on family folklore to entertain Agent B.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A discovers a new flower in the shared family garden and becomes intrigued. Agent B is sketching nearby, and Agent C is taking care of other plants. Agent A ponders over the flower's origin and considers involving the family for more information.",
    "actions": [
      {
        "description": "Agent A inquires about the new flower with Agent B.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A and Agent B research the flower together online.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A suggests creating a plant booklet with Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A extracts a specimen of the flower.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          -0.2,
          -0.1
        ]
      },
      {
        "description": "Agent A calls a family meeting to discuss the flower.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A offers to help Agent C with the gardening.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A logs the flower's details in the garden journal.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.2,
          0.3
        ]
      },
      {
        "description": "Agent A seeks advice from a local gardening expert.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          -0.1,
          0.2
        ]
      },
      {
        "description": "Agent A plans the removal of the invasive flower.",
        "values": [
          -0.5,
          0.0,
          0.0,
          0.0,
          -0.3,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A discovers an old box with family memorabilia in the attic while Agent B calls out for dinner help and Agent C observes.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to explore the attic findings, engaging in a family bonding activity.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A respectfully asks for more time to explore the box's contents before helping with dinner.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          -0.4,
          -0.2
        ]
      },
      {
        "description": "Agent A balances their time by helping with dinner before examining the box's contents with the family.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A examines the box in private, planning to share the findings at a later family gathering.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          -0.6,
          -0.5
        ]
      },
      {
        "description": "Agent A brings the box downstairs for a storytelling session led by Agent C.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A ignores dinner preparation, focused solely on the photos and letters.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          -0.7,
          -0.8
        ]
      },
      {
        "description": "Agent A suggests creating a family tree as a post-dinner activity, after assisting with dinner.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A is overwhelmed and avoids the contents by focusing on the dinner routine.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A seeks Agent B’s input on the importance of exploring their heritage and requests to postpone dinner.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A begins a coordinated project to redesign a spare room with Agents B and C, seeking to balance everyone's desires. They unlock a cabinet and find family memorabilia, leading to shared exploration and memories.",
    "actions": [
      {
        "description": "Agent A initiates a group discussion with Agents B and C to decide on the best way to use the room.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A invites Agent B and C to contribute their ideas on the room's design, ensuring equal contribution.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A unlocks the old cabinet with keys upon agreement with Agent B and C.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.3,
          0.4
        ]
      },
      {
        "description": "Agent A proposes to share the family photographs and letters with Agents B and C, to understand more about the family history.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A suggests digitizing the discovered photos and letters so everyone can have access.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A decides to install a whiteboard in the room for all to leave messages and schedule changes.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A helps Agent B set up a study corner with minimal distractions.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A offers to lead a joint effort to create a calm meditation corner that Agent C showed interest in.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is preparing a communal meal in the kitchen with Agents B and C. Agent B introduces a trivia game and Agent C finds a new recipe for dessert.",
    "actions": [
      {
        "description": "Agent A suggests using a new spice mixture recipe found online to enhance the meal's flavor.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agents B and C to join in the meal preparation, dividing tasks equally.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A questions the source of the trivia facts to ensure the information's accuracy.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.1,
          0.6
        ]
      },
      {
        "description": "Agent A brings a globe from their room to the kitchen for a more interactive trivia experience.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.2,
          0.3
        ]
      },
      {
        "description": "Agent A listens and gives constructive feedback to Agent C's idea about the dessert recipe.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A offers to document the trivia session’s discussions and learning points.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A volunteers to fetch some ingredients from the garden, sharing the bounty with B and C.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A talks about the cultural significance behind the dishes they are preparing.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager with an inquisitive nature, is at home with their two cousins, Agent B and Agent C. Agent A has found an old board game and suggests playing it together in the living room.",
    "actions": [
      {
        "description": "Agent A carefully explains the game rules to Agents B and C to ensure equal understanding.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A proposes they use an online resource to learn more about the historical context of the game.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.2,
          0.1
        ]
      },
      {
        "description": "Agent A asks for opinions on how to allocate game pieces not chosen by players.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A encourages Agent B to make the first move in the game.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A shows an interesting trick on the game board.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          -0.3,
          -0.1
        ]
      },
      {
        "description": "Agent A suggests taking a group photo with the game board.",
        "values": [
          -0.4,
          0.0,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A initiates a discussion about the game strategy.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A offers to pause the game to prepare snacks for everyone.",
        "values": [
          -0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a warm and well-lit kitchen, Agent A and their roommates, Agents B and C, sit around a dining table with board games and homemade snacks, ready for an evening of gaming and companionship. With a shared interest in new experiences, they prepare to engage in a novel board game none have played before.",
    "actions": [
      {
        "description": "Agent A suggests rotating the role of the game master.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A offers to read the complex rulebook out loud.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A decides to set up a leaderboard to track everyone’s progress.",
        "values": [
          -0.4,
          0.0,
          0.0,
          0.0,
          -0.2,
          0.9
        ]
      },
      {
        "description": "Agent A checks with Agent B and Agent C about a rule's interpretation.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a collaborative strategy for the new game.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A expresses genuine interest in learning how Agent C prepared the snacks.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.8,
          -0.2
        ]
      },
      {
        "description": "Agent A initiates a discussion about which genre of board games they enjoy the most.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.9,
          -0.1
        ]
      },
      {
        "description": "Agent A volunteers to clean up after the game night.",
        "values": [
          -0.5,
          0.0,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A comforts Agent B over frustration with the game.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, an amateur chef in her early thirties, is experimenting with recipes in the kitchen of her shared apartment. Agent B, her flatmate and a keen environmental advocate, is sorting the recycling. Agent C, a mutual friend and a local school teacher, has dropped by for a visit and is lounging on the couch with a book. The atmosphere is casual and friendly, with a hint of excitement from Agent A as she attempts a new dish for everyone.",
    "actions": [
      {
        "description": "Agent A tastes her dish and decides to adjust the ingredients to better suit the taste preferences of Agent B and Agent C.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A asks Agent B for some vegetarian recipe ideas for future meals that they could prepare together.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a conversation with Agent C about a new book on culinary techniques.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.4,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to join in the cooking process and give their input on the recipe's flavor and presentation.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A proposes to share the meal with a less fortunate neighbor, ensuring they also get to enjoy a warm dinner.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A sets aside a portion of the meal to bring to another friend who couldn't make it to the gathering.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A starts a game of guessing the ingredients to engage Agent B and Agent C in her cooking experiment.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A enquires about Agent C's new educational initiative and discusses how they can incorporate food knowledge into it.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A searches online for a community cooking class where they could all participate and learn together.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager with a passion for cooking, intends to prepare a traditional family recipe but needs a rare spice not available in their pantry. Agent B, their parent, is busy with indoor gardening but supportive. Agent C puts aside their novel to suggest a market trip for the spice.",
    "actions": [
      {
        "description": "Agent A searches online for a specialty store for the spice.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          -0.2,
          0.4
        ]
      },
      {
        "description": "Agent A asks Agent C to join them at the market.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent B for a joint trip to the market.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A considers a mail-order purchase involving everyone's opinion.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A plans a family event to share the recipe's heritage.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.9,
          0.6
        ]
      },
      {
        "description": "Agent A involves Agent B in the cooking process for bonding.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          1.0,
          0.1
        ]
      },
      {
        "description": "Agent A opts to wait for the correct ingredients before cooking.",
        "values": [
          -0.4,
          0.0,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A documents the cooking process.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A encourages family feedback on the dish.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, is at home preparing a cozy dinner with their two roommates, Agent B and Agent C. They’re bonding over sharing favorite recipes and discussing unfamiliar ingredients, while also ensuring that everyone’s preferences and voices are accounted for in the cooking process.",
    "actions": [
      {
        "description": "Agent A proposes to make a collective list of ingredients that everyone would like to try in the future.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A sets up a system where each roommate gets a chance to present their dish, explaining its significance to them.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A volunteers to keep a shared digital folder of all recipes and modifications done by the group, for future reference and learning.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A decides to initiate a conversation about everyone's food preferences to avoid potential conflicts in the future.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A offers to divide the tasks equally to ensure that everyone participates and has an input in the meal's preparation.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A documents the cooking session with photographs, commenting on the techniques and combinations they discover together.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A encourages each roommate to give feedback on the meal so they can improve their collective cooking skills.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A takes the initiative to organize a schedule for future meals where they can explore other new dishes.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, is in the living room with Agent B, their cousin of the same age, and Agent C, their younger sibling. The dining table is covered with a large, incomplete jigsaw puzzle depicting an intricate world map. Agent A is meticulously searching for the pieces that fit in the Asia region of the puzzle, while Agent B seems disinterested, casually glancing at their phone. Agent C is eagerly trying to contribute by sorting pieces by color and shape on the side. Agent A notices a slight argument brewing between Agents B and C over the best approach to the puzzle.",
    "actions": [
      {
        "description": "Agent A invites Agent B to join in and offers clues to find the right pieces, making the task more engaging.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A asks Agent C to share their strategy for sorting, incorporating their idea into the overall puzzle strategy.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A suggests a team rotation so each person gets to work on different parts of the puzzle.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A takes a short break with Agents B and C to discuss fascinating facts about the countries on the puzzle, encouraging collaborative learning.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A sets up a collaborative reward that they can all enjoy once the puzzle is complete, ensuring everyone feels motivated.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A proposes to take a photo of the work-in-progress puzzle and share it with family to show their collective effort.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A resolves the argument by encouraging a compromise that honors both Agent B's and Agent C's methods.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          1.0
        ]
      },
      {
        "description": "Agent A explains the importance of everyone participating equally and ensures Agent B is included.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "A cozy living room is shared by Agent A, who is engaged with a puzzle, Agent B, who is reading a detective novel, and Agent C, who is sorting his stamp collection. Each is comfortably preoccupied with their interests, and the environment suggests an opportunity for a harmonious evening of sharing and engagement.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to solve the newspaper puzzle together, with the idea to frame it upon completion.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A proposes crafting a new detective story based on Agent B's book, engaging the family in the process.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A organizes a show-and-tell around Agent C’s stamp collection.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A and Agent B work together to create a reading list for the family book club.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A discusses next family vacation plans, encouraging contributions and a democratic decision.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A involves Agents B and C in deciding the dinner menu, accommodating everyone's taste.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.8,
          1.0
        ]
      },
      {
        "description": "Agent A sets up a debate with a topic from his newspaper for everyone to share their viewpoints.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A introduces a new board game, explaining it rewards strategic thinking, enticing Agent C.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A suggests rearranging the living room with Agents B and C for a new shared environment.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, while organizing old family photographs, encounters a mysterious old photo, piquing interest from both Agent C and visiting family friend Agent D. Agent B, occupied with household repairs, is also present in the scenario.",
    "actions": [
      {
        "description": "Agent A asks Agent C to look for similar landscapes on the internet to identify the location in the photograph.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Alternate with Agent B fixing the squeaky cabinet hinge.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Engage Agent D for insights on the photo.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Record the conversation for nostalgic value.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Suggest collective decision-making for the photo’s fate.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.9,
          1.0
        ]
      },
      {
        "description": "Carefully move Agent C's jigsaw puzzle.",
        "values": [
          -0.5,
          0.0,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Offer to scan and upload the photo online for info.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          -0.1,
          0.5
        ]
      },
      {
        "description": "Offer to frame and hang the photo in a common area.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Propose visiting the local historical society.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager with a keen interest in culinary arts, is at home in the kitchen with Agent B, their younger cousin, and Agent C, their guardian. The kitchen is lively with a family cooking activity involving an old family recipe, sharing stories and distributing tasks.",
    "actions": [
      {
        "description": "Agent A asks Agent C to share the story behind the cherished family recipe.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A allows Agent B to participate in prepping for simpler tasks.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A meticulously divides the final dish into equal portions for everyone.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.1,
          1.0
        ]
      },
      {
        "description": "Agent A suggests creating a rotating schedule for recipe selection.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A writes down the steps taken and shares with Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A consults with Agent C before altering the recipe.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A proposes all to taste before final seasoning.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent C's input throughout the cooking process.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A looks for alternative ingredients for dietary restrictions.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.2,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a sunlit living room, Agent A is lounging on a couch next to a shelf with board games, Agent B, a visiting cousin, is reading a book on marine biology, and Agent C is sorting community event flyers. The interactions center around an incomplete world map jigsaw puzzle on the table.",
    "actions": [
      {
        "description": "Agent A asks Agent B to tell more about the marine creatures in the book.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent B to continue the puzzle.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.9,
          0.1
        ]
      },
      {
        "description": "Agent A offers to help Agent C with the event flyers.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A proposes to hold a vote on community events.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A expresses a desire to visit an aquarium.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A discusses volunteering at a sea life conservation event.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A shares a personal story related to an image in the book.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          1.0,
          0.2
        ]
      },
      {
        "description": "Agent A and Agent B exchange thoughts about a utopian world.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A carefully listens and asks insightful questions.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, finds an old box of family photos and, along with Agent B, Agent C, and Agent D, engages in exploring and sharing their family history together in their home.",
    "actions": [
      {
        "description": "Agent A opens the photo box and invites Agent B to look through the contents with them.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A rearranges the room to create a comfortable space for everyone to view the photographs.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A initiates sharing memories about the photos, starting with the oldest picture.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      },
      {
        "description": "Agent A asks about a photo of an unfamiliar relative to learn more about their family history.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.4,
          0.4
        ]
      },
      {
        "description": "Agent A proposes to create a family tree based on the gathered information.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent D to join in and ensures their inclusion.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.9,
          0.8
        ]
      },
      {
        "description": "Agent A seeks context for photos with limited family members, ensuring a balanced perspective.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.2,
          0.7
        ]
      },
      {
        "description": "Agent A is careful with the photographs, mindful not to cause any damage.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A volunteers to digitize the photographs for preservation and sharing.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and their cousin Agent B are lounging in the study that contains a large collection of historical items and old family belongings. They come across an ornate chest and a collection of old maps.",
    "actions": [
      {
        "description": "Agent A suggests to open the chest to see what’s inside.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.1,
          0.0
        ]
      },
      {
        "description": "Agent A encourages Agent B to choose a map from the collection for them to study together.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.6,
          0.0
        ]
      },
      {
        "description": "Agent A opens a dusty photo album from the shelf and starts a conversation about family history with Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.0
        ]
      },
      {
        "description": "Agent A finds an old board game and proposes that they play it, with players taking turns equally.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      },
      {
        "description": "Agent A offers to make a family tree by researching the names found in the items from the chest.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.7,
          0.0
        ]
      },
      {
        "description": "Agent A intentionally misinterprets an old family rule in the game to win, creating tension.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          -0.5,
          -0.8
        ]
      },
      {
        "description": "Agent A avoids delving into sensitive family history topics that might make Agent B uncomfortable.",
        "values": [
          -0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A supports Agent B in solving a difficult part of the map puzzle they are working on.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a home setting, during a book club, Agent A, the organizer, presents a novel for a communal reading experience, considering inclusion and shared enjoyment with Agent B, a literature enthusiast, and Agent C, the newcomer neighbor.",
    "actions": [
      {
        "description": "Agent A suggests that each person reads a chapter aloud to share the experience of the novel.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A offers to make a round of tea for everyone, asking for their preferences to accommodate them.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A decides to sit next to Agent C to make them feel more included in the conversation.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          1.0,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a discussion about the themes of the book, inviting Agent C to share their perspective first.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          1.0
        ]
      },
      {
        "description": "Agent A proposes that they rotate the host role for each book club meeting, starting with themselves.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A creates a shared document online for the book club members to add thoughts between meetings.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A notices Agent C's hesitation and discusses favorite books to find common ground.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          1.0,
          0.2
        ]
      },
      {
        "description": "Agent A volunteers to help Agent C catch up with the group's already discussed books and offers summaries.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A reaches for a book with complex themes, but reconsiders to choose a more accessible one for the group's new member.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In the family study, Agent A is attempting to understand the history behind an antique locket found in the attic. Agent B is engrossed in reading, while Agent C sorts through family heirlooms. Agent A leads efforts to uncover and share family history among the relatives.",
    "actions": [
      {
        "description": "Agent A gathers family members for a locket origin discussion.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A starts a family heirloom storytelling session.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A helps organize and label heirlooms with Agent C.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A researches locket's era online.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.2,
          0.3
        ]
      },
      {
        "description": "Agent A proposes creating a family tree with room for investigation.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A seeks insights into locket's story from historian or older relative.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A reaches out to distant relatives for family history contributions.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A sets up voting for managing family items.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, is exploring old family memorabilia and comes across a photograph of an ancestor, piquing the interest of themselves and their family in their shared heritage.",
    "actions": [
      {
        "description": "Agent A proposes to organize a family day to visit the old family estate based on the blueprint and stories shared by Agent B.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A takes the initiative to create a family tree, adding personal notes under each family member's name for future reference.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A offers to digitize the old photos and documents for preservation, involving Agent B and Agent C in the process.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A decides to set up a recorded interview with Agent B to capture their family stories and make them accessible to future generations.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent C to help create a scrapbook filled with photos and anecdotes about their family, enhancing the bond between them.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A reaches out to distant family members to gather more information about the family history.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A arranges a family meeting to discuss the findings from the exploration of the old house and decide together what to do with new discoveries.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A consults genealogy experts to verify and expand their knowledge about the family's past.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.3,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy suburban home on a quiet Sunday afternoon, Agent A, a young teenager, and Agent B, his cousin of the same age, are sprawled on the living room carpet with a family photo album. They discover a picture of a great-uncle with an unfamiliar device which sparks their interest. Agent C, Agent A’s older sibling, is nearby, immersed in a book.",
    "actions": [
      {
        "description": "Agent A proposes that they ask their grandparents about the strange device next to their great-uncle in the photo.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a makeshift project to build a replica of the device in the photo.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.8,
          -0.1
        ]
      },
      {
        "description": "Agent A goes to the bookshelves to look for related books.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A drafts a list of materials and agrees to divide tasks equally with Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.4,
          1.0
        ]
      },
      {
        "description": "Agent A offers to switch places with Agent B for a different perspective.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A considers a research competition with Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A sets up a group message channel with the family.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A and Agent B reach out to interview older relatives.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.8,
          1.0
        ]
      },
      {
        "description": "Agent A brings out a voice recorder to document their conversation with grandparents.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B, after finding a sealed box labeled \"Family Secrets\" in their attic following their parent's passing, face a dilemma on whether to open it and explore family history or respect their parent's privacy.",
    "actions": [
      {
        "description": "Agent A proposes they should open the box together.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A decides to document their findings, creating a family heritage book.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A suggests they set the box aside and consult with other family members.",
        "values": [
          -0.4,
          0.0,
          0.0,
          0.0,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A chooses to open the box alone.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          -0.3,
          -0.2
        ]
      },
      {
        "description": "Agent A rejects the idea of opening the box.",
        "values": [
          -0.8,
          0.0,
          0.0,
          0.0,
          0.1,
          0.6
        ]
      },
      {
        "description": "Agent A decides to look for a will or any instruction concerning the box.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A hesitates but chooses to open the box.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          -0.2,
          0.2
        ]
      },
      {
        "description": "Agent A organizes a family meeting to discuss the box.",
        "values": [
          -0.5,
          0.0,
          0.0,
          0.0,
          0.7,
          1.0
        ]
      },
      {
        "description": "Agent A examines the box for any external clues.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.2,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A discovers an old trunk with mysterious symbols that interests both him and his sibling Agent B. Their parent, Agent C, observes them, reflecting a warm and attentive family dynamic.",
    "actions": [
      {
        "description": "Agent A decides to research the symbols on the trunk online, using various history forums and resources.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A suggests to Agent B that they document their findings in a shared journal.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A asks Agent C for any stories or background information about their grandfather that might provide clues.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A proposes to Agent B that they take turns sharing their theories about the trunk's contents.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agent B to choose a book from the shelf that might help them decipher the scripts on the trunk.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A extends an invitation to Agent C to join them in unlocking the trunk, acknowledging their shared family heritage.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Agent A expresses concern to Agent B about possibly damaging the trunk and suggests they seek professional advice.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.5,
          -0.1
        ]
      },
      {
        "description": "Agent A shares any relevant discoveries with Agent C, keeping the family informed and involved.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, Agent B, and Agent C are seated in the living room on a Saturday afternoon, planning a game night and considering which games to play.",
    "actions": [
      {
        "description": "Agent A stands up to grab the whiteboard and markers to begin crafting a tournament chart.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a discussion to brainstorm rules that everyone finds acceptable and fun.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.6,
          1.0
        ]
      },
      {
        "description": "Agent A takes the initiative to ask for everyone’s inputs on which games should be included or excluded from the night’s agenda.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A offers to teach Agent B a new card game that Agent C introduced him to.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A suggests roles for each friend during the game night, like scorekeeper or referee.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent B to share stories about game nights with their own friends.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          1.0,
          0.3
        ]
      },
      {
        "description": "Agent A makes a playful bet with Agent B and Agent C.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A diligently notes down who wins each round.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.2,
          1.0
        ]
      },
      {
        "description": "As they play, Agent A is eager to learn and ask questions about strategies.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is seated at the dining table where family members are engaged in individual projects. Agent B is sketching a community garden, Agent C struggles with a puzzle, and Agent D carries a box of family photos.",
    "actions": [
      {
        "description": "Agent A offers to help Agent C with their jigsaw puzzle, suggesting they could look for patterns together.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.5,
          -0.2
        ]
      },
      {
        "description": "Agent A asks Agent B to explain the garden project and offer innovative ideas.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A helps Agent D organize photos, ensuring no family member is left out.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A brings the family to share stories about the photos.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A suggests using family photos in the garden project to show neighborhood history.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A discusses equal representation in community projects during dinner.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          -0.1,
          1.0
        ]
      },
      {
        "description": "Agent A invites Agent C to add art to the garden project.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A suggests using recycled materials for the garden project.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          -0.1,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a rotational puzzle-solving system for the family.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy kitchen, the eldest sibling Agent A is scrutinizing a recipe book. Agent B is unpacking groceries, and Agent C is assembling a new juicer. Each is engaged in their tasks in the playful yet busy atmosphere.",
    "actions": [
      {
        "description": "Agent A asks Agents B and C for their dinner preferences to involve them in the decision-making process.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.3,
          0.5
        ]
      },
      {
        "description": "Agent A offers to help Agent C with the juicer assembly.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A suggests making juice using the new juicer and lets Agents B and C choose their favorite fruits.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A creates a rotation system for different kitchen tasks to prevent anyone from being stuck with a task.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a blind taste test for an unbiased opinion on the cooked meal.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A suggests looking up a variation of a dish online when a new idea comes up.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A decides to share the knowledge of making a spice blend with Agent B.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.2
        ]
      },
      {
        "description": "Agent A ensures everyone gets an equal portion of the meal.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A initiates a conversation about the dish's cultural background for knowledge sharing.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.4,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, discovers an old trunk in the attic and invites their cousin Agent B and a friend Agent C to explore it together.",
    "actions": [
      {
        "description": "Agent A tries out the old keys to see if they can unlock the trunk.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.4,
          0.1
        ]
      },
      {
        "description": "Agent A listens to Agent B's theory and considers its plausibility.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A proposes to document the opening of the trunk.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A suggests dividing any found treasures equally.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A asks for Agent C's insights on the trunk.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A discusses respecting privacy with personal contents.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A talks about preserving historical items.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A keeps findings a secret if not permitted to share.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A lets Agent B pick first from the non-personal items.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A discovers an old family recipe book and decides to prepare a meal from it with the help of his friends, considering everyone's taste and participating in a shared learning experience.",
    "actions": [
      {
        "description": "Agent A suggests preparing a dish from the family recipe book, considering everyone's dietary restrictions for a shared dinner.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A asks Agent B to document the cooking process for her photography project and possibly create a shared album.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A actively engages with Agent C's friends to understand their food culture and includes a dish that represents diversity.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A offers to teach Agent C a recipe that they can cook together, making an effort to include them in the activity.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      },
      {
        "description": "Agent A proposes dividing tasks equally among all present to ensure everyone contributes to the meal preparation.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.3,
          1.0
        ]
      },
      {
        "description": "Agent A encourages others to offer ideas on improving the dish, fostering a collaborative environment.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A initiates a quiz about the history and origin of the various dishes, turning it into a learning experience.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.4,
          -0.1
        ]
      },
      {
        "description": "Agent A ensures that all guests are comfortable with the chosen menu, making necessary adjustments for preferences.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A decides to plate the final dish in an aesthetically pleasing way to help Agent B capture an excellent photograph.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A enters the home to find Agent B working on a history project at the dining table. Agent C is nearby, engaged in a loud phone conversation which may be disruptive.",
    "actions": [
      {
        "description": "Agent A approaches the dining table, intrigued by the map, and inquires about Agent B's project.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.2,
          0.1
        ]
      },
      {
        "description": "Agent A suggests working together on the project and divides the tasks equally between them, ensuring a collaborative atmosphere.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.3,
          0.9
        ]
      },
      {
        "description": "Agent A decides to fetch their own history textbook to provide additional sources of information for Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.1,
          0.4
        ]
      },
      {
        "description": "Agent A proposes to use a computer for research and helps Agent B look up historical facts, comparing information from different websites.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.1,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent C to join them, trying to integrate C’s insights into the project.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.7,
          0.6
        ]
      },
      {
        "description": "Seeing discrepancies in the information, Agent A recommends double-checking facts with a reliable source before adding it to the project.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A shares a similar project they did previously as inspiration, thus offering support and insight into their own experience.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A offers to make some snacks, to make the working session more enjoyable.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A listens attentively to Agent B’s perspectives on the civilization and discusses the differing viewpoints thoughtfully.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B are siblings arranging their home's living room with antiquated objects, joined by Agent C, who brought board games. They discover a family photo album and share stories, then contend to distribute the game night roles equitably.",
    "actions": [
      {
        "description": "Agent A proposes to research the origin of the suitcase and the globe online to learn their history.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.4,
          0.1
        ]
      },
      {
        "description": "Agent A initiates a storytelling round, where each person can share related personal memories.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      },
      {
        "description": "Agent A volunteers to be the game master for game night, with a plan to rotate the role next time.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          -0.2
        ]
      },
      {
        "description": "Agent A decides to create a voting system for everyone to choose the game they want to play first.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.2,
          1.0
        ]
      },
      {
        "description": "Agent A encourages Agent C to share stories about their own family to enhance the mutual understanding.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          1.0,
          0.2
        ]
      },
      {
        "description": "Agent A suggests that they use a timer to ensure everyone has an equal chance to speak during reminiscing.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A takes it upon themselves to clear space, safeguarding the valuable items like the globe and suitcase.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.1,
          0.7
        ]
      },
      {
        "description": "Agent A brings out an unplayed board game and starts reading the instructions aloud for everyone.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.3,
          0.4
        ]
      },
      {
        "description": "Agent A composes a brief write-up on their findings about the objects for the family to read later.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy living room, Agent A is reading, Agent B is cross-stitching, and Agent C is assembling a puzzle. An unopened board game suggests a new shared activity they haven't yet explored.",
    "actions": [
      {
        "description": "Agent A suggests to learn the board game with Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A proposes switching activities with Agent B.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A expresses interest in Agent C's puzzle.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A offers help to Agent B with cross-stitch.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.2
        ]
      },
      {
        "description": "Agent A reads the board game instructions aloud.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A documents the evening’s activities.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A fetches refreshments for everyone.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a more inclusive puzzle.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A ensures Agent B has an equal turn.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.3,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is a teenager with a keen interest in culinary arts, trying out recipes from various cultures in their home kitchen. Agent B, a cousin visiting for the summer, is seated at the kitchen table with a book on rare and ancient cuisines. Agent C, Agent A's parent, is organizing the pantry. Together, they plan to cook a dish from Agent B's book, creating an atmosphere of shared knowledge, bonding, and equitable contribution.",
    "actions": [
      {
        "description": "Agent A asks Agent B to explain the historical significance of the chosen recipe.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent C to add a personal twist to the recipe, making it a family creation.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A meticulously measures each spice, ensuring the authenticity of the flavor is preserved.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.1,
          0.2
        ]
      },
      {
        "description": "Agent A proposes that they rotate the roles in the cooking process to give each person a chance to lead a part of the preparation.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A decides to document the cooking process with photos and notes so that they can replicate and improve upon the recipe in the future.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.2,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a blind taste test to see if the finished dish meets everyone's expectations without any visual biases.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A sets up a sidebar with a variety of additional ingredients so that each person can customize their portion to taste.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "After cooking, Agent A plans a session for the three of them to reflect on the cooking experience and discuss what they learned.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "In the spirit of exploration, Agent A initiates a discussion on the next culinary project and how they might incorporate everyone's preferences.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.9,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is a teenager exploring their new home and finds a locked cabinet. Agent B struggles with arranging a shared book collection while Agent C is busy in the kitchen. Agent A is intrigued by the cabinet and considers the family dynamics involving chores and contributions.",
    "actions": [
      {
        "description": "Agent A gathers a pen and notepad to document discoveries from the cabinet.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          -0.2,
          0.1
        ]
      },
      {
        "description": "Agent A decides to help Agent B arrange the books by theme and author.",
        "values": [
          -0.5,
          0.0,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A engages Agent B in a conversation about favorite books.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          1.0,
          -0.1
        ]
      },
      {
        "description": "Agent A proposes a system for sharing house responsibilities.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.4,
          1.0
        ]
      },
      {
        "description": "Agent A takes the initiative to cook one evening a week.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.9,
          0.8
        ]
      },
      {
        "description": "Agent A asks Agent C for the key to the locked cabinet.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.2,
          -0.2
        ]
      },
      {
        "description": "Agent A suggests taking turns choosing a book to read together.",
        "values": [
          -0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A arranges a meeting with local peers for neighborhood exploration suggestions.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.1,
          0.2
        ]
      },
      {
        "description": "Agent A offers to assist Agent C with meal preparation.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.8,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, an avid garden enthusiast, enjoys a weekend at home where they discuss gardening and local history with Agent B, their teenage cousin, and Agent C, a neighbor and local historian. The conversation turns to the sustainability and historical significance of their surroundings, particularly an old oak tree and heirloom tomatoes, sparking a sense of shared learning and community development.",
    "actions": [
      {
        "description": "Agent A grabs a few gardening tools and invites Agent B to join in the process of planting heirloom tomatoes.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A suggests an impromptu garden project with a shared composting routine.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.4,
          0.5
        ]
      },
      {
        "description": "Agent A offers to help Agent C with research on the historical significance of the old oak tree.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.3,
          0.4
        ]
      },
      {
        "description": "Agent A takes out gardening books, offering them to Agent B.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A and Agent B organize a seed exchange event with local gardening enthusiasts.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A invites Agent B to help draft a letter for tree protection to the local council.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A starts a journal documenting the growth of the heirloom tomatoes.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.2,
          0.3
        ]
      },
      {
        "description": "Agent A organizes a neighborhood gathering to discuss urban gardening benefits.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A offers a part of the garden for Agents B and C to plant their choice.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a cozy suburban home, Agent A, a university student, observes his cousin Agent B absorbed in a travel magazine and his sibling Agent C focused on an art project. Curiosity arises as Agent A becomes drawn to the exotic locales in the magazine, which leads to a sharing moment between the family members and facilitates a cultural exchange within the context of their home environment. Equal opportunities for learning and participation are implied with the offer of fruit and exchange of knowledge.",
    "actions": [
      {
        "description": "Agent A asks Agent B to tell more about the foreign places showcased in the magazine.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.4,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent C to join the conversation and offers insights from their own knowledge about the places discussed.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A decides to take notes about the new information learned from Agent B and adds related ideas for future travel plans or projects.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.3,
          0.2
        ]
      },
      {
        "description": "Agent A suggests organizing a cultural evening where each would present something unique from a different part of the world.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A offers pieces of the fruit to both Agent B and Agent C, ensuring everyone gets a piece.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A proposes to collaborate on a travel blog post with Agent B, contributing equally to the content.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A helps Agent C with the art project by providing suggestions to incorporate themes from the travel conversation.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A shares the resources gathered for his studies with Agent C, mindful of their scholastic interests.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A explores the possibility of a joint trip with Agent B, considering budget and time constraints for all parties involved.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a household's living room, Agent A, a university student, lounges on a couch with a folklore book. Agent B, their high school cousin, sorts through old family photos. Agent C, the elder guardian, tends to plants. Intrigued by a photo, they consider exploring an attic heirloom chest together, aiming to learn and share family history.",
    "actions": [
      {
        "description": "Agent A suggests creating an inventory of the items found in the heirloom chest, including detailed descriptions for future reference.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A decides to involve Agent B and C in a discussion about the context of each item they find, wanting to hear different perspectives.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A volunteers to carefully restore any damaged photos or documents they uncover, showing respect for their shared heritage.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.9
        ]
      },
      {
        "description": "Agent A offers to make duplicates of the photos for Agent B, recognizing the importance of the connection to family history.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A proposes to record the story behind each item, where Agent C could contribute their memories and knowledge.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a rotation system in which each person has an equal turn in choosing an item from the chest to investigate further.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.4,
          0.9
        ]
      },
      {
        "description": "Agent A commits to researching the historical context of their findings to expand their collective understanding.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.3,
          0.4
        ]
      },
      {
        "description": "Agent A constructs a family tree based on the information gathered, ensuring that everyone's input is included.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A sets up a space within the living room dedicated to displaying their favorite finds, giving everyone an equal chance to showcase what's important to them.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "In a suburban home, Agent A, a teenager, and Agent B, their cousin, engage with old family photo albums and a family heirloom box, intending to explore together.",
    "actions": [
      {
        "description": "Agent A carefully opens the box of family heirlooms, gently examining each item with Agent B.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A suggests creating a family tree based on the photos and documents in the albums and the heirlooms.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A respectfully asks Agent C for more background information on peculiar items to accurately place them in the family history.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A decides to digitize old family photos and documents for preservation and sharing.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A offers to reorganize the photo albums, correcting the order of photos.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.3,
          0.6
        ]
      },
      {
        "description": "Agent A proposes that they should take turns with Agent B in the jigsaw puzzle and family tree, ensuring equal participation.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.5,
          0.9
        ]
      },
      {
        "description": "Agent A creates a shared digital album where the family can add and annotate photos and stories.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A handles the heirlooms carefully, ensuring their preservation.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.6,
          0.7
        ]
      },
      {
        "description": "Agent A uncovers an old letter about sensitive family history and thoughtfully discusses with Agent B how to approach Agent C.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.9,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a recent college graduate, lives at home with their parents (Agent B and Agent C) and younger sibling (Agent D). One evening, Agent A finds an old family album in the living room while cleaning. Agent B is knitting, Agent C is fixing a chair, and Agent D is eager to play Monopoly. The atmosphere is warm, and there's an anticipation for shared stories.",
    "actions": [
      {
        "description": "Agent A asks Agent B about the story behind the photo with the protest signs.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A proposes that the family collaborates on creating a more comprehensive family tree.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A invites Agent D to sit and explain the photos in a story-sharing session.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          1.0,
          0.3
        ]
      },
      {
        "description": "Agent A starts a conversation about everyone’s most memorable family moments.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.8,
          0.7
        ]
      },
      {
        "description": "Agent A asks Agent C for help in fixing a loose page in the album.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A passes the album to Agent D, allowing them to connect to family history.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A maintains a balance between listening and sharing stories.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.9,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a young adult, is hosting a puzzle-solving and board game evening with close friend Agent B and cousin Agent C. They're in Agent A's living room, which gives off a welcoming vibe with soft music and a variety of board games ready to play.",
    "actions": [
      {
        "description": "Agent A rummages through the cabinet to find an old board game.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to place a friendly wager on the game.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.4,
          -0.2
        ]
      },
      {
        "description": "Agent A carefully listens to Agent C’s strategies for the puzzle.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.7,
          0.1
        ]
      },
      {
        "description": "Agent A offers to switch seats with Agent C.",
        "values": [
          -0.3,
          0.0,
          0.0,
          0.0,
          0.6,
          0.8
        ]
      },
      {
        "description": "Agent A suggests they rotate turns in leading the game.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.2,
          0.6
        ]
      },
      {
        "description": "Agent A points to a rule in the game's manual to clarify a dispute.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          -0.5,
          0.9
        ]
      },
      {
        "description": "When Agent B seems hesitant, Agent A gives a quick tutorial.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.9,
          0.4
        ]
      },
      {
        "description": "Agent A starts a conversation about the puzzle’s theme.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.8,
          -0.1
        ]
      },
      {
        "description": "Agent A offers to pause the game and order food.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a high school history teacher, is at home preparing for her school's cultural heritage week. Her nephew, Agent B, shows emerging interest in her old family album containing historical documents and photos. Agent A considers how to use these items for educational purposes while respecting family privacy and heritage.",
    "actions": [
      {
        "description": "Agent A discusses the historical documents with Agent B.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A proposes digitizing the documents with Agent B.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.6,
          0.4
        ]
      },
      {
        "description": "Agent A takes note of Agent B's interests.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A creates an anonymized compilation of stories.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.4,
          0.7
        ]
      },
      {
        "description": "Agent A and Agent B brainstorm creative presentation ways.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A lets Agent B lead in creating a presentation.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A considers starting a collective history class project.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.6,
          0.9
        ]
      },
      {
        "description": "Agent A offers to credit Agent B as a co-creator.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.5,
          0.8
        ]
      },
      {
        "description": "Agent A sets boundaries on family information sharing.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is in the shared living room with Agent B, their sibling, and Agent C, a cousin visiting for the weekend. The three of them are gathered around a large table that is strewn with various board games and an assortment of snacks. Agent A glances at the new board game brought by Agent C, which none of them have played before.",
    "actions": [
      {
        "description": "Agent A studies the new game's rulebook in detail to understand the nuances of gameplay.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A suggests modifying one rule that seems to advantage players starting the game, arguing it would level the playing field.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.2,
          0.9
        ]
      },
      {
        "description": "Agent A sets up a scoring system on a whiteboard for everyone to see and track the game's progress transparently.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.3,
          0.7
        ]
      },
      {
        "description": "Agent A asks Agent C insightful questions about strategies and techniques specific to the game.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent B to join in devising a collaborative strategy for the game.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A volunteers to be the scorekeeper, keeping track of points gained by all players.",
        "values": [
          0.1,
          0.0,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A carefully listens to Agent B's game explanation to make sure they fully grasp the concepts.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A creatively thinks of a new game variation for future play, sparking a discussion for potential rule changes.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A, a freelance writer, observes his partner Agent B organizing spices and his nephew Agent C setting the table while a friend, Agent D, visits and waits for dinner. Agent A engages with the spices, initiates culturally insightful conversations, suggests sharing experiences, and promotes equal participation in household activities.",
    "actions": [
      {
        "description": "Agent A asks about the origins of a spice and offers to write a post about it.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A encourages cultural conversation with Agent C using a globe.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.3,
          0.1
        ]
      },
      {
        "description": "Agent A proposes a historical trivia game before dinner.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.3
        ]
      },
      {
        "description": "Agent A tidies up his desk for a shared workspace.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A offers to help Agent C set the table.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.3,
          0.4
        ]
      },
      {
        "description": "Agent A opens up about a writing challenge to Agent D.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.7,
          -0.1
        ]
      },
      {
        "description": "Agent A suggests rotating dinner preparation roles.",
        "values": [
          -0.1,
          0.0,
          0.0,
          0.0,
          0.4,
          0.8
        ]
      },
      {
        "description": "Agent A selects books considering each agent's tastes.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.5,
          0.2
        ]
      },
      {
        "description": "Agent A offers to showcase Agent B's cooking talent online.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.8,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is a teenager at home on a rainy Saturday, intrigued by Agent B's stone collection and Agent C's photo albums, contemplating engagement with both.",
    "actions": [
      {
        "description": "Agent A asks Agent B to explain the origin and categorization of each stone.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent C to tell the story behind one of her favorite photographs.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.9,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a game where they each create a fictional backstory for a randomly selected stone.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.6,
          0.1
        ]
      },
      {
        "description": "Agent A proposes to digitize Agent C's photos and create an online shared album.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.5,
          0.6
        ]
      },
      {
        "description": "Agent A takes an interest in learning the value of the stones and suggests researching them online.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.2,
          0.4
        ]
      },
      {
        "description": "Agent A decides to organize the photo albums chronologically with Agent C’s help.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.8,
          0.5
        ]
      },
      {
        "description": "Agent A combines the stones to create a visual timeline that coincides with the decades in Agent C's photos.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A plans to invite Agents B and C to a future community event to showcase their stones and stories.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.7,
          0.8
        ]
      },
      {
        "description": "Agent A finds a unique stone and asks Agent B if it can be given to Agent C as a token of their time together.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.9,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A receives a puzzle box and, along with Agent B and Agent C, engages in the process of solving it, sharing knowledge, and celebrating their collaborative success.",
    "actions": [
      {
        "description": "Agent A asks Agent B for help with the puzzle due to Agent B’s knowledge of cryptography.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A researches historical motifs on the box online for historical significance.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A proposes taking turns with Agent C when trying to open the puzzle box.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A takes detailed notes for Agents B and C to review and build upon.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.4,
          0.5
        ]
      },
      {
        "description": "Agent A suggests forming a collaborative team with Agents B and C.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.6
        ]
      },
      {
        "description": "Agent A breaks to learn about Agent C’s geode collection.",
        "values": [
          -0.4,
          0.0,
          0.0,
          0.0,
          0.8,
          0.2
        ]
      },
      {
        "description": "Agent A shares the backstory of the puzzle box with Agents B and C.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.9,
          -0.1
        ]
      },
      {
        "description": "Agent A organizes a puzzle-themed party to celebrate their collective victory.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          1.0,
          0.4
        ]
      },
      {
        "description": "Agent A patiently allows Agent C time to think and solve the puzzle.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.5,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A and Agent B, siblings in their mid-teens, are in their family's cozy, sunlit living room on a lazy Sunday afternoon. Agent A is currently absorbed in a large atlas, while Agent B sketches, and Agent C sorts through old family photographs.",
    "actions": [
      {
        "description": "Agent A invites Agent B and Agent C to look at the atlas and share facts about different countries.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.7,
          0.5
        ]
      },
      {
        "description": "Agent A suggests compiling the family photographs into an album and discussing how to categorize them.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A offers to set up the printer for Agent B to print out references for her sketches.",
        "values": [
          0.2,
          0.0,
          0.0,
          0.0,
          0.8,
          0.4
        ]
      },
      {
        "description": "Agent A fetches an old globe from the shelf, comparing it with the maps in the atlas, and discusses the changes with Agents B and C.",
        "values": [
          0.9,
          0.0,
          0.0,
          0.0,
          0.5,
          0.3
        ]
      },
      {
        "description": "Agent A comes across a photograph with an unknown relative and asks Agents B and C for their thoughts on who it might be.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.6,
          0.5
        ]
      },
      {
        "description": "Agent A finds an interesting historical event in the atlas and proposes to create a family trivia game.",
        "values": [
          1.0,
          0.0,
          0.0,
          0.0,
          0.4,
          0.2
        ]
      },
      {
        "description": "Agent A takes notice that Agent C seems more interested in certain types of photos and adapts the conversation to include more of that topic.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.8,
          0.6
        ]
      },
      {
        "description": "Agent A realizes a particular region in the atlas is where Agent C's family is from and asks Agent C to share personal stories.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          1.0,
          0.3
        ]
      },
      {
        "description": "Agent A feels a conflict arising when deciding who keeps a sentimental photo and suggests taking a digital copy so everyone can have it.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.6,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "curiosity",
      "intimacy",
      "fairness"
    ],
    "scenario": "Agent A is a teenager interested in culinary experiments, sitting in the kitchen with various ingredients for a new recipe. Agent B is working on a painting, and Agent C is organizing the pantry. The kitchen is a fusion of aromas and the family is engaged in different yet harmonious activities.",
    "actions": [
      {
        "description": "Agent A asks Agent B for opinions on spice combinations for the pasta dish.",
        "values": [
          0.7,
          0.0,
          0.0,
          0.0,
          0.5,
          0.4
        ]
      },
      {
        "description": "Agent A offers to clean Agent B's brushes for feedback on the finished dish.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.3
        ]
      },
      {
        "description": "Agent A sets out cooking utensils equally for everyone's use.",
        "values": [
          0.4,
          0.0,
          0.0,
          0.0,
          0.3,
          0.8
        ]
      },
      {
        "description": "Agent A chops vegetables and rearranges misplaced pantry items.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.4,
          0.6
        ]
      },
      {
        "description": "Agent A discusses the new recipe and seeks cooking advice from Agent C.",
        "values": [
          0.8,
          0.0,
          0.0,
          0.0,
          0.4,
          0.3
        ]
      },
      {
        "description": "Agent A cleans up a sauce spill, maintaining kitchen tidiness.",
        "values": [
          -0.2,
          0.0,
          0.0,
          0.0,
          0.2,
          0.5
        ]
      },
      {
        "description": "Agent A serves the pasta equally among all participants.",
        "values": [
          0.3,
          0.0,
          0.0,
          0.0,
          0.9,
          0.7
        ]
      },
      {
        "description": "Agent A offers a fresh perspective to Agent B on the painting issue.",
        "values": [
          0.6,
          0.0,
          0.0,
          0.0,
          0.7,
          0.4
        ]
      },
      {
        "description": "Agent A adapts the dish's flavor based on collective feedback.",
        "values": [
          0.5,
          0.0,
          0.0,
          0.0,
          0.6,
          0.6
        ]
      }
    ]
  }
]