[
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Protagonist Agent A, a university student, living with two roommates agents B and C, decides to cook a meal at their shared house. Each of them is engaged in their own recreational activities. While Agent B engaged in a VR gaming marathon and Agent C assembling a wooden 3D puzzle.",
    "actions": [
      {
        "description": "Agent A decides to cook a nutritious meal, featuring a balanced array of proteins, vegetables, and carbohydrates.",
        "values": [
          0.0,
          1.0,
          0.5,
          0.2,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A creates a cooking schedule ensuring enough time for studying later on.",
        "values": [
          0.0,
          1.0,
          0.1,
          0.5,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a dedicated runner, just finished up a long day at work from home. Exhausted, yet desiring to keep up with his scheduled routine, he prepares to head out for an evening run. It's a mild summer night and the sun is starting to set. Agent B, who is A's housemate and has just returned home from their own job as a firefighter, leans against the kitchen counter watching A lace up his running shoes. Agent C, their next-door neighbor, is outside trimming the hedges along one side of their house.",
    "actions": [
      {
        "description": "Agent A decides to invite Agent B to join him for the run, so both can unwind from the day while staying active.",
        "values": [
          0.0,
          0.9,
          0.5,
          0.7,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests Agent B could cook a healthy meal for their dinner in return, since B is especially good at cooking.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.6,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A takes the initiative to cook a nutritious meal for the family and involves Agents B and C. Agents B and C help with the preparations, and the dinner results in a wonderful family bonding and educational experience.",
    "actions": [
      {
        "description": "Agent A insists that Agents B and C wash their hands before helping with the preparation.",
        "values": [
          0.0,
          0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A assigns Agents B and C simple tasks, like washing vegetables and setting the table, to get them involved.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.2,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a mother, spends the afternoon with her two kids, Agent B and C. They were watching TV but she knows they need a healthier routine, so she feels she should spend the afternoon in a way that benefits all.",
    "actions": [
      {
        "description": "Agent A suggests a family cooking session, making a dish each.",
        "values": [
          0.0,
          0.6,
          0.7,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a board game tournament.",
        "values": [
          0.0,
          -0.4,
          0.6,
          0.7,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a shared apartment, Agent A, a fitness enthusiast and a chef, is preparing for the weekly meal prep with his three roommates, Agent B, an aspiring actor, and Agent D, a university student. While he's been following workout routines at home due to gym closures, he opts to squeeze in some exercises in between.",
    "actions": [
      {
        "description": "Agent A decides to ask his roommates to assist in chopping vegetables.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A stops working out.",
        "values": [
          0.0,
          -1.0,
          0.3,
          -0.6,
          0.0,
          -0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, an enthusiastic teenager, is at home with his siblings, Agent B and Agent C, on a rainy weekend. He sees Agent B playing a single-player board game alone while Agent C is puzzling over a dinner recipe lacking a key ingredient. Their parents are away for the weekend.",
    "actions": [
      {
        "description": "Agent A invites Agent B to play a lively game of indoor tag.",
        "values": [
          0.0,
          0.9,
          -0.8,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A offers to cook dinner for Agent B and Agent C.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a family workout session to lift everyone’s spirits.",
        "values": [
          0.0,
          1.0,
          -0.2,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a house cleaning competition between him, Agent B, and Agent C.",
        "values": [
          0.0,
          0.8,
          0.9,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to brave the rain and go out to buy the missing ingredient for Agent C’s recipe.",
        "values": [
          0.0,
          0.6,
          -1.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to make a fort using blankets for Agent B to play in.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A encourages Agent B to turn his board game into a multiplayer one by tweaking the rules.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A sets up a movie night for him and his siblings with their favorite films.",
        "values": [
          0.0,
          -0.2,
          0.2,
          1.0,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A decides to bake cookies with Agent B and Agent C by splitting the tasks equally.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.9,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a 35-year-old man, hosts a dinner party inviting his friends, Agent B, a professional chef, and Agent C, a newcomer, over. They cook together referring a cookbook, accommodating dietary restrictions while Agent C sets up the table in the living room and works on the playlist of the evening.",
    "actions": [
      {
        "description": "Agent A supervises and assists in the cooking process.",
        "values": [
          0.0,
          0.7,
          0.6,
          0.4,
          0.0,
          -0.3
        ]
      },
      {
        "description": "Agent A regularly checks the oven.",
        "values": [
          0.0,
          -0.2,
          0.8,
          -0.3,
          0.0,
          -0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a mother, watches over her two children, Agent B and Agent C, as they play in the living room while she prepares lunch. Agent B, an outgoing 10-year-old boy, is completely immersed in his action figure toy world. Agent C, a diligent 8-year-old girl, is busily assembling a complicated puzzle. The aroma of a healthy meal wafts through the house, while the sounds of play create a lively and jovial atmosphere.",
    "actions": [
      {
        "description": "Agent A calls the children to the table to serve them a balanced meal she has prepared.",
        "values": [
          0.0,
          1.0,
          0.5,
          0.9,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests they must clean their hands before eating.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.3,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "On an unusually warm Saturday afternoon, Agent A, a devoted football coach, and Agent B, his assistant coach, are hosting a friendly scrimmage at Agent A's spacious backyard for their local junior football team.",
    "actions": [
      {
        "description": "Agent A organizes a warm-up session for both the teams, ensuring every player is well-prepared for the match.",
        "values": [
          0.0,
          0.7,
          0.6,
          0.3,
          0.0,
          -0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a father, his daughter Agent B, and his son Agent C, are together…",
    "actions": [
      {
        "description": "Agent A suggests C to guide B to use the vegetable chopper.",
        "values": [
          0.0,
          0.6,
          0.9,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A ensures B & C to wear kitchen aprons.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.2,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A creates a rule for a clean kitchen.",
        "values": [
          0.0,
          0.3,
          1.0,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A discusses C's early days in the kitchen.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.8,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A rotates responsibility of stovetop and oven.",
        "values": [
          0.0,
          0.7,
          0.7,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A cheers B, encouraging her to overcome her fears.",
        "values": [
          0.0,
          0.9,
          0.3,
          1.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In the bustling household of Agent A, a father of two young children - Agent B and Agent C, the day started with a festive atmosphere. It was a special day as it was the birthday of Agent B. Agent A, who usually cooks breakfast for his family, decided to make something special for the breakfast feast. Seeing the unique ingredients for the breakfast, both Agent B and Agent C got excited. Agent A also decided to involve his kids in the cooking preparation, setting up a challenge for them. He proposed to divide them into two teams, himself with Agent B and Agent C alone, each having equal opportunity to express their creativity in making breakfast. With a gleaming kitchen and the aroma of pancakes wafting in the air, they were ready for the fun-filled challenge.",
    "actions": [
      {
        "description": "Agent A helps Agent B crack the eggs for pancake batter.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.1,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A decides to make a larger batch of pancake batter to ensure everyone in the family has enough to eat.",
        "values": [
          0.0,
          0.7,
          -0.1,
          0.2,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A instructs Agent B to wash her hands to guarantee hygienic cooking.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A takes extra precautions while using the stove to prevent any accidental burns.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.1,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A praises both his children's efforts, boosting their morale.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A calls out the time left every few minutes, ensuring everyone is aware of the remaining time.",
        "values": [
          0.0,
          -0.1,
          0.1,
          0.3,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A takes the most labor-intensive tasks to himself to ensure efficiency.",
        "values": [
          0.0,
          0.4,
          -0.1,
          0.2,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A laughs at his own failed attempt at flipping a pancake, bringing humor to the tense atmosphere.",
        "values": [
          0.0,
          0.2,
          -0.1,
          0.9,
          0.0,
          -0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, the college-going protagonist, arrives home after a tiring day at work. He sees his younger siblings, Agent B, a high schooler, and Agent C, a middle school student, sitting at the dining table. Agent B is working on his math assignment while Agent C is setting the table and sorting out the mail. Despite being tired, Agent A decides to cook dinner for everyone.",
    "actions": [
      {
        "description": "Deciding to cook a nutritious meal, considering everyone's preferences",
        "values": [
          0.0,
          0.9,
          0.3,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Helping Agent B with his math assignment while monitoring the cooking",
        "values": [
          0.0,
          0.4,
          0.2,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Instructing Agent C to organize the mail and separate the bills",
        "values": [
          0.0,
          0.3,
          0.8,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Creating a joyful atmosphere by talking about their day while cooking",
        "values": [
          0.0,
          -0.2,
          0.3,
          1.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Checking the freshness of all the ingredients before using them in the meal",
        "values": [
          0.0,
          0.9,
          1.0,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Dividing the chores equally for preserving a sense of justice in the house",
        "values": [
          0.0,
          -0.4,
          0.2,
          0.6,
          0.0,
          1.0
        ]
      },
      {
        "description": "Creating a secure plan in case of a minor kitchen accident",
        "values": [
          0.0,
          0.0,
          1.0,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Arrange the seating around the dinner table considering everyone's comfort and ease",
        "values": [
          0.0,
          0.4,
          0.8,
          0.9,
          0.0,
          0.9
        ]
      },
      {
        "description": "Cleaning the kitchen surfaces using a disinfectant",
        "values": [
          0.0,
          0.3,
          1.0,
          0.2,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a cozy residential kitchen, Agent A, a diligent teenager, is studying for an exam. Agent B, their parent, is preparing lunch while Agent C, A's younger sibling, sets the table. The room is filled with the aroma of fresh bread and the soft glow of sunlight, promising a pleasurable break from studies.",
    "actions": [
      {
        "description": "Agent A offers to help Agent B with carrying the heavy pots to the table.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A challenges Agent C to a brief game of tag in the backyard.",
        "values": [
          0.0,
          0.7,
          -0.3,
          0.5,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A decides to organize a family movie night.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a quick nap for everyone.",
        "values": [
          0.0,
          0.8,
          0.4,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A helps Agent C with their homework before their own.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes an evening walk with the family.",
        "values": [
          0.0,
          0.7,
          0.6,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "When choosing a movie to watch, Agent A conducts a family vote.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A stays vigilant with emergency numbers ready.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.2,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, in his late twenties, has an at-home pizza night with Agent B, an avid gardener in her early thirties, and Agent C, a college student interested in amateur astronomy. The agents are in a comfortable and casual atmosphere with a focus on joint activities and shared enjoyment.",
    "actions": [
      {
        "description": "Agent A turns on the fan to circulate air while cooking.",
        "values": [
          0.0,
          -0.3,
          0.5,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A checks the balcony door to ensure it is locked after Agent C comes back in from setting up the telescope.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A samples a pizza topping and offers some to Agent B and Agent C to try, encouraging a shared experience.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A decides to create a small corner on the kitchen island to showcase the pizzas before serving, for everyone to admire each other's creation.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A organizes a rotation for who will use the oven first, making sure everyone has equal time and space.",
        "values": [
          0.0,
          -0.1,
          0.1,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A brings out board games to play after dinner, promoting a fun and engaging activity for everyone.",
        "values": [
          0.0,
          -0.4,
          0.2,
          0.9,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A takes extra care to clean up any spills on the floor immediately to prevent accidents.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A lights the candles on the table right before eating, setting a pleasant mood.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.6,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A compliments both agents on their unique contributions to the evening, reinforcing positive feelings.",
        "values": [
          0.0,
          -0.1,
          0.0,
          1.0,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a suburban home, Agent A is preparing dinner with fresh ingredients and a recipe while Agent B reads in the living room and Agent C sets the dining table with equal utensils for everyone, reflecting a household that values a considerate and organized lifestyle.",
    "actions": [
      {
        "description": "Agent A carefully washes the vegetables before chopping them for dinner.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A reminds Agent C to place the knives on the correct side of the plates, promoting good table manners.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.1,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A tastes the food to ensure it is delicious before serving it.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.7,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A evenly divides the prepared dish into equal portions for the family, ensuring everyone gets their share.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.1,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A cleans up any spills immediately to avoid slipping hazards.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.1,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A checks the smoke detectors while cooking, to be sure they are functioning correctly.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A stores leftover food properly in containers to be used for future meals.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A plans a 15-minute break for some stretches after cooking, before the family sits down to eat.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.6,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to share feedback on the meal to improve future cooking endeavors.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.6,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, returns home from basketball practice and joins his mother, Agent B, in the kitchen to assist with dinner preparations while Agent C wraps up his work to set the table. The household activities demonstrate a cooperative spirit as the family prepares for a shared meal in a supportive environment.",
    "actions": [
      {
        "description": "Agent A volunteers to help Agent B prepare a salad to accompany dinner.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests creating a weekly meal plan to ensure diverse and balanced meals.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A initiates setting up a smoke detector in the kitchen with guidance from Agent C.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A decides to switch off his phone to spend quality family time during dinner.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A engages in a light indoor workout session after meal preparation, before dinner.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.4,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A proposes a board game after dinner for family bonding time.",
        "values": [
          0.0,
          -0.2,
          0.3,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A checks the house's first aid kit to ensure it's well-stocked and accessible.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.2,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A takes the initiative to clean up the dining area after the meal.",
        "values": [
          0.0,
          -0.4,
          0.4,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to do the dishes, making sure to conserve water as much as possible.",
        "values": [
          0.0,
          -0.2,
          0.3,
          0.4,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In the kitchen, Agent A is preparing a balanced meal, while Agent B and Agent C are working on school projects at the dining table. The environment is secure, the scene balanced with involvement and autonomy.",
    "actions": [
      {
        "description": "Agent A reminds Agent B and Agent C to take a break from their work to stretch and do some light exercises.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A prepares plates for each family member, ensuring equal portions of food.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A checks the locks on doors and windows in the house to ensure they are secure.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A initiates a discussion at the dinner table, listening to each child’s opinion on a topic.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A sets aside a contingency plan for potential cuts or burns that might occur while cooking.",
        "values": [
          0.0,
          -0.3,
          0.8,
          -0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A allocates a task to each child that is age-appropriate to involve them in the meal-preparation process.",
        "values": [
          0.0,
          0.3,
          0.6,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A balances the meal with healthy options and allows the children to choose a healthy dessert.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A ensures that the jug of water is refilled and encourages the children to hydrate.",
        "values": [
          0.0,
          0.8,
          0.5,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A examines the smoke detectors to confirm they are functioning correctly.",
        "values": [
          0.0,
          -0.4,
          1.0,
          -0.1,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is a young adult in a homely living room preparing to cook with fresh ingredients, with Agents B, C, and D engaged in calming activities.",
    "actions": [
      {
        "description": "Agent A decides to prepare a nutritious meal using the fresh ingredients available.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agents B, C, and D to join in meal preparation for a shared experience.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to cook everyone's favorite dish to ensure everyone enjoys the meal.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A allocates tasks equitably among Agents B, C, and D to ensure no one is overburdened.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A creates a playlist of music that is known to be everyone's favorite, to add to the pleasant ambiance.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests taking turns doing the dishes after the meal so that one person doesn’t have to do it all.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A decides to open the windows further to allow more fresh air into the room while cooking.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.4,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a young parent, is contemplating the day’s activities in the family’s suburban home. Agent B is organizing the kitchen while Agent C is absorbed in a tablet. The environment breathes comfort and anticipation of the weekend.",
    "actions": [
      {
        "description": "Agent A organizes a family meeting to discuss and plan the day's activities.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A proposes a rotation system for the household chores.",
        "values": [
          0.0,
          -0.5,
          0.3,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a family cooking session.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A encourages Agent C to join in gardening.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A checks the smoke detectors and first aid kit.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A decides to organize an impromptu fire drill.",
        "values": [
          0.0,
          -0.4,
          1.0,
          -0.2,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A initiates a game of charades after dinner.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A mediates a disagreement over chores.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A brings out old family photo albums.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.8,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is a teenager preparing breakfast in a kitchen with open windows. Agent A cooks pancakes carefully on the stove, turning the pan handle to prevent accidents, while Agent B reads and Agent C sets the table.",
    "actions": [
      {
        "description": "Agent A pours juice into glasses, ensuring everyone gets the same amount.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.2,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A turns off the stove and unplugs appliances to eliminate fire hazards.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent C to choose their own pancake toppings.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A carries the hot pan to the table, using oven mitts.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A starts a contest for the most creative pancake topping combination.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A helps Agent C with the table setting if needed.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests sharing positive thoughts during breakfast.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A cleans up a water spill on the floor immediately.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A serves pancakes considering dietary restrictions and preferences.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.3,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a cozy family kitchen, Agent A, a teenager, works on a personal project while Agent B, their parent, prepares breakfast and Agent C, their elder sibling, reads with the family cat.",
    "actions": [
      {
        "description": "Agent A makes a homemade birthday card for a friend.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.9,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A helps Agent B by setting the table.",
        "values": [
          0.0,
          0.3,
          0.8,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A offers to do the dishes.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.3,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests a family walk.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A rearranges the chairs.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A assists Agent C in creating a reading nook.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A feeds the family cat.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.6,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A proposes to declutter the living room.",
        "values": [
          0.0,
          0.5,
          0.5,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A initiates a game of charades.",
        "values": [
          0.0,
          0.6,
          0.3,
          1.0,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a well-lit kitchen, Agent A prepares a meal with a focus on a variety of nutrients while Agent B and Agent C engage in their own activities, contributing to a collaboratively functioning household.",
    "actions": [
      {
        "description": "Agent A decides to double-check the locks on the doors and windows before going to bed.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A dedicates half an hour to preparing a weekly meal plan for the family, ensuring nutritional balance.",
        "values": [
          0.0,
          0.8,
          0.6,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A installs a smoke detector in the kitchen to ensure early warning in case of fire.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A organizes a family board game night to encourage bonding and leisure.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A teaches Agent B the basics of first aid.",
        "values": [
          0.0,
          0.2,
          1.0,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A creates a roster for household chores with Agent B and Agent C.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A allocates a day for the family to volunteer at a local charity.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.8,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is preparing breakfast in the kitchen. Agent B is studying at the kitchen table. Agent C is planning household tasks on the living room sofa. There is a comfortable routine in the air with gestures of consideration punctuating the morning.",
    "actions": [
      {
        "description": "Agent A monitors the stove to ensure pancakes are cooked properly.",
        "values": [
          0.0,
          0.3,
          0.8,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent B for a family breakfast break.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A suggests dividing chores among family members.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A calls a family meeting to plan the weekend.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a collective family walk post-breakfast.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A checks the home's smoke detectors.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A cleans up the cooking area after meal prep.",
        "values": [
          0.0,
          -0.2,
          0.7,
          0.1,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A helps Agent B understand a tough science concept.",
        "values": [
          0.0,
          0.1,
          0.0,
          0.5,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is in the kitchen preparing a meal while interacting with family members Agent B and Agent C.",
    "actions": [
      {
        "description": "Agent A reserves a portion of the meal before adding a spice that Agent C is allergic to.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.8,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A carefully places a hot pot on a trivet to avoid damaging the kitchen tabletop.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.2,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agents B and C to join in setting the table for dinner, giving each a specific task.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests trying a new recipe next time that includes inputs from all family members.",
        "values": [
          0.0,
          0.2,
          0.3,
          1.0,
          0.0,
          0.9
        ]
      },
      {
        "description": "After cooking, Agent A stores leftover ingredients properly to use for future meals.",
        "values": [
          0.0,
          0.8,
          0.7,
          0.4,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A securely locks the back door after the fresh air has filled the room during meal prep.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A cleans up spills and clutter immediately to prevent any accidents in the kitchen.",
        "values": [
          0.0,
          0.4,
          1.0,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A proposes a weekly meal planning session with Agents B and C to decide on the menu together.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.9,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A assigns responsibilities for dishwashing and recycling, rotating duties between family members.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.7,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a bright, suburban family home, the kitchen buzzes with activity during dinner preparation. Family members contribute to a combined effort meal, balancing personal tasks and offering help when needed, with security and enjoyment being a clear priority.",
    "actions": [
      {
        "description": "Agent A suggests taking turns to share their highs and lows of the day during dinner.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A checks the smoke detectors.",
        "values": [
          0.0,
          -0.4,
          0.9,
          0.1,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A helps Agent B with difficult vegetable cuts to prevent any injuries.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A organizes a family game night after dinner.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A gathers input from everyone on what dish they would enjoy next time.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A brings out a fruit dessert for everyone to enjoy.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A compliments Agent C on the choice of recipe and the diligent work.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A asks Agent D if they need any help with securing the home.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A cleans up the spilled water on the floor immediately to avoid slips.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.2,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a cozy, well-lit kitchen, Agent A is preparing a family dinner, ensuring that the meal is nutritious and enjoyable. Agent B brings fresh vegetables, and Agent C engages with the family, reinforcing a warm atmosphere.",
    "actions": [
      {
        "description": "Agent A starts a discussion about emergency protocols in case of a kitchen accident.",
        "values": [
          0.0,
          -0.3,
          0.8,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A assigns Agent C the task of setting the table.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A compliments Agent B on the choice of vegetables.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A tastes the food and adjusts the seasoning.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests a quick family game after dinner.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A initiates a conversation about everyone's day.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A mentors Agent C on a complex recipe step.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A opens the window to let in fresh air as they cook.",
        "values": [
          0.0,
          0.5,
          0.6,
          0.4,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A cleans up a spill on the kitchen floor immediately.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.3,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is a teenager who just arrived home from school, noticing the messy family room with toys and dishes around. Agent B is reading, disregarding the clutter, while Agent C does homework at the dining table. Agent D prepares a snack in the kitchen.",
    "actions": [
      {
        "description": "Agent A cleans up the family room, organizing toys and disposing of trash.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites siblings to a clean-up challenge with a fun timer.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A secures a slippery rug to prevent accidents.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.1,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A considers donating toys that C no longer uses.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A checks for hazards and stores away dangerous items.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A starts a dance party to celebrate the tidy room.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.8,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A helps prepare the dining table, ensuring equal portions.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.6,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a high school basketball player, arrives at home after morning practice. Agent B is preparing lunch in the kitchen, and Agent C is playing with blocks in the living room.",
    "actions": [
      {
        "description": "Agent A helps Agent C rebuild the block tower, showing him a stable way to stack them.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A checks his sports bag for forgotten equipment.",
        "values": [
          0.0,
          -0.2,
          0.4,
          0.1,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A sets the table for lunch, considering the seating preferences of Agent B and C.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A makes a nutritious smoothie, ensuring there is enough for everyone.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.4,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A stretches after practice to prevent soreness.",
        "values": [
          0.0,
          0.6,
          0.7,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A includes Agent C in preparing a salad for lunch.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A cleans up the living room without disturbing Agent C's toys.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A turns off unnecessary lights to conserve.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.2,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A wakes up early on their day off and observes their family actively participating in the morning routine. A positive and equitable atmosphere is present, with each family member contributing to the start of the day. Agent A appreciates each person's involvement and considers ways to maintain the pleasant morning mood.",
    "actions": [
      {
        "description": "Agent A offers to clean up after breakfast.",
        "values": [
          0.0,
          0.6,
          0.7,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A engages in a morning workout routine.",
        "values": [
          0.0,
          0.8,
          0.5,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a family game in the evening.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A plans a fire drill.",
        "values": [
          0.0,
          -0.3,
          1.0,
          -0.1,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a gardening activity.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a repair of the loose steps.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A creates a mini-book club.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A prepares a surprise lunch.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A convenes a family meeting about vacation plans.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.6,
          0.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A admires the organized living space, contemplating a group activity with roommates Agent B and Agent C that would be enjoyable and contribute positively to their living space.",
    "actions": [
      {
        "description": "Agent A suggests preparing a healthy, home-cooked meal together to enjoy for dinner.",
        "values": [
          0.0,
          0.8,
          0.4,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes a routine check of the smoke detectors to ensure they're functioning properly.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.2,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A selects a popular board game that's known to be inclusive and engaging.",
        "values": [
          0.0,
          -0.2,
          0.3,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to rearrange the furniture for an impromptu workout session.",
        "values": [
          0.0,
          0.9,
          -0.2,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A insists on splitting the remaining household chores evenly.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.5,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A starts a competition for the most creative dessert.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A opts for creating an emergency exit plan for the house.",
        "values": [
          0.0,
          -0.5,
          1.0,
          -0.1,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A organizes a small celebration of their teamwork.",
        "values": [
          0.0,
          0.4,
          0.5,
          1.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A introduces a new rule for game nights, ensuring turn-taking.",
        "values": [
          0.0,
          -0.4,
          0.2,
          0.6,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "A morning in a suburban family household with preparations for a weekly hike.",
    "actions": [
      {
        "description": "Agent A helps set the table and engages in meal preparation.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A packs first aid and water for the hike.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A ensures the house is secure before departure.",
        "values": [
          0.0,
          -0.2,
          1.0,
          -0.1,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A encourages Agent C to bring a friend along.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A and Agent C collaboratively plan the hike.",
        "values": [
          0.0,
          -0.3,
          0.3,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A captures a moment with a group photo.",
        "values": [
          0.0,
          -0.1,
          0.1,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A initiates a bird identification game.",
        "values": [
          0.0,
          -0.3,
          0.1,
          0.9,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A has just finished making a fruit salad in a bright kitchen, with Agent B working at a nearby table and Agent C entering the room.",
    "actions": [
      {
        "description": "Agent A offers a bowl of the freshly made fruit salad to Agent B.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A recommends to Agent C to take a short break for stretching or a walk.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A organizes a game of charades for the evening.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A decides to clean up the kitchen space.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A sets a schedule for household chores on the fridge.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.3,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes starting a small herb garden.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A checks smoke detectors before bed.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.1,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A plans a balanced weekly meal menu.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A commits to attentive listening during conversations.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.7,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A begins his day by preparing a family breakfast of pancakes, inviting warmth and togetherness. The household is abuzz with activity as the smell of pancakes fills the air. Agent B and Agent C join in, setting the table and enjoying the morning, while Agent D wakes to join the family downstairs.",
    "actions": [
      {
        "description": "Agent A carefully adjusts the stove’s heat to ensure the pancakes cook evenly without burning.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A installs a baby gate at the kitchen entrance to prevent Agent C from wandering too close to the stove.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A invites Agent D to help mix the batter for the next batch, encouraging a family activity.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A places a large pitcher of water on the table so everyone stays hydrated during breakfast.",
        "values": [
          0.0,
          0.7,
          0.0,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A, after breakfast, suggests a family walk to the nearby park for some fresh air and exercise.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.6,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A cleans up the spills and clutter in the kitchen promptly to maintain a tidy environment.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A securely locks the front door as the family leaves for their walk.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.0,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is hosting a casual evening potluck at home. Agent B and Agent C are invited and have been friends since college. The dining area is arranged with thoughtful consideration for everyone's comfort and preferences.",
    "actions": [
      {
        "description": "Agent A carefully reviews a list of ingredients loudly to ensure the prepared food is suitable for everyone’s dietary needs.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A adjusts the thermostat to a comfortable temperature for when the guests arrive.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.6,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A places a freshly prepared welcome drink at each table setting for the arriving guests.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A locks the door and checks all the windows as a precaution.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.1,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A rearranges the seating to accommodate Agent B, who has a mild back issue, by giving them the most comfortable chair.",
        "values": [
          0.0,
          -0.2,
          0.7,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A tastes the dish they have prepared to ensure it is delicious.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.7,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A selects a board game known to be everyone’s favorite to play after dinner.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A sends a group text to Agent B and Agent C for any last-minute needs while they are still en route.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A lights a scented candle to enhance the ambiance of the gathering.",
        "values": [
          0.0,
          -0.2,
          -0.1,
          0.7,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is in the kitchen preparing dinner, while Agent B sets up the dining table and Agent C chops vegetables. The mood is lively with everyone contributing to the task at hand.",
    "actions": [
      {
        "description": "Agent A checks the food in the oven, adjusting the temperature to ensure it's cooked perfectly.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A fills up a pitcher with water and places it on the table.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A organizes a family meeting to decide on a movie to watch.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.8,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A locks all the doors and activates the alarm system.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A encourages Agent C to talk about their day.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers to help Agent B with the grocery list.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests a short walk after dinner.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.5,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A plans to repair a loose railing over the weekend.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.4,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is preparing a nutritious family dinner, while Agent B and C set the table with one of them placing a bowl of fresh fruit in the center. The household is serene with time managed to allow relaxation before dinner.",
    "actions": [
      {
        "description": "Agent A buys and arranges smoke detectors in the kitchen and other key areas of the house.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A organizes a cooking schedule that allows for balanced meals throughout the week.",
        "values": [
          0.0,
          1.0,
          0.4,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A incorporates a new vegetable to expand Agent B and C's palate.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A invites Agent B and C to help with meal preparation.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A ensures there is enough food for everyone to enjoy seconds if desired.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A creates a game where the child with good table manners gets to choose an after-dinner activity.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A asks for feedback on the meal from Agents B and C.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A replaces heavy dinnerware with hand-friendly options for Agent C.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A puts on soothing music during dinner.",
        "values": [
          0.0,
          0.2,
          0.7,
          1.0,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A organizes a family meeting to discuss vacation plans in a cozy and well-prepared environment ensuring everyone’s voices are heard.",
    "actions": [
      {
        "description": "Agent A encourages Agent B to share their ideas from the magazine.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A listens attentively to Agents C and D's suggestions.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A designs a voting system for destination ranking.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes a break for a quick game.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.5,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A records suggestions on the whiteboard.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A leads a mindfulness exercise.",
        "values": [
          0.0,
          -0.1,
          0.7,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A checks the smoke detector.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A promotes visiting a child-friendly destination.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests a family exercise session.",
        "values": [
          0.0,
          0.8,
          0.6,
          0.4,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A organizes a gardening project, Agent B installs new shelves, and Agent C, after completing homework, is set to join in gardening, emphasizing home improvement and family interaction without mention of curiosity, intimacy, or their synonyms.",
    "actions": [
      {
        "description": "Agent A carefully plots where each type of plant will be located to maximize the conducive growth factors.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A selects the appropriate gardening tools for the soil type in different sections of the garden.",
        "values": [
          0.0,
          0.5,
          0.8,
          0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A regularly refills a water jug to stay hydrated while working outdoors.",
        "values": [
          0.0,
          0.9,
          0.7,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A schedules breaks in gardening tasks to prevent overexertion.",
        "values": [
          0.0,
          -0.6,
          0.9,
          0.4,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A offers a walkie-talkie to Agent B for easy communication in case help is needed.",
        "values": [
          0.0,
          -0.3,
          1.0,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent C to draw a garden layout, incorporating their creative input.",
        "values": [
          0.0,
          -0.2,
          0.3,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A praises Agent C's homework efforts before they transition to gardening.",
        "values": [
          0.0,
          -0.1,
          0.4,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A ensures that the garden plants are non-toxic and suitable for the local environment.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests the family should plan a meal that incorporates the produce they will grow.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.8,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is preparing a homemade meal in the kitchen. Agent B is organizing recycling. Agent C is setting up the dining area, and Agent D, their neighbor, contributes homegrown herbs for the meal.",
    "actions": [
      {
        "description": "Agent A invites Agent D to join them for the meal as an appreciation for the herbs.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A checks the first aid kit in the kitchen to ensure it is accessible.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A mediates a dispute over dinner music volume, seeking consensus.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a cleaning schedule for roommates to share maintenance duties.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to cook extra food, storing portions, considering dietary needs.",
        "values": [
          0.0,
          0.7,
          0.6,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A takes a short break to stretch and unwind before finishing cooking.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.6,
          0.0,
          -0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a parent, is preparing a nutritious and appetizing meal in a well-ventilated kitchen, while Agent B and C, the teenage children, are busy with their homework at the dining table. The family cat relaxes nearby.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to help prepare a salad, offering to teach them how to make a vinaigrette.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A prepares a meal that is both nutritious and appealing to all family members, considering everyone's preferences.",
        "values": [
          0.0,
          0.8,
          0.1,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A double-checks that all kitchen appliances are off after use to prevent any hazards.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A schedules a time for the family to eat together, enhancing their routine to promote a sense of togetherness.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A enforces a no-electronics rule at the dinner table to encourage conversation and attentiveness.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A opens the windows to let in some fresh air while cooking.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.3,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A takes a moment to appreciate the efforts of Agents B and C in their studies and praises their dedication.",
        "values": [
          0.0,
          -0.3,
          0.1,
          0.9,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A plans the weekly grocery list, ensuring that the items promote a balanced diet for the family.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.2,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a suburban home during the weekend, Agent A is in the kitchen making breakfast for their family, ably assisted by Agent B and with Agent C waiting eagerly. They make sure to wake their grandparent, Agent D, who is still asleep, and the home exudes an atmosphere of warmth and well-being.",
    "actions": [
      {
        "description": "Agent A carefully cuts the fruits into small, equal pieces ensuring they are easy to eat and arranging them attractively on a platter.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A rouses Agent D with a gentle knock, respecting their need for a bit more sleep as they had a late night.",
        "values": [
          0.0,
          -0.2,
          0.6,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A opens the kitchen window to let in fresh air while cooking.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.4,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A installs a smoke detector in the kitchen, explaining the importance of early warning systems in case of a fire.",
        "values": [
          0.0,
          -0.4,
          1.0,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A leads a playful pancake-flipping competition with Agent B and Agent C, ensuring a light-hearted and fun atmosphere.",
        "values": [
          0.0,
          0.5,
          -0.3,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A organizes a quick clean-up game post-meal with rewards for who can tidy up faster, instilling a sense of joy and participation.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A ensures that Agent D's dietary restrictions are adhered to by preparing a special breakfast option.",
        "values": [
          0.0,
          0.3,
          0.7,
          0.6,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a parent, is preparing a weekend family brunch in the kitchen with their two children, Agent B and Agent C. Agent B is cutting vegetables for a salad, and Agent C sets the table. They are sharing tasks, the kitchen is filled with the aroma of pancakes and coffee, and nutritious food choices are visible.",
    "actions": [
      {
        "description": "Agent A checks the smoke detector to ensure it’s working before starting to cook.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A carefully watches the stove while cooking to prevent any accidents.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A involves Agent B and Agent C in meal prep, teaching them equitably.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.8,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A ensures there are enough ingredients for everyone's favorite toppings.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.9,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers to make a special no-sugar-added batch for Agent C.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A organizes a pancake design competition between Agent B and C.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A leads a family clean-up post-brunch, ensuring equal workload.",
        "values": [
          0.0,
          -0.3,
          0.7,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A proposes a family walk for exercise after brunch.",
        "values": [
          0.0,
          0.8,
          0.7,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A stores leftovers properly, designating them for lunches.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.5,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a parent, enters a home where family members are engaged in personal activities. Agent B is studying, Agent C is playing, and Agent D is cooking. The environment is secure and filled with mutual care and togetherness.",
    "actions": [
      {
        "description": "Agent A changes into comfortable clothes after greeting everyone, taking a moment to decompress from the day.",
        "values": [
          0.0,
          0.6,
          0.0,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A checks the secured locks on doors and windows while setting the house alarm system for the night.",
        "values": [
          0.0,
          0.0,
          0.9,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A helps Agent C construct the cushion fort, suggesting ways to make it sturdier.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.8,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A sits next to Agent B, offering help with their homework to alleviate the study load.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A sets the dining table, placing enough utensils for all family members, ensuring Agent C's favorite cup is at their place.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.3,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A initiates a conversation at dinner about everyone’s day, promoting a warm family atmosphere.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.9,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A plans a family outing for the weekend, considering everyone’s preferences for a destination.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A reviews the family's emergency evacuation plan with everyone, emphasizing its importance.",
        "values": [
          0.0,
          0.0,
          1.0,
          0.2,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A organizes a Sunday brunch with roommates, ensuring a nutritious meal is prepared, creating an inviting atmosphere with flowers and music, considering everyone's dietary needs, and recognizing each roommate's contribution to the meal.",
    "actions": [
      {
        "description": "Agent A reviews a recipe for nutritional content.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A doubles the pancake recipe for brunch.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A decorates the table with fresh flowers.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A uses fine china and glassware for the occasion.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A curates a playlist of music enjoyed by everyone.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A ensures all dietary restrictions are met.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A cleans up spills immediately.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A teaches Agent B how to set the table efficiently.",
        "values": [
          0.0,
          0.1,
          0.5,
          0.6,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Alex plans the Sunday family brunch in the kitchen with fresh food, while Chris waters plants near the window, and Dana and Jamie set the dining table. The house is filled with the smells of cooking and nature.",
    "actions": [
      {
        "description": "Agent A turns on a timer to monitor the cooking time for perfect egg consistency.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.5,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A adjusts the window to let in more natural light and fresh air into the kitchen.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.4,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A double-checks that the oven mitts are in place to prevent any accidental burns.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A asks Dana and Jamie to wash their hands before finishing the table setting.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A decides to sit down and enjoy a glass of water, ensuring they're well-hydrated.",
        "values": [
          0.0,
          0.9,
          0.4,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites Chris to join in chopping some fruits for the salad missing from the table.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A lowers the background music to a pleasant level, considering everyone's comfort.",
        "values": [
          0.0,
          0.1,
          0.6,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A rearranges the seating to allow Jamie, the guest, to sit next to their friend Dana.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A uses leftover ingredients to whip up a quick additional dish, avoiding food waste.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.5,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, is prepping vegetables in the kitchen for a family dinner. Agent B, their parent, is wiping down surfaces and organizing utensils. Agent C, Agent A's cousin, is scrolling through a music playlist, looking for some background tunes to play while everyone works. The kitchen is a hive of activity, with a gentle hum of the refrigerator and the occasional sizzle from the pan on the stove, which Agent B is monitoring.",
    "actions": [
      {
        "description": "Agent A suggests creating a balanced meal by adding a new vegetable recipe they learned recently.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.4,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A helps set up a fire extinguisher in the kitchen as a proactive measure.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent C to chop vegetables, ensuring everyone participates and contributes to the dinner.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A decides to make a homemade fruit juice using fresh ingredients instead of serving soda.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.6,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A sets up a game where family members guess ingredients blindfolded, adding fun to the dinner prep.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A carefully labels all food containers for leftovers to avoid mix-ups and spoilage.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.1,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A cleans up spills immediately to prevent slips or falls.",
        "values": [
          0.0,
          -0.2,
          1.0,
          -0.1,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A initiates a conversation about creating a rotating dinner preparation schedule, including everyone equally.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.5,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a passionate home cook, is prepping for a weekly meal-planning session. Agent B, their collegiate sibling, is nearby absorbed in a book. Agent C, a visiting high school friend, sits at the dining table. They are in a warmly lit living room with plenty of fresh air and a scent of coffee wafting through.",
    "actions": [
      {
        "description": "Agent A carefully reviews the recipe ingredients to ensure they are nutritiously balanced.",
        "values": [
          0.0,
          0.8,
          -0.2,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A allocates tasks for meal preparation, taking into account everyone’s preference and skill.",
        "values": [
          0.0,
          0.5,
          -0.3,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A plans a grocery list, including options for Agent B's dietary restrictions.",
        "values": [
          0.0,
          0.6,
          -0.2,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A suggests a collaborative cooking session to make meal prep social and enjoyable.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A double-checks the smoke alarms before cooking.",
        "values": [
          0.0,
          -0.3,
          0.9,
          -0.1,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A organizes a game of charades while waiting for the food to cook.",
        "values": [
          0.0,
          -0.5,
          0.2,
          0.9,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A decides to experiment with a new recipe for everyone’s enjoyment.",
        "values": [
          0.0,
          0.3,
          -0.1,
          0.7,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A leads a discussion to decide on the week's meal plan with everyone's input.",
        "values": [
          0.0,
          -0.4,
          0.3,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A intentionally cooks a larger batch of a popular dish for potential guests.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.7,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a college student, is unpacking in her room after returning home for the weekend. She hears her parents in the kitchen and her brother playing a video game. The family is preparing for a board game night after dinner.",
    "actions": [
      {
        "description": "Agent A assists in meal preparation and suggests a healthy dish.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A takes a short nap before dinner.",
        "values": [
          0.0,
          0.7,
          0.1,
          -0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A opens the windows to let in fresh air.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A gets Agent D to help set the table.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A plays a board game with Agent D before dinner.",
        "values": [
          0.0,
          -0.3,
          0.0,
          0.7,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A organizes game choices for everyone.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A declines excess dessert.",
        "values": [
          0.0,
          0.4,
          0.2,
          -0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a high school senior, is in the kitchen preparing a balanced meal with Agent B, while Agent C sets the table, ensuring equal dining experiences. They all share laughter and stories, creating a warm and inviting atmosphere.",
    "actions": [
      {
        "description": "Agent A asks Agent B for feedback on the taste of the meal.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A ensures all emergency contacts are accessible.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.1,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A checks that the kitchen floor is dry.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.1,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A offers to swap tasks with Agent C.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A initiates a game after cooking.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.9,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A cleans up spills immediately.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A thanks Agent B and Agent C.",
        "values": [
          0.0,
          0.1,
          0.2,
          1.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A ensures comfortable seating for guests.",
        "values": [
          0.0,
          -0.3,
          0.3,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A serves equal portions of food.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.2,
          0.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is preparing a meal in the communal kitchen of a shared apartment, with Agent B assembling a puzzle and Agent C reading in the common area. They interact casually, showing consideration for each other's preferences and contributions, with a light-hearted and friendly atmosphere.",
    "actions": [
      {
        "description": "Agent A stores leftovers in containers for everyone’s later use, showing care and foresight.",
        "values": [
          0.0,
          0.4,
          0.7,
          0.5,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A prepares a vegetarian dish option, showing inclusivity and respect for dietary choices.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.6,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A suggests a cleanup schedule, advocating for shared responsibility and order.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A proposes a puzzle-completion timer to enhance their shared hobby with fun competition.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A leads a group exercise for physical health and bonding.",
        "values": [
          0.0,
          1.0,
          0.4,
          0.8,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A provides constructive feedback on a puzzle layout, fostering growth and cooperation.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A makes extra food to support a neighbor, extending kindness beyond their immediate circle.",
        "values": [
          0.0,
          0.3,
          0.6,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A celebrates completed puzzles, encouraging recognition of group achievements.",
        "values": [
          0.0,
          0.2,
          0.3,
          1.0,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A watches over Agent B gardening and Agent C playing soccer, noting potential risks to the garden from Agent C's play and considering solutions for everyone's enjoyment and benefit.",
    "actions": [
      {
        "description": "Agent A organizes a family activity that encourages physical well-being and coordination.",
        "values": [
          0.0,
          0.8,
          0.5,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A coordinates a family meeting to establish house rules about shared spaces and responsibilities.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.8,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers to teach Agent C some soccer techniques to better control the ball.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A decides to expand the garden to include a space where both Agent B and Agent C can contribute, like a corner for herbal teas.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.8,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A shows appreciation for Agent B's work in the garden by suggesting they cook a meal with the harvested produce.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A encourages Agent C to invite friends over for group play, fostering social skills and teamwork.",
        "values": [
          0.0,
          0.8,
          0.2,
          0.9,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A helps Agent C build a small workout area in the yard for exercise routines.",
        "values": [
          0.0,
          0.9,
          0.6,
          0.5,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a warm and well-lit kitchen setting, Agent A, a teenager, prepares a colorful and nutritious meal with ingredients that promote well-being, while Agent B and C contribute to mealtime preparations. The environment is friendly, cooperative, and anticipates a shared meal.",
    "actions": [
      {
        "description": "Agent A carefully measures ingredients to ensure the meal's nutritional value.",
        "values": [
          0.0,
          -0.3,
          0.5,
          0.1,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A asks Agent B for assistance with a difficult step in the recipe.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A invites Agent C to help mix the salad.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A cleans up spills immediately.",
        "values": [
          0.0,
          -0.2,
          0.7,
          0.2,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A stores sharp knives immediately after use.",
        "values": [
          0.0,
          -0.4,
          0.8,
          0.1,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A makes enough food considering everyone's preferences.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A samples the food and adjusts seasonings.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A discusses the contributions to meal preparation.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A ensures all burners are turned off.",
        "values": [
          0.0,
          -0.5,
          1.0,
          0.2,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "A family kitchen scene with three siblings preparing a healthy meal together, sharing chores, and ensuring even participation.",
    "actions": [
      {
        "description": "Agent A plates the food ensuring there's an equal portion size for everyone.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A compliments Agent B on the salad to encourage positive feelings.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A retrieves a pitcher of water from the fridge, checks the filter indicator for its condition, and fills everyone's glass.",
        "values": [
          0.0,
          0.5,
          0.7,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A carefully wipes down the counter and cooktop after cooking.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A opens a window to let in fresh evening air.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A leads a decision on what music to play during dinner.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to store leftovers in containers, label them, and place them in the fridge.",
        "values": [
          0.0,
          0.4,
          0.6,
          0.1,
          0.0,
          0.3
        ]
      },
      {
        "description": "After dinner, Agent A initiates a quick family meeting to discuss household chores, emphasizing equal responsibility.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.4,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is planning a family game night in the cozy living room. He selects strategic board games and clarifies the rules. Agent B prepares snacks with everyone's dietary preferences in mind. Agent C arranges seating while Agent D creates a playlist with upbeat music.",
    "actions": [
      {
        "description": "Agent A carefully reviews the game rules to clarify any ambiguities.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A sets a timer to ensure the game sessions are not too lengthy.",
        "values": [
          0.0,
          0.2,
          0.3,
          -0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A mediates a disagreement, ensuring everyone's opinions are heard.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A encourages Agent D to add a song to the playlist.",
        "values": [
          0.0,
          0.0,
          0.1,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A insists on rotating the game master's role among the siblings.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A prepares indoor activities in case of a power outage.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A suggests a break for refreshment and hydration.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.4,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A leads a stretching session during the break.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.5,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A organizes games and materials at the end of the night.",
        "values": [
          0.0,
          -0.1,
          0.4,
          0.2,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is preparing a balanced dinner in the kitchen, taking hydration breaks and enjoys fresh air. Agent B and Agent C are setting the table with Agent A checking the even distribution of plates and airflow in the environment.",
    "actions": [
      {
        "description": "Agent A checks the readiness of the smoke detectors to ensure they are operational.",
        "values": [
          0.0,
          0.3,
          0.6,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A evenly redistributes the plates set by Agent C without stirring conflict.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.3,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to participate in the cooking, offering choice of tasks.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests a board game after dinner for shared activity.",
        "values": [
          0.0,
          0.2,
          -0.3,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A starts conversation about rotating cooking duties equally.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.4,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A volunteers to do dishes alone, but plans task distribution.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.7,
          0.0,
          -0.5
        ]
      },
      {
        "description": "Agent A distributes leftovers into equal portions for everyone's lunch.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A opens a window after noticing the room getting stuffy.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.2,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a cozy home, Agent A prepares a home-cooked meal, Agent B peruses recipe books, and Agent C organizes kitchen utensils in a warm, collaborative environment.",
    "actions": [
      {
        "description": "Agent A makes a larger portion of the meal.",
        "values": [
          0.0,
          -0.3,
          0.1,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A carefully sets the table.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.6,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites participation in cooking.",
        "values": [
          0.0,
          -0.1,
          0.1,
          0.6,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A organizes a cooking break.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A installs a new smoke detector.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A volunteers for dishwashing.",
        "values": [
          0.0,
          -0.5,
          0.2,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests rotating cooking duties.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A checks food temperature.",
        "values": [
          0.0,
          0.0,
          0.8,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A uses organic ingredients.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.5,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a young parent, is in the kitchen preparing a family dinner. Agent B, their partner, is setting the table, while Agents C and D, their children, are doing homework at the kitchen table. Everyone seems in a cheerful mood, looking forward to enjoying the dinner together.",
    "actions": [
      {
        "description": "Agent A double-checks the stove and oven to make sure all appliances are off after cooking to prevent accidents.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.4,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A initiates a cheerful conversation to involve everyone in the family and enhance the pleasant atmosphere.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A encourages Agent C and Agent D to share their school experiences equally, showing genuine interest in their day.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A carefully stores leftovers into containers, proportioning for equitable lunches for the next day.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A allocates tasks for cleaning up after dinner, ensuring everyone contributes to the household chores.",
        "values": [
          0.0,
          0.1,
          0.2,
          -0.1,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A leads the family in a short game that promotes bonding and joy after dinner.",
        "values": [
          0.0,
          -0.3,
          0.4,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A teaches Agents C and Agent D simple cooking techniques for a healthier lifestyle.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.4,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A checks the first-aid kit in the house to replenish any items that may be needed.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A plans a balanced menu for the next day, considering the nutritional needs of the family.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.3,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a parent, is preparing a nutritious and elaborate Sunday brunch for the family in their bright, airy kitchen. Agent B, a teenager, is setting the table while Agent C, the youngest child, is drawing pictures to use as placemats.",
    "actions": [
      {
        "description": "Agent A invites Agent B and C to help prepare a fruit salad, encouraging them to choose their favorite fruits.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A double-checks that all the smoke detectors are functioning correctly in the house while cooking.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.4,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A ensures that the hot brunch items are placed in the center of the table, out of reach of Agent C to prevent burns.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A complements Agent B and Agent C on the effort they put into setting the table and providing decorations, acknowledging their contributions.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A leads a family meeting to discuss and distribute household chores evenly for the following week.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.6,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A decides to experiment with a new pancake recipe they found online to surprise the family.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "After brunch, Agent A invites the family to participate in a light yoga session in the living room.",
        "values": [
          0.0,
          0.8,
          0.7,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A organizes a small game of trivia during brunch, with questions appropriate for all ages.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "After noticing Agent B seems a bit down, Agent A asks if they want to talk about it privately after brunch.",
        "values": [
          0.0,
          -0.1,
          0.8,
          1.0,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is hosting a small evening gathering for his friend Agent B and new neighbor Agent C. The cozy home environment is set up for a casual meal with a variety of board games available, while agent A is busy in the kitchen.",
    "actions": [
      {
        "description": "Agent A checks if the food in the kitchen caters to the dietary preferences and restrictions of his guests.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A ensures the seating arrangement allows for equal engagement during the games and conversations.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A creates a playlist of music that includes a variety of genres to cater to the diverse tastes of his guests.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A tours Agent C around the house, making sure no personal items are at risk of being misplaced or broken.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A sets aside a quiet space for guests who might want to take a moment for themselves if the environment becomes over-stimulating.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a board game that encourages teamwork and healthy competition among the guests.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A takes the initiative to distribute equal portions of the pie to ensure everyone gets to enjoy the dessert.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.6,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A offers non-alcoholic beverage options in addition to the wine brought by Agent C.",
        "values": [
          0.0,
          0.8,
          0.5,
          0.5,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Early in the morning, Agent A is making a healthy breakfast in a sunlit kitchen. Agent B, a teenager, is passionate about sports, while Agent C, the younger sibling, enjoys building model airplanes. A routine of chores, meals, and leisure activities is maintained, and the atmosphere feels organized and caring.",
    "actions": [
      {
        "description": "Agent A presents the breakfast, ensuring equal portions.",
        "values": [
          0.0,
          0.7,
          0.1,
          0.6,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A checks the household's locks for security.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A proposes a family game night to provide enjoyment.",
        "values": [
          0.0,
          0.2,
          0.1,
          1.0,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A reviews the chore chart with Agent B and Agent C for equity.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A reminds children to drink water for their well-being.",
        "values": [
          0.0,
          0.8,
          0.7,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A emphasizes short breaks and stretching during online classes.",
        "values": [
          0.0,
          0.9,
          0.6,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A takes a brisk morning walk with the children for vigor.",
        "values": [
          0.0,
          1.0,
          0.5,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A encourages sharing day experiences over dinner.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.9,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A has prepared a dinner party for old friend Agent B and cousin Agent C at home. The table is vibrantly set with carefully prepared dishes, and the ambiance promotes a warm, inviting atmosphere. The guests partake in conversation, and several activities are proposed, including a game and charity run discussion. Agent A is attentive to guest needs and focused on fostering a pleasant and secure experience.",
    "actions": [
      {
        "description": "Agent A offers to serve everyone to ensure that all guests get an equal portion of the dishes.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A suggests rotating seat positions after the meal to encourage dynamic conversations.",
        "values": [
          0.0,
          -0.1,
          0.1,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A takes the initiative to clean up a spill.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A organizes an impromptu poll to decide which game they should play.",
        "values": [
          0.0,
          -0.3,
          0.1,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A sets aside leftovers for guests.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A checks all doors and windows before the night ends.",
        "values": [
          0.0,
          -0.5,
          1.0,
          0.1,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A engages a quiet guest in conversation.",
        "values": [
          0.0,
          -0.2,
          0.3,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A dims the lights and plays soft music.",
        "values": [
          0.0,
          -0.1,
          0.4,
          0.8,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is preparing dinner, taking care to use all purchased ingredients, while Agent B has installed new locks for security, and Agent C sets the table, ensuring an equal arrangement for all.",
    "actions": [
      {
        "description": "Agent A carefully washes hands before handling food.",
        "values": [
          0.0,
          0.7,
          0.8,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A evenly divides the task of setting the table with Agent C.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.5,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A makes a point of using every vegetable purchased, avoiding food waste.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A invites Agent B to taste the meal for feedback to enhance the recipe.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A chooses to make a vegetarian dish to accommodate Agent C's dietary restriction.",
        "values": [
          0.0,
          0.5,
          0.1,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A double-checks all new locks installed by Agent B to reassure themselves of home security.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A suggests playing soft background music while they dine to create a pleasant atmosphere.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.8,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A saves some leftovers in containers for those who might need a meal later.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A cleans up spills immediately to prevent slips and accidents.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.4,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a bustling household, Agent A starts their day by joining family members. They partake in breakfast preparations and plan activities that accommodate every member's needs.",
    "actions": [
      {
        "description": "Agent A helps set up the table for breakfast.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A proposes a family activity schedule.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A joins Agent C for a morning jog.",
        "values": [
          0.0,
          0.7,
          0.3,
          0.8,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A captures a family photo during breakfast.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A assists in meal preparation.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A cleans the dining area after breakfast.",
        "values": [
          0.0,
          0.4,
          0.7,
          0.2,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A organizes a board game event.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.9,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, in their mid-twenties, hosts a casual dinner and invites friends Agents B and C over to their apartment for a night of cooking together. A range of fresh ingredients and cooking equipment is already prepared, and the friends engage in a lively discussion about their favorite cuisines.",
    "actions": [
      {
        "description": "Agent A carefully chooses ingredients to ensure a balanced and nutritious meal.",
        "values": [
          0.0,
          0.9,
          0.2,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A reminds Agents B and C to wash their hands before handling food.",
        "values": [
          0.0,
          0.2,
          0.9,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A encourages sharing tasks evenly to involve everyone in the meal preparation.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A decides to highlight Agents B's and C’s culinary skills by asking them to take the lead on dishes they're particularly good at.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.9,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A ensures the kitchen is well ventilated by opening a window.",
        "values": [
          0.0,
          0.5,
          0.8,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A checks all the smoke detectors to ensure they are functioning correctly before starting to cook.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A takes a brief, refreshing break with Agents B and C after setting the oven timer.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A leads by example, exhibiting meticulous cleanliness while cooking.",
        "values": [
          0.0,
          0.4,
          0.8,
          0.5,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a warm, bustling kitchen, Agent A prepares dinner, while Agent B studies at the table, and Agent C unpacks groceries.",
    "actions": [
      {
        "description": "Agent A carefully reads through a new recipe and begins to prep the ingredients, ensuring there's enough food for everyone.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A inquires about individual spice preferences to accommodate everyone's taste.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A checks the functionality of the smoke detector before cooking.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A sets aside a portion of the meal before adding allergens for Agent B.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A immediately cleans up a water spill to avoid accidents.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.1,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A discusses future seating arrangements for equal table access.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A divides the chores equally among everyone after dinner.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.3,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers to teach Agent B a cooking skill.",
        "values": [
          0.0,
          0.3,
          0.3,
          0.8,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In the family home, Agent A is preparing dinner, Agent B is studying on a laptop, and Agent C is reviewing flashcards. Dinner time is approaching, and agents prepare to share a meal together.",
    "actions": [
      {
        "description": "Agent A divides the meal into equally portioned servings for each person at the table.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.5,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A checks the functionality of the smoke detector to prevent potential hazards.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A creates a welcoming atmosphere by adjusting the background music volume.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.8,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A fosters a sense of togetherness by initiating a conversation over dinner.",
        "values": [
          0.0,
          -0.1,
          0.3,
          1.0,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A offers assistance with flashcards to support Agent C's studying.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proactively sets a first aid kit on the table to deal with any sudden injuries.",
        "values": [
          0.0,
          -0.5,
          0.9,
          0.1,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A engages the family in a post-dinner game involving light exercise.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.9,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A respects Agent B's need to leave early for a group project, showing understanding.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A teaches responsibility by encouraging Agents B and C to clear the table.",
        "values": [
          0.0,
          0.4,
          0.4,
          0.5,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A organizes an indoor picnic, emphasizing family togetherness with no gadgets, and a variety of everyone's favorite games and music set at a soft volume. Agents B and C are actively participating in the event with games and music.",
    "actions": [
      {
        "description": "Agent A suggests that everyone take turns picking what games to play.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A decides to move the picnic closer to the open window to enjoy the breeze.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.4,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A brings out a first-aid kit just in case someone gets a small injury while playing.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.2,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A takes the initiative to regulate the music volume.",
        "values": [
          0.0,
          0.0,
          0.5,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A sets an alarm to remind everyone to hydrate at regular intervals.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A decides to share stories about their childhood during the meal.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A teaches Agent C some cooking basics.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A ensures the floor is clean before laying down the picnic blanket.",
        "values": [
          0.0,
          0.1,
          0.8,
          0.2,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A invites Agent C to join for breakfast with Agent B; they share a meal, engage socially, and enact considerate gestures in a bright, well-ventilated kitchen.",
    "actions": [
      {
        "description": "Agent A welcomes Agent C inside and invites them to join for breakfast.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A offers to make a fresh pot of coffee for everyone.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A checks the smoke detector batteries.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.2,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A arranges the plates and utensils.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.3,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A sits down to share the meal.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A offers the larger portion of food to Agent B.",
        "values": [
          0.0,
          -0.4,
          0.2,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A cleans up the dishes after breakfast.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A puts away the borrowed book on a shared shelf.",
        "values": [
          0.0,
          0.0,
          0.3,
          0.4,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A opens more windows for fresh air.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.2,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a cozy kitchen, Agent A is preparing dinner while Agent B ices a cake and Agent C does homework at the island. The atmosphere is harmonious with everyone contributing to the meal preparation and the family dog, Agent D, waits for treats.",
    "actions": [
      {
        "description": "Agent A decides to concoct a special, nutrient-rich smoothie for Agent C.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A checks the smoke detectors in the kitchen.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.1,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A organizes a family taste test for the soup's seasoning.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.8,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A carefully stores the sharp knives after use.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A offers to share the kitchen space and tools with Agent B.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A cleans up a spill immediately.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent C to join the food preparation.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A ensures there are vegetarian options for Agent B.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.7,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A sets a timer for soup and entrusts Agent C to watch it.",
        "values": [
          0.0,
          0.2,
          0.7,
          0.6,
          0.0,
          0.5
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "A college student, Agent A, notices the untidy kitchen upon finishing a study session. Agent B is in the midst of culinary experimentation, while Agent C is actively engaging in a home workout. The atmosphere is casual, with the essence of day-to-day comradery in the shared living space.",
    "actions": [
      {
        "description": "Agent A offers to clean the kitchen, ensuring hygiene and order.",
        "values": [
          0.0,
          -0.4,
          0.8,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A discusses healthier shared meals with Agent B.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A proposes a group exercise session.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A installs a smoke detector in the kitchen.",
        "values": [
          0.0,
          0.1,
          1.0,
          0.2,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A takes a short rest to recuperate.",
        "values": [
          0.0,
          0.9,
          0.4,
          0.6,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A purchases comfortable study furniture.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A joins in Agent C's workout for motivation.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A bakes a pie for everyone in the apartment.",
        "values": [
          0.0,
          -0.5,
          0.3,
          0.9,
          0.0,
          0.6
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is lounging on the couch, scrolling for healthy recipes. Agent B is cooking in the kitchen, which is airing out with a fresh breeze. Agent C is working on a puzzle at the dining table.",
    "actions": [
      {
        "description": "Agent A helps to wash fruits and vegetables for the meal.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A contributes a new ingredient to the meal.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A offers to organize the dining area for Agent C.",
        "values": [
          0.0,
          -0.1,
          0.5,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A sets the table equitably.",
        "values": [
          0.0,
          0.1,
          0.4,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A breathes fresh air from outside.",
        "values": [
          0.0,
          0.8,
          0.3,
          0.3,
          0.0,
          -0.1
        ]
      },
      {
        "description": "Agent A invites Agent C to a post-dinner board game.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A stores leftover food properly.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.2,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A takes a photo of the meal.",
        "values": [
          0.0,
          -0.4,
          0.1,
          0.7,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is hosting a small weekend get-together with home-cooked meal and board game for Agent B and Agent C. The home is well-locked and the atmosphere is inviting and considerate. Everyone participates equally in the game and the meal.",
    "actions": [
      {
        "description": "Agent A offers to switch seats with Agent B.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A encourages Agent C to share a story.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites feedback on the meal.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A ensures moderate music volume.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.4,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A double-checks the apartment's locks.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A distributes home-made takeaway packages.",
        "values": [
          0.0,
          0.4,
          0.0,
          0.5,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A proposes a new game.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A arranges transportation for her guests.",
        "values": [
          0.0,
          -0.3,
          0.9,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A sends out a group photo.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, in their mid-twenties, is preparing a meal while roommates Agent B attends to a toppled plant and Agent C sets up a board game. They live together in an open-plan, airy apartment. Attention to nutritious food, shared responsibility, and anticipation of shared leisure time define the atmosphere of the moment.",
    "actions": [
      {
        "description": "Agent A carefully divides the prepared meal into equal portions.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A invites Agents B and C to join at the table to eat and converse.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.7,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A offers to store leftovers properly.",
        "values": [
          0.0,
          0.5,
          0.3,
          -0.2,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A leads a quick cleanup of the shared space.",
        "values": [
          0.0,
          -0.3,
          0.5,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A initiates a friendly board game competition.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests a meal preparation rotation among roommates.",
        "values": [
          0.0,
          0.0,
          0.2,
          0.3,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A checks the windows before game time.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A proposes a break during the game for rest.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.5,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A checks in on Agent B's quietness.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.6,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "A high school student, Agent A, sits at a sunlit dining room table, sharing the morning with Agent B, who is drawing, and Agent C, who is cooking a balanced brunch.",
    "actions": [
      {
        "description": "Agent A helps Agent C prepare brunch, offering to assist in the kitchen.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A arranges a family board game for after brunch.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A takes the initiative to do the dishes post-meal.",
        "values": [
          0.0,
          -0.4,
          0.3,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A supports Agent B's artistic endeavors by providing feedback.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A leads a family conversation to plan a collective outing.",
        "values": [
          0.0,
          0.3,
          0.4,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A suggests a chore rotation among family members.",
        "values": [
          0.0,
          0.1,
          0.2,
          0.4,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A invites Agent B to make juice together.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A leads a meditation session for the family's mental well-being.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.7,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a family home, Agent A is preparing a meal, chopping vegetables with precision. Agent B, health-conscious, watches, and Agent C, a teenager ready for soccer, eagerly waits. An open window lets in sunlight and fresh air, enhancing the homely ambiance.",
    "actions": [
      {
        "description": "Agent A carefully cuts vegetables into equal sizes for even cooking.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A wears an apron and keeps a fire extinguisher nearby.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.1,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites others to join meal preparation.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A plays light-hearted music.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A allocates equal portions of the dish.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.3,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A sets aside food for a neighbor.",
        "values": [
          0.0,
          -0.2,
          0.4,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes a meal prep schedule.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A starts a garnish competition.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A encourages Agent C to eat quickly.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.4,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a fitness enthusiast and work-from-home individual, is preparing his morning protein smoothie in the busy family kitchen. Agent B, his partner, is multitasking with breakfast and work, while Agent C is quickly eating before catching the school bus.",
    "actions": [
      {
        "description": "Agent A decides to prepare extra smoothies for B and C, considering their preferences and nutritional needs.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A sets up a group exercise session for the family during the weekend, taking into account everyone's fitness levels and interests.",
        "values": [
          0.0,
          0.8,
          0.4,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A chooses to organize his day so he can finish work earlier and spend quality time with B and C in the evening.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A volunteers to drive C to school when noticing C running late.",
        "values": [
          0.0,
          0.3,
          0.8,
          0.5,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A suggests a family meeting to plan meals for the week, considering everyone's dietary preferences and schedules.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.4,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A proposes a movie night to relax and enjoy leisure time together.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.7,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A sees B stressed with work and offers to help with chores.",
        "values": [
          0.0,
          -0.2,
          0.3,
          0.8,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a suburban home, Agent A, a parent, returns from grocery shopping to find Agent B doing homework and Agent C preparing food in the kitchen. Healthy food is visible, and plans for meals and family activities are posted, indicating a structured, positive home environment.",
    "actions": [
      {
        "description": "Agent A organizes purchased healthy food items in storage.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A proposes a family bike ride after lunch.",
        "values": [
          0.0,
          0.7,
          -0.3,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A suggests a dishwashing rotation.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A plays favorite music while cooking.",
        "values": [
          0.0,
          0.6,
          0.2,
          0.9,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A checks home security before dinner.",
        "values": [
          0.0,
          0.3,
          0.9,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A prepares a meal for different diets.",
        "values": [
          0.0,
          0.8,
          0.4,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A plans an indoor picnic for entertainment.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.8,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A fixes a squeaky chair.",
        "values": [
          0.0,
          0.3,
          0.7,
          0.4,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A respects Agent B's package privacy.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.6,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a suburban home kitchen, Agent A is making a healthy breakfast, while Agent B is studying and Agent C fixes a cabinet. Discussions about plans and activities ensue, involving shared meals, exercise intentions, and equitable chore distribution.",
    "actions": [
      {
        "description": "Agent A tactfully balances pouring syrup.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.2,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A initiates a conversation.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers to help with study topics.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.8,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A proposes a family activity.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.9,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A organizes to tidy up dishes.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A checks the smoke detectors.",
        "values": [
          0.0,
          -0.2,
          0.9,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A leads a family planning session.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.4,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A secures cleaning supplies.",
        "values": [
          0.0,
          -0.2,
          0.8,
          0.1,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A schedules a family meeting.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.6,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A studying at the dining table, Agent B working on a puzzle, and Agent C cooking dinner create a typical family evening with an atmosphere of togetherness and well-being.",
    "actions": [
      {
        "description": "Agent A stands up to help Agent B with a puzzle.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A helps Agent C in the kitchen.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.5,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A ensures food is distributed equally.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.3,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests a family walk after dinner.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.4,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A starts a board game for everyone.",
        "values": [
          0.0,
          -0.1,
          0.4,
          0.7,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A praises Agent B's puzzle-solving effort.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A volunteers to clean up the dinner area.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.2,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A plans a balanced study and family time schedule.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A offers a dessert portion to Agent B.",
        "values": [
          0.0,
          -0.4,
          0.1,
          0.6,
          0.0,
          0.4
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In the heart of a family kitchen, Agent A prepares breakfast, ensuring a nutritious start to the day. Natural light warms the room as Agent B works on an essay and Agent C sets the table, illustrating a morning ripe with routine and care.",
    "actions": [
      {
        "description": "Agent A plates the pancakes, ensuring each family member gets an equal number.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.5,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A engages in light-hearted conversation to foster a jovial atmosphere.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.9,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A advises Agent B to take a short break from the essay to join them at the table.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.8,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent C to choose their preferred seating at the table, demonstrating inclusiveness.",
        "values": [
          0.0,
          0.1,
          0.1,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A opens a window to let in the morning breeze.",
        "values": [
          0.0,
          0.8,
          -0.2,
          0.6,
          0.0,
          0.1
        ]
      },
      {
        "description": "After breakfast, Agent A organizes a family walk around the neighborhood.",
        "values": [
          0.0,
          0.9,
          0.3,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A creates a game to see who can come up with the healthiest lunch idea, offering a small prize.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A locks the door and activates the home security system before the family walk.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.1,
          0.0,
          0.1
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a conscientious teenager, has recently moved into a dorm room at the university, sharing the space with Agent B, a classmate, and Agent C, a senior from a different department. The room is neat, with personal items carefully arranged to respect each other's space. One evening, they discuss the need for good ventilation while maintaining a suitable study environment.",
    "actions": [
      {
        "description": "Agent A proposes implementing a quiet hour policy starting from the time Agent C usually goes to bed.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A offers to assist Agent C in preparing a study corner that minimizes disturbance.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A helps Agent B set up a small painting area in a corner of the room that won't disturb sleeping roommates.",
        "values": [
          0.0,
          0.2,
          0.4,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A institutes a room cleaning day where all agents pitch in to declutter and clean the dorm room.",
        "values": [
          0.0,
          0.5,
          0.6,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A mediates a discussion between Agent B and Agent C about maintaining balance between study and leisure time.",
        "values": [
          0.0,
          0.1,
          0.5,
          0.8,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "The kitchen is bustling with the sounds of a family preparing for a dinner party. Agent A is meticulously chopping vegetables for the salad, ensuring each piece is cut with precision. Agent B is marinating the meat, while Agent C cleans the living space to make it welcoming for guests. The atmosphere is warm; the smell of spices mixes with the laughter and occasional playful bickering over culinary techniques.",
    "actions": [
      {
        "description": "Agent A organizes a quick exercise break for everyone to re-energize before the guests arrive.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.3,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A double-checks the smoke detectors and ensures the first aid kit is accessible.",
        "values": [
          0.0,
          0.5,
          0.9,
          0.2,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A puts on some music that everyone enjoys to create a festive atmosphere.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.8,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests holding a tasting contest to determine which dish will be the centerpiece, acknowledging each chef.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.7,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A initiates a friendly game where everyone gets to contribute an idea for the evening's entertainment.",
        "values": [
          0.0,
          0.1,
          0.3,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A rearranges the seating considering everyone's preferences and guest comfort.",
        "values": [
          0.0,
          0.4,
          0.5,
          0.4,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A offers to share a special recipe with Agent B who is eager to learn.",
        "values": [
          0.0,
          0.5,
          0.4,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A mediates an arising disagreement to keep the environment peaceful.",
        "values": [
          0.0,
          0.1,
          0.4,
          0.6,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A allocates tasks to avoid overburdening a single person.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.5,
          0.0,
          1.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A finishes preparing a balanced dinner for Agent B and Agent C. The family discusses their day, shares laughter, and ends with plans for a board game night.",
    "actions": [
      {
        "description": "Agent A invites Agents B and C to help prepare a vegetable garden in the backyard.",
        "values": [
          0.0,
          0.6,
          0.3,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A involves Agent B in creating a meal plan for the week.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A suggests a family bike ride after dinner.",
        "values": [
          0.0,
          0.8,
          -0.3,
          0.5,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A plans a weekly ‘international dinner’ night.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A organizes a family game night where everyone gets to choose games.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A volunteers their family to join a community clean-up initiative.",
        "values": [
          0.0,
          0.2,
          0.5,
          0.7,
          0.0,
          0.8
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is organizing a family meal, and the environment is set for a successful and joyful gathering. The scene hints at a family that values collaboration and involvement, anticipating an event that fulfills both physiological and emotional needs.",
    "actions": [
      {
        "description": "Agent A allocates tasks among everyone to finish the meal preparations efficiently.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A carefully stores the sharp knives out of Agent D's reach after chopping the vegetables.",
        "values": [
          0.0,
          -0.1,
          0.9,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A attentively listens to Agent D's idea and promises a quick family soccer game post lunch.",
        "values": [
          0.0,
          -0.2,
          -0.1,
          0.8,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A checks the completion status of each dish to determine if there's enough time to accommodate Agent D's request.",
        "values": [
          0.0,
          0.4,
          0.3,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a small break where everyone stretches and takes a few deep breaths of the fresh air coming from the backyard before continuing the work.",
        "values": [
          0.0,
          0.6,
          0.5,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A leads a light-hearted conversation to keep the mood enjoyable as everyone finishes their tasks.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A decides to let Agent D set the table as a way to involve the youngest member in the meal prep.",
        "values": [
          0.0,
          -0.3,
          0.4,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A proposes to begin the meal with a toast, appreciating everyone's contribution to the lunch.",
        "values": [
          0.0,
          -0.5,
          0.1,
          0.9,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A plans the timing of the post-meal soccer match to ensure everyone digests their food properly and reduces the risk of discomfort during the game.",
        "values": [
          0.0,
          0.3,
          0.8,
          0.4,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A prepares breakfast while Agents B and C sit at the table. The atmosphere is warm with shared contribution and communal decision-making.",
    "actions": [
      {
        "description": "Agent A offers to share the kitchen duties with Agents B and C, suggesting they could bake together later.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.7,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A decides to create a chore schedule to distribute household tasks among family members.",
        "values": [
          0.0,
          -0.4,
          0.2,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A encourages Agent B to take the remaining banana.",
        "values": [
          0.0,
          0.4,
          0.1,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A notices Agent C's empty cup and refills their coffee.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.6,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A discusses the importance of a good start to the morning.",
        "values": [
          0.0,
          0.6,
          0.4,
          0.4,
          0.0,
          -0.2
        ]
      },
      {
        "description": "Agent A organizes a family meeting for emergency drill practice.",
        "values": [
          0.0,
          -0.3,
          0.9,
          -0.1,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A establishes a clear cleanup routine after breakfast.",
        "values": [
          0.0,
          0.1,
          0.7,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A suggests a family walk in the park for exercise and air.",
        "values": [
          0.0,
          0.7,
          0.5,
          0.6,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A proposes a 'family day' for each member to choose an activity.",
        "values": [
          0.0,
          0.2,
          0.3,
          0.8,
          0.0,
          0.7
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a teenager, just returned from school to discover their sibling, Agent B, struggling to reposition furniture in their shared bedroom to maximize comfort and functionality for both. Agent C, their parent, has baked a pie that fills the house with a comforting smell and they feel content with the afternoon activities.",
    "actions": [
      {
        "description": "Agent A insists on taking breaks at regular intervals during the furniture moving to avoid exhaustion.",
        "values": [
          0.0,
          -0.5,
          0.1,
          0.3,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A reassures Agent B that they can work together to find a arrangement that suits both of them, showing care for their sibling's contentment.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.7,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A proposes they open the windows to let in fresh air while they work, to keep their environment comfortable.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.2,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A decides to layout their school items and compare with Agent B to ensure both have enough storage for their needs.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.2,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A suggests they both sample the pie Agent C made, as a mini-reward once they complete reorganizing the room.",
        "values": [
          0.0,
          0.2,
          0.0,
          0.8,
          0.0,
          0.0
        ]
      },
      {
        "description": "Agent A offers Agent B the choice of which side of the room they prefer, promoting an amicable solution.",
        "values": [
          0.0,
          0.0,
          0.0,
          0.6,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A measures the room and furniture to make educated decisions on the new layout using math and reasoning.",
        "values": [
          0.0,
          -0.2,
          0.0,
          0.1,
          0.0,
          0.0
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is a teenager who just got home from school, Agent B, their parent, has baked cookies and is setting up a board game, while Agent C, the younger sibling, completes homework at the dining table. The home is infused with a comforting atmosphere.",
    "actions": [
      {
        "description": "Agent A grabs a cookie and appreciates Agent B's effort.",
        "values": [
          0.0,
          0.2,
          0.1,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A washes their hands before joining the others.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A helps Agent C with homework.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.5,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A takes a break with Agent C for a game setup.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.6,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A suggests making a second batch of cookies together.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.7,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A engages in board game for family enjoyment.",
        "values": [
          0.0,
          -0.3,
          0.2,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A organizes their belongings to keep the home tidy.",
        "values": [
          0.0,
          -0.1,
          0.6,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A encourages Agent C's participation by choosing game pieces.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.8,
          0.0,
          0.9
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A, a university student and track team member, is in the family kitchen preparing a nutritious breakfast, while her parents are engaged in finance management and gardening respectively. The environment is quiet, productive, and stocked with fresh produce.",
    "actions": [
      {
        "description": "Agent A decides to make extra portions of breakfast to share with her parents.",
        "values": [
          0.0,
          0.5,
          0.2,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A starts to clean the kitchen after cooking to keep it tidy.",
        "values": [
          0.0,
          -0.1,
          0.8,
          0.4,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A sets up the table for three, ensuring equal portions for everyone.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.7,
          0.0,
          1.0
        ]
      },
      {
        "description": "Agent A offers to go grocery shopping for the family.",
        "values": [
          0.0,
          -0.4,
          0.4,
          0.3,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A checks the smoke detectors to ensure they work properly.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A schedules family meals for the week.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.9,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A engages her mother in conversation during breakfast.",
        "values": [
          0.0,
          -0.2,
          0.2,
          1.0,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests an afternoon of gardening to her family.",
        "values": [
          0.0,
          -0.2,
          0.4,
          0.6,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a sunny, spacious kitchen, Agent A is preparing a family breakfast, filling a fruit bowl with fresh produce while oatmeal simmers on the stove. Agent B is at the kitchen table with a magazine, and Agent C is setting the table. The atmosphere is cozy and calm.",
    "actions": [
      {
        "description": "Agent A decides to make an extra batch of pancakes to freeze for quick breakfasts later in the week.",
        "values": [
          0.0,
          0.6,
          0.1,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A organizes a spontaneous family game after breakfast to spend quality time together.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.9,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A carefully locks the house doors while preparing breakfast.",
        "values": [
          0.0,
          -0.1,
          1.0,
          0.1,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A invites Agent B and Agent C to help cook.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.7,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A chooses to donate some unused kitchen items to charity.",
        "values": [
          0.0,
          -0.2,
          -0.1,
          0.2,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A sets up a weekly meal prep schedule.",
        "values": [
          0.0,
          0.5,
          0.3,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A models positive conduct by expressing gratitude.",
        "values": [
          0.0,
          0.1,
          0.1,
          1.0,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "Agent A is preparing a sit-down Sunday dinner for their friends. Agent B is dusting the bookshelf, while Agent C helps Agent A in the kitchen.",
    "actions": [
      {
        "description": "Agent A checks the smoke detectors in the house.",
        "values": [
          0.0,
          0.1,
          0.9,
          0.3,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A plans to serve a meal considering all dietary restrictions.",
        "values": [
          0.0,
          0.7,
          0.4,
          0.8,
          0.0,
          0.9
        ]
      },
      {
        "description": "Agent A cleans and band-aids a cut Agent C gets.",
        "values": [
          0.0,
          0.2,
          0.8,
          0.5,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A proposes a toast, appreciating friends.",
        "values": [
          0.0,
          0.4,
          0.2,
          0.9,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A shares the recipes used for the dinner.",
        "values": [
          0.0,
          0.3,
          0.1,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A turns down the music for Agent B.",
        "values": [
          0.0,
          -0.1,
          0.3,
          0.6,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A ensures all guests can interact equally at the table.",
        "values": [
          0.0,
          0.2,
          0.2,
          0.7,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A monitors the kitchen appliances to prevent accidents.",
        "values": [
          0.0,
          -0.2,
          1.0,
          0.4,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A decides against an experimental dish last minute.",
        "values": [
          0.0,
          -0.3,
          0.7,
          -0.4,
          0.0,
          0.3
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a suburban home, Agent A is cooking brunch while Agents B and C work on a puzzle. The atmosphere is homely, with fresh air and the scent of baking.",
    "actions": [
      {
        "description": "Agent A prepares individual omelets for Agents B and C, tailored to their tastes.",
        "values": [
          0.0,
          0.7,
          0.2,
          0.6,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A initiates a playful competition to name the pet fish.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.8,
          0.0,
          0.7
        ]
      },
      {
        "description": "Agent A organizes a family movie time post-brunch.",
        "values": [
          0.0,
          -0.3,
          0.3,
          0.9,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A encourages a light neighborhood walk after eating.",
        "values": [
          0.0,
          0.6,
          0.7,
          0.4,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A resolves a minor puzzle conflict amicably.",
        "values": [
          0.0,
          -0.1,
          0.2,
          0.3,
          0.0,
          0.8
        ]
      },
      {
        "description": "Agent A includes Agents B and C in meal prep duties.",
        "values": [
          0.0,
          0.2,
          0.6,
          0.5,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A ensures balcony doors are locked after use.",
        "values": [
          0.0,
          -0.1,
          1.0,
          -0.2,
          0.0,
          0.2
        ]
      }
    ]
  },
  {
    "values": [
      "energy",
      "safety",
      "happiness",
      "fairness"
    ],
    "scenario": "In a suburban home, Agent A is aiding in dinner preparations with Agent B and Agent C while Agent D sets the dining table.",
    "actions": [
      {
        "description": "Agent A reviews a recipe book to ensure the casserole is cooked perfectly.",
        "values": [
          0.0,
          0.3,
          0.5,
          0.2,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A gathers everyone for dinner.",
        "values": [
          0.0,
          0.2,
          -0.1,
          0.5,
          0.0,
          0.4
        ]
      },
      {
        "description": "Agent A proposes a toast celebrating a family achievement.",
        "values": [
          0.0,
          -0.1,
          0.0,
          0.7,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A brings extra chairs to the table.",
        "values": [
          0.0,
          -0.2,
          0.2,
          0.2,
          0.0,
          0.6
        ]
      },
      {
        "description": "Agent A initiates a conversation about the day.",
        "values": [
          0.0,
          -0.1,
          0.1,
          0.6,
          0.0,
          0.2
        ]
      },
      {
        "description": "Agent A takes the initiative to clean up spills.",
        "values": [
          0.0,
          -0.3,
          0.6,
          0.1,
          0.0,
          0.1
        ]
      },
      {
        "description": "Agent A offers to help with cleaning dishes.",
        "values": [
          0.0,
          -0.4,
          0.3,
          0.3,
          0.0,
          0.5
        ]
      },
      {
        "description": "Agent A suggests a post-dinner board game.",
        "values": [
          0.0,
          -0.2,
          0.1,
          0.8,
          0.0,
          0.3
        ]
      },
      {
        "description": "Agent A packs up leftovers to avoid waste.",
        "values": [
          0.0,
          0.3,
          0.2,
          0.2,
          0.0,
          0.4
        ]
      }
    ]
  }
]